{
  "nodes": [
    {
      "name": "Frozen",
      "size": 1274219009,
      "keywords": [
        "queen",
        "musical",
        "princess",
        "betrayal",
        "snowman",
        "animation",
        "reindeer",
        "curse",
        "snow",
        "troll",
        "mountain climber",
        "aftercreditsstinger",
        "woman director",
        "3d"
      ],
      "user_rating": 7.3,
      "votes": 5295,
      "release_year": 2013,
      "overview": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
      "runtime": 102
    },
    {
      "name": "Minions",
      "size": 1156730962,
      "keywords": [
        "assistant",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "evil mastermind",
        "minions",
        "3d"
      ],
      "user_rating": 6.4,
      "votes": 4571,
      "release_year": 2015,
      "overview": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
      "runtime": 91
    },
    {
      "name": "Toy Story 3",
      "size": 1066969703,
      "keywords": [
        "hostage",
        "college",
        "toy",
        "barbie",
        "animation",
        "escape",
        "day care",
        "teddy bear",
        "duringcreditsstinger",
        "toy comes to life",
        "personification",
        "inanimate objects coming to life",
        "toy story"
      ],
      "user_rating": 7.6,
      "votes": 4597,
      "release_year": 2010,
      "overview": "Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally left at a nefarious day care center. The toys must band together to escape and return home to Andy.",
      "runtime": 103
    },
    {
      "name": "Despicable Me 2",
      "size": 970761885,
      "keywords": [
        "secret agent",
        "bakery",
        "falling in love",
        "father daughter relationship",
        "duringcreditsstinger",
        "first date",
        "minions",
        "3d"
      ],
      "user_rating": 7,
      "votes": 4637,
      "release_year": 2013,
      "overview": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal.",
      "runtime": 98
    },
    {
      "name": "Finding Nemo",
      "size": 940335536,
      "keywords": [
        "father son relationship",
        "harbor",
        "underwater",
        "fish tank",
        "great barrier reef",
        "missing child",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "short term memory loss",
        "clownfish",
        "father son reunion",
        "protective father"
      ],
      "user_rating": 7.6,
      "votes": 6122,
      "release_year": 2003,
      "overview": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
      "runtime": 100
    },
    {
      "name": "Shrek 2",
      "size": 919838758,
      "keywords": [
        "prison",
        "magic",
        "liberation",
        "honeymoon",
        "parents-in-law",
        "kingdom",
        "enchantment",
        "dancing scene",
        "transformation",
        "fairy-tale figure"
      ],
      "user_rating": 6.7,
      "votes": 2988,
      "release_year": 2004,
      "overview": "Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage.",
      "runtime": 93
    },
    {
      "name": "Ice Age: Dawn of the Dinosaurs",
      "size": 886686817,
      "keywords": [
        "ice age",
        "bridge",
        "insanity",
        "jungle",
        "dinosaur",
        "birth",
        "duringcreditsstinger",
        "3d"
      ],
      "user_rating": 6.5,
      "votes": 2271,
      "release_year": 2009,
      "overview": "Times are changing for Manny the moody mammoth, Sid the motor mouthed sloth and Diego the crafty saber-toothed tiger. Life heats up for our heroes when they meet some new and none-too-friendly neighbors – the mighty dinosaurs.",
      "runtime": 94
    },
    {
      "name": "Ice Age: Continental Drift",
      "size": 877244782,
      "keywords": [
        "blue footed booby",
        "prehistoric times",
        "melting ice",
        "badger",
        "elephant seal",
        "floating ice",
        "land bridge",
        "era",
        "glaciale",
        "deriva"
      ],
      "user_rating": 6.2,
      "votes": 2672,
      "release_year": 2012,
      "overview": "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world.",
      "runtime": 88
    },
    {
      "name": "The Secret Life of Pets",
      "size": 875958308,
      "keywords": [
        "pet",
        "bunny",
        "anthropomorphism",
        "dog",
        "animal",
        "apartment building",
        "sewer",
        "terrier",
        "manhattan, new york city",
        "rodent",
        "mongrel"
      ],
      "user_rating": 5.9,
      "votes": 3462,
      "release_year": 2016,
      "overview": "The quiet life of a terrier named Max is upended when his owner takes in Duke, a stray whom Max instantly dislikes.",
      "runtime": 87
    },
    {
      "name": "Inside Out",
      "size": 857611174,
      "keywords": [
        "dream",
        "cartoon",
        "imaginary friend",
        "animation",
        "family",
        "moving",
        "kids",
        "unicorn",
        "duringcreditsstinger",
        "3d",
        "emotions"
      ],
      "user_rating": 8,
      "votes": 6560,
      "release_year": 2015,
      "overview": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
      "runtime": 94
    },
    {
      "name": "Shrek the Third",
      "size": 798958165,
      "keywords": [
        "ambush",
        "sadness",
        "stage",
        "liberation of prisoners",
        "island",
        "traitor",
        "shipwreck",
        "prince",
        "ship",
        "donkey",
        "kingdom",
        "theatre play",
        "transformation",
        "conciliation",
        "tricks",
        "heir to the throne",
        "assault",
        "boarding school",
        "coup d'etat",
        "teacher",
        "best friend",
        "dragon",
        "cowardliness",
        "pregnancy",
        "capture",
        "duringcreditsstinger"
      ],
      "user_rating": 6,
      "votes": 2278,
      "release_year": 2007,
      "overview": "The King of Far Far Away has died and Shrek and Fiona are to become King &amp; Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom.",
      "runtime": 93
    },
    {
      "name": "The Lion King",
      "size": 788241776,
      "keywords": [
        "loss of parents",
        "wild boar",
        "uncle",
        "shaman",
        "redemption",
        "king",
        "scar",
        "hyena",
        "meerkat"
      ],
      "user_rating": 8,
      "votes": 5376,
      "release_year": 1994,
      "overview": "A young lion cub named Simba can't wait to be king. But his uncle craves the title for himself and will stop at nothing to get it.",
      "runtime": 89
    },
    {
      "name": "Shrek Forever After",
      "size": 752600867,
      "keywords": [
        "ogre",
        "3d"
      ],
      "user_rating": 6,
      "votes": 1959,
      "release_year": 2010,
      "overview": "A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love.",
      "runtime": 93
    },
    {
      "name": "Madagascar 3: Europe's Most Wanted",
      "size": 746921274,
      "keywords": [
        "madagascar",
        "3d"
      ],
      "user_rating": 6.4,
      "votes": 1808,
      "release_year": 2012,
      "overview": "Alex, Marty, Gloria and Melman are still trying to get back to the Big Apple and their beloved Central Park zoo, but first they need to find the penguins. When they travel to Monte Carlo, they attract the attention of Animal Control after gate crashing a party and are joined by the penguins, King Julian and Co., and the monkeys. How do a lion, zebra, hippo, giraffe, four penguins, two monkeys, three lemurs travel through Europe without attracting attention and get back to New York? They join a traveling circus. Their attempts to get back to New York are consistently hampered by the Captain of Animal Control who wants to make Alex part of her collection. Once they make it back to New York Marty, Alex, Gloria and Melman realize that they want to be part of the traveling circus.",
      "runtime": 93
    },
    {
      "name": "Monsters University",
      "size": 743559607,
      "keywords": [
        "monster",
        "dormitory",
        "games",
        "animation",
        "best friend",
        "university",
        "scary",
        "aftercreditsstinger"
      ],
      "user_rating": 7,
      "votes": 3528,
      "release_year": 2013,
      "overview": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends.",
      "runtime": 104
    },
    {
      "name": "Up",
      "size": 735099082,
      "keywords": [
        "age difference",
        "central and south america",
        "balloon",
        "animation",
        "floating in the air",
        "duringcreditsstinger",
        "exploring"
      ],
      "user_rating": 7.7,
      "votes": 6870,
      "release_year": 2009,
      "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "runtime": 96
    },
    {
      "name": "Kung Fu Panda 2",
      "size": 665692281,
      "keywords": [
        "martial arts",
        "hope",
        "fleet",
        "panda",
        "mission",
        "woman director"
      ],
      "user_rating": 6.7,
      "votes": 1880,
      "release_year": 2011,
      "overview": "Po is now living his dream as The Dragon Warrior, protecting the Valley of Peace alongside his friends and fellow kung fu masters, The Furious Five - Tigress, Crane, Mantis, Viper and Monkey. But Po’s new life of awesomeness is threatened by the emergence of a formidable villain, who plans to use a secret, unstoppable weapon to conquer China and destroy kung fu. It is up to Po and The Furious Five to journey across China to face this threat and vanquish it. But how can Po stop a weapon that can stop kung fu? He must look to his past and uncover the secrets of his mysterious origins; only then will he be able to unlock the strength he needs to succeed.",
      "runtime": 91
    },
    {
      "name": "Ice Age: The Meltdown",
      "size": 660940780,
      "keywords": [
        "mammoth",
        "sloth",
        "ice age",
        "barrier ice",
        "ice melting",
        "iceberg",
        "flooding",
        "adventure",
        "lovers",
        "deluge",
        "saber-toothed tiger"
      ],
      "user_rating": 6.5,
      "votes": 2951,
      "release_year": 2006,
      "overview": "Diego, Manny and Sid return in this sequel to the hit animated movie Ice Age. This time around, the deep freeze is over, and the ice-covered earth is starting to melt, which will destroy the trio's cherished valley. The impending disaster prompts them to reunite and warn all the other beasts about the desperate situation.",
      "runtime": 91
    },
    {
      "name": "Big Hero 6",
      "size": 652105443,
      "keywords": [
        "brother brother relationship",
        "hero",
        "talent",
        "revenge",
        "best friend",
        "another dimension",
        "robot",
        "boy genius",
        "hate",
        "aftercreditsstinger",
        "moral dilemma",
        "3d",
        "teen superheroes",
        "dead brother"
      ],
      "user_rating": 7.8,
      "votes": 6135,
      "release_year": 2014,
      "overview": "The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
      "runtime": 102
    },
    {
      "name": "Kung Fu Panda",
      "size": 631744560,
      "keywords": [
        "china",
        "martial arts",
        "kung fu",
        "mentor",
        "snake",
        "restaurant",
        "shop",
        "strong woman",
        "bravery",
        "tiger",
        "turtle",
        "panda",
        "sensei",
        "anthropomorphism",
        "fighting",
        "ancient china",
        "monkey",
        "master",
        "destiny",
        "evil",
        "aftercreditsstinger",
        "monkey warrior",
        "noodle"
      ],
      "user_rating": 6.9,
      "votes": 3145,
      "release_year": 2008,
      "overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
      "runtime": 90
    },
    {
      "name": "The Incredibles",
      "size": 631442092,
      "keywords": [
        "secret identity",
        "secret",
        "hero",
        "island",
        "wretch",
        "supernatural powers",
        "weapon",
        "lawsuit",
        "superhero"
      ],
      "user_rating": 7.4,
      "votes": 5152,
      "release_year": 2004,
      "overview": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
      "runtime": 115
    },
    {
      "name": "Ratatouille",
      "size": 623722818,
      "keywords": [
        "paris",
        "brother brother relationship",
        "expensive restaurant",
        "river",
        "cook",
        "mouse",
        "confidence",
        "roof",
        "window",
        "leaving one's family",
        "work",
        "restaurant critic",
        "kitchen",
        "spice",
        "court",
        "cookbook",
        "family",
        "chef",
        "rat"
      ],
      "user_rating": 7.5,
      "votes": 4369,
      "release_year": 2007,
      "overview": "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.",
      "runtime": 111
    },
    {
      "name": "How to Train Your Dragon 2",
      "size": 609123048,
      "keywords": [
        "father son relationship",
        "wife husband relationship",
        "sacrifice",
        "viking",
        "sequel",
        "rescue",
        "dragon",
        "mother son relationship",
        "death of husband",
        "warrior",
        "3d"
      ],
      "user_rating": 7.6,
      "votes": 3106,
      "release_year": 2014,
      "overview": "The thrilling second chapter of the epic How To Train Your Dragon trilogy brings back the fantastical world of Hiccup and Toothless five years later. While Astrid, Snotlout and the rest of the gang are challenging each other to dragon races (the island's new favorite contact sport), the now inseparable pair journey through the skies, charting unmapped territories and exploring new worlds. When one of their adventures leads to the discovery of a secret ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace.",
      "runtime": 102
    },
    {
      "name": "Madagascar: Escape 2 Africa",
      "size": 603900354,
      "keywords": [
        "africa",
        "jealousy",
        "dance",
        "hunger",
        "lion",
        "zoo",
        "hippopotamus",
        "chimp",
        "penguin",
        "volcano",
        "madagascar",
        "airplane",
        "zebra",
        "sequel",
        "shark",
        "imax",
        "duringcreditsstinger"
      ],
      "user_rating": 6.2,
      "votes": 1810,
      "release_year": 2008,
      "overview": "Alex, Marty, Melman, Gloria, King Julien, Maurice, the penguins and the chimps are back and still marooned on Madagascar. In the face of this obstacle, the New Yorkers have hatched a plan so crazy it just might work. With military precision, the penguins have repaired an old crashed plane... sort of.",
      "runtime": 89
    },
    {
      "name": "Tangled",
      "size": 591794936,
      "keywords": [
        "hostage",
        "magic",
        "horse",
        "fairy tale",
        "musical",
        "princess",
        "animation",
        "tower",
        "blonde woman",
        "selfishness",
        "healing power",
        "based on fairy tale",
        "duringcreditsstinger",
        "healing gift",
        "animal sidekick"
      ],
      "user_rating": 7.4,
      "votes": 3330,
      "release_year": 2010,
      "overview": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.",
      "runtime": 100
    },
    {
      "name": "The Croods",
      "size": 585178928,
      "keywords": [
        "stone age",
        "daughter",
        "father",
        "prehistoric",
        "ancient world",
        "father daughter relationship",
        "family",
        "cavemen",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.8,
      "votes": 2399,
      "release_year": 2013,
      "overview": "The Croods is a prehistoric comedy adventure that follows the world's first family as they embark on a journey of a lifetime when the cave that has always shielded them from danger is destroyed. Traveling across a spectacular landscape, the Croods discover an incredible new world filled with fantastic creatures -- and their outlook is changed forever.",
      "runtime": 98
    },
    {
      "name": "The Smurfs",
      "size": 563749323,
      "keywords": [
        "moon",
        "magic",
        "based on comic book",
        "animation",
        "good vs evil",
        "smurf",
        "blue",
        "vortex",
        "mischief",
        "cat and mouse",
        "duringcreditsstinger"
      ],
      "user_rating": 5.5,
      "votes": 1179,
      "release_year": 2011,
      "overview": "When the evil wizard Gargamel chases the tiny blue Smurfs out of their village, they tumble from their magical world and into ours -- in fact, smack dab in the middle of Central Park. Just three apples high and stuck in the Big Apple, the Smurfs must find a way to get back to their village before Gargamel tracks them down.",
      "runtime": 103
    },
    {
      "name": "Monsters, Inc.",
      "size": 562816256,
      "keywords": [
        "monster",
        "infant",
        "energy supply",
        "company",
        "rivalry",
        "hijinks",
        "best friend",
        "scream",
        "conveyor belt",
        "energy company",
        "friend"
      ],
      "user_rating": 7.5,
      "votes": 5996,
      "release_year": 2001,
      "overview": "James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business... even though they're more afraid of the children than they are of them. When a child accidentally enters their world, James and Mike suddenly find that kids are not to be afraid of and they uncover a conspiracy that could threaten all children across the world.",
      "runtime": 92
    },
    {
      "name": "Cars 2",
      "size": 559852396,
      "keywords": [
        "car race",
        "sequel",
        "comedy",
        "anthropomorphism",
        "best friend",
        "duringcreditsstinger"
      ],
      "user_rating": 5.8,
      "votes": 2033,
      "release_year": 2011,
      "overview": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
      "runtime": 106
    },
    {
      "name": "Puss in Boots",
      "size": 554987477,
      "keywords": [
        "adventure",
        "fairy-tale figure"
      ],
      "user_rating": 6.4,
      "votes": 451,
      "release_year": 2011,
      "overview": "Long before he even met Shrek, the notorious fighter, lover and outlaw Puss in Boots becomes a hero when he sets off on an adventure with the tough and street smart Kitty Softpaws and the mastermind Humpty Dumpty to save his town. This is the true story of The Cat, The Myth, The Legend... The Boots.",
      "runtime": 90
    },
    {
      "name": "Despicable Me",
      "size": 543513985,
      "keywords": [
        "adoptive father",
        "orphanage",
        "life's dream",
        "rivalry",
        "stealing",
        "ballet",
        "little girl",
        "orphan",
        "father daughter relationship",
        "tomboy",
        "mother son relationship",
        "intelligent",
        "kids",
        "evil doctor",
        "duringcreditsstinger",
        "minions",
        "supervillain",
        "3d",
        "despicable",
        "cattivissimo"
      ],
      "user_rating": 7.1,
      "votes": 6478,
      "release_year": 2010,
      "overview": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
      "runtime": 95
    },
    {
      "name": "Brave",
      "size": 538983207,
      "keywords": [
        "scotland",
        "rebel",
        "bravery",
        "kingdom",
        "archer",
        "wish",
        "bear",
        "scot",
        "rebellious daughter",
        "turns into animal",
        "archery",
        "ruins",
        "aftercreditsstinger",
        "peace offering",
        "woman director",
        "courage",
        "3d"
      ],
      "user_rating": 6.7,
      "votes": 4641,
      "release_year": 2012,
      "overview": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
      "runtime": 93
    },
    {
      "name": "Madagascar",
      "size": 532680671,
      "keywords": [
        "lion",
        "hippopotamus",
        "giraffe",
        "penguin",
        "zebra"
      ],
      "user_rating": 6.6,
      "votes": 3237,
      "release_year": 2005,
      "overview": "Zoo animals leave the comforts of man-made habitats for exotic adventure in this animated family film. After escaping from the zoo, four friends -- a lion, a hippo, a zebra and a giraffe -- are sent back to Africa. When their ship capsizes, stranding them on Madagascar, an island populated by crazy critters, the pals must adapt to jungle life and their new roles as wild animals.",
      "runtime": 86
    },
    {
      "name": "The Simpsons Movie",
      "size": 527068851,
      "keywords": [
        "father son relationship",
        "lake",
        "springfield",
        "the simpsons",
        "duff beer",
        "garbage",
        "pig",
        "pollution",
        "environmental protection agency",
        "quarantine",
        "alcoholism",
        "love",
        "alaska",
        "dysfunctional family",
        "dysfunctional marriage",
        "ecology",
        "saving lives",
        "first love",
        "duringcreditsstinger",
        "donuts"
      ],
      "user_rating": 6.9,
      "votes": 2264,
      "release_year": 2007,
      "overview": "After Homer accidentally pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
      "runtime": 87
    },
    {
      "name": "WALL·E",
      "size": 521311860,
      "keywords": [
        "romantic comedy"
      ],
      "user_rating": 7.8,
      "votes": 6296,
      "release_year": 2008,
      "overview": "WALL·E is the last robot left on an Earth that has been overrun with garbage and all humans have fled to outer space. For 700 years he has continued to try and clean up the mess, but has developed some rather interesting human-like qualities. When a ship arrives with a sleek new type of robot, WALL·E thinks he's finally found a friend and stows away on the ship when it leaves.",
      "runtime": 98
    },
    {
      "name": "Kung Fu Panda 3",
      "size": 521170825,
      "keywords": [
        "china",
        "martial arts",
        "kung fu",
        "village",
        "panda",
        "sequel",
        "talking animal",
        "anthropomorphism",
        "dragon",
        "ancient china",
        "wuxia",
        "woman director"
      ],
      "user_rating": 6.7,
      "votes": 1603,
      "release_year": 2016,
      "overview": "Continuing his \"legendary adventures of awesomeness\", Po must face two hugely epic, but different threats: one supernatural and the other a little closer to his home.",
      "runtime": 95
    },
    {
      "name": "Aladdin",
      "size": 504050219,
      "keywords": [
        "magic",
        "musical",
        "cartoon",
        "princess",
        "love",
        "comedy",
        "animation",
        "monkey",
        "arab",
        "aftercreditsstinger",
        "genie",
        "animal sidekick"
      ],
      "user_rating": 7.4,
      "votes": 3416,
      "release_year": 1992,
      "overview": "Princess Jasmine grows tired of being forced to remain in the palace and she sneaks out into the marketplace  in disguise where she meets street-urchin Aladdin and the two fall in love, although she may only marry a prince. After being thrown in jail, Aladdin and becomes embroiled in a plot to find a mysterious lamp with which the evil Jafar hopes to rule the land.",
      "runtime": 90
    },
    {
      "name": "Rio 2",
      "size": 500188435,
      "keywords": [
        "bird",
        "sequel",
        "jungle",
        "audition",
        "amazon rainforest",
        "parrots"
      ],
      "user_rating": 6.3,
      "votes": 978,
      "release_year": 2014,
      "overview": "It's a jungle out there for Blu, Jewel and their three kids after they're hurtled from Rio de Janeiro to the wilds of the Amazon. As Blu tries to fit in, he goes beak-to-beak with the vengeful Nigel, and meets the most fearsome adversary of all: his father-in-law.",
      "runtime": 102
    },
    {
      "name": "Toy Story 2",
      "size": 497366869,
      "keywords": [
        "museum",
        "prosecution",
        "identity crisis",
        "airplane",
        "flea market",
        "collector",
        "teamwork",
        "friendship",
        "rescue team",
        "garage sale",
        "duringcreditsstinger",
        "toy comes to life",
        "personification",
        "inanimate objects coming to life"
      ],
      "user_rating": 7.3,
      "votes": 3806,
      "release_year": 1999,
      "overview": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
      "runtime": 92
    },
    {
      "name": "How to Train Your Dragon",
      "size": 494878759,
      "keywords": [
        "flying",
        "blacksmith",
        "arena",
        "island",
        "night",
        "ship",
        "training",
        "village",
        "forest",
        "viking",
        "friendship",
        "ignorance",
        "flight",
        "nest",
        "dragon",
        "battle",
        "combat",
        "well",
        "warrior"
      ],
      "user_rating": 7.5,
      "votes": 4227,
      "release_year": 2010,
      "overview": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father",
      "runtime": 98
    },
    {
      "name": "Rio",
      "size": 484635760,
      "keywords": [
        "brazil",
        "pet",
        "bird",
        "musical",
        "canary",
        "samba",
        "animal",
        "duringcreditsstinger",
        "rio 1",
        "río 1"
      ],
      "user_rating": 6.5,
      "votes": 2166,
      "release_year": 2011,
      "overview": "Captured by smugglers when he was just a hatchling, a macaw named Blu never learned to fly and lives a happily domesticated life in Minnesota with his human friend, Linda. Blu is thought to be the last of his kind, but when word comes that Jewel, a lone female, lives in Rio de Janeiro, Blu and Linda go to meet her. Animal smugglers kidnap Blu and Jewel, but the pair soon escape and begin a perilous adventure back to freedom -- and Linda.",
      "runtime": 96
    },
    {
      "name": "Shrek",
      "size": 484409218,
      "keywords": [
        "magic",
        "liberation",
        "lordship",
        "castle",
        "robin hood",
        "enchantment",
        "fairy-tale figure",
        "princess",
        "parody",
        "woman director",
        "ogre"
      ],
      "user_rating": 7.3,
      "votes": 4056,
      "release_year": 2001,
      "overview": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
      "runtime": 90
    },
    {
      "name": "Hotel Transylvania 2",
      "size": 473226958,
      "keywords": [
        "transylvania",
        "hotel",
        "witch",
        "technology",
        "magic",
        "mummy",
        "dracula",
        "skeleton",
        "only child",
        "backpacker",
        "marriage",
        "frankenstein",
        "wolfman",
        "zombie",
        "moving out",
        "invisible man",
        "new life"
      ],
      "user_rating": 6.7,
      "votes": 1497,
      "release_year": 2015,
      "overview": "When the old-old-old-fashioned vampire Vlad arrives at the hotel for an impromptu family get-together, Hotel Transylvania is in for a collision of supernatural old-school and modern day cool.",
      "runtime": 89
    },
    {
      "name": "Wreck-It Ralph",
      "size": 471222889,
      "keywords": [
        "support group",
        "product placement",
        "bullying",
        "racing",
        "arcade",
        "medal",
        "self esteem",
        "curiosity",
        "precocious child",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "first person shooter",
        "glitch",
        "carefree",
        "video gamer",
        "q*bert",
        "interrupted wedding",
        "social reject"
      ],
      "user_rating": 7.1,
      "votes": 4570,
      "release_year": 2012,
      "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
      "runtime": 108
    },
    {
      "name": "The Lego Movie",
      "size": 469160692,
      "keywords": [
        "father son relationship",
        "creativity",
        "friendship",
        "part live action",
        "toys",
        "based on toy",
        "falling in love",
        "super powers",
        "duringcreditsstinger",
        "different worlds",
        "lego",
        "batman"
      ],
      "user_rating": 7.5,
      "votes": 3070,
      "release_year": 2014,
      "overview": "An ordinary Lego mini-figure, mistakenly thought to be the extraordinary MasterBuilder, is recruited to join a quest to stop an evil Lego tyrant from gluing the universe together.",
      "runtime": 100
    },
    {
      "name": "Cars",
      "size": 461983149,
      "keywords": [
        "car race",
        "car journey",
        "village and town",
        "auto",
        "route 66",
        "wrecker",
        "porsche",
        "retirement",
        "media",
        "friendship",
        "sport",
        "anthropomorphism",
        "los angeles",
        "road movie",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.6,
      "votes": 3877,
      "release_year": 2006,
      "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
      "runtime": 117
    },
    {
      "name": "Alvin and the Chipmunks: The Squeakquel",
      "size": 443140005,
      "keywords": [
        "chipmunk",
        "cgi",
        "based on tv series",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "woman director"
      ],
      "user_rating": 5.4,
      "votes": 666,
      "release_year": 2009,
      "overview": "Pop sensations Alvin, Simon and Theodore end up in the care of Dave Seville's twenty-something nephew Toby. The boys must put aside music super stardom to return to school, and are tasked with saving the school's music program by winning the $25,000 prize in a battle of the bands. But the Chipmunks unexpectedly meet their match in three singing chipmunks known as The Chipettes - Brittany, Eleanor and Jeanette. Romantic and musical sparks are ignited when the Chipmunks and Chipettes square off.",
      "runtime": 88
    },
    {
      "name": "Happy Feet",
      "size": 384335608,
      "keywords": [
        "ocean",
        "fish",
        "zoo",
        "penguin",
        "tap dancing",
        "love",
        "crush",
        "snow",
        "anthropomorphism",
        "singing",
        "antarctica",
        "family",
        "duringcreditsstinger"
      ],
      "user_rating": 5.9,
      "votes": 1410,
      "release_year": 2006,
      "overview": "Into the world of the Emperor Penguins, who find their soul mates through song, a penguin is born who cannot sing. But he can tap dance something fierce!",
      "runtime": 108
    },
    {
      "name": "Ice Age",
      "size": 383257136,
      "keywords": [
        "human evolution",
        "parents kids relationship",
        "squirrel",
        "ice",
        "loss of child",
        "mammoth",
        "sloth",
        "dying and death",
        "stone age",
        "prehistoric",
        "saber-toothed tiger",
        "cavemen",
        "prehistoric creature",
        "prehistoric adventure",
        "prehistoric times",
        "prehistoric man"
      ],
      "user_rating": 7.1,
      "votes": 3857,
      "release_year": 2002,
      "overview": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
      "runtime": 81
    },
    {
      "name": "Monsters vs Aliens",
      "size": 381509870,
      "keywords": [
        "alien",
        "giant robot",
        "duringcreditsstinger"
      ],
      "user_rating": 6,
      "votes": 1423,
      "release_year": 2009,
      "overview": "When Susan Murphy is unwittingly clobbered by a meteor full of outer space gunk on her wedding day, she mysteriously grows to 49-feet-11-inches. The military jumps into action and captures Susan, secreting her away to a covert government compound. She is renamed Ginormica and placed in confinement with a ragtag group of Monsters...",
      "runtime": 94
    },
    {
      "name": "Toy Story",
      "size": 373554033,
      "keywords": [
        "jealousy",
        "toy",
        "boy",
        "friendship",
        "friends",
        "rivalry",
        "boy next door",
        "new toy",
        "toy comes to life"
      ],
      "user_rating": 7.7,
      "votes": 5269,
      "release_year": 1995,
      "overview": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
      "runtime": 81
    },
    {
      "name": "Penguins of Madagascar",
      "size": 373552094,
      "keywords": [
        "penguin",
        "madagascar",
        "3d"
      ],
      "user_rating": 6.5,
      "votes": 1346,
      "release_year": 2014,
      "overview": "Skipper, Kowalski, Rico and Private join forces with undercover organization The North Wind to stop the villainous Dr. Octavius Brine from destroying the world as we know it.",
      "runtime": 92
    },
    {
      "name": "The Adventures of Tintin",
      "size": 371940071,
      "keywords": [
        "riddle",
        "captain",
        "treasure",
        "liquor",
        "treasure hunt",
        "sunken treasure",
        "plot",
        "reporter",
        "3d",
        "action"
      ],
      "user_rating": 6.7,
      "votes": 2061,
      "release_year": 2011,
      "overview": "Intrepid young reporter, Tintin and his loyal dog, Snowy are thrust into a world of high adventure when they discover a ship carrying an explosive secret. As Tintin is drawn into a centuries-old mystery, Ivan Ivanovitch Sakharine suspects him of stealing a priceless treasure. Tintin and Snowy, with the help of salty, cantankerous Captain Haddock and bumbling detectives, Thompson &amp; Thomson, travel half the world, one step ahead of their enemies as Tintin endeavors to find The Unicorn, a sunken ship that may hold a vast fortune, but also an ancient curse.",
      "runtime": 107
    },
    {
      "name": "Home",
      "size": 368871007,
      "keywords": [
        "friendship",
        "spaceship",
        "space",
        "alien",
        "alien invasion",
        "alien friendship",
        "awful leader",
        "taking resposibility"
      ],
      "user_rating": 6.8,
      "votes": 1519,
      "release_year": 2015,
      "overview": "When Earth is taken over by the overly-confident Boov, an alien race in search of a new place to call home, all humans are promptly relocated, while all Boov get busy reorganizing the planet. But when one resourceful girl, Tip, manages to avoid capture, she finds herself the accidental accomplice of a banished Boov named Oh. The two fugitives realize there’s a lot more at stake than intergalactic relations as they embark on the road trip of a lifetime.",
      "runtime": 94
    },
    {
      "name": "Shark Tale",
      "size": 367275019,
      "keywords": [
        "fish",
        "hero",
        "mission of murder",
        "threat to death",
        "secret love",
        "animation",
        "shark",
        "woman director"
      ],
      "user_rating": 5.8,
      "votes": 1557,
      "release_year": 2004,
      "overview": "Oscar is a small fish whose big aspirations often get him into trouble. Meanwhile, Lenny is a great white shark with a surprising secret that no sea creature would guess: He's a vegetarian. When a lie turns Oscar into an improbable hero and Lenny becomes an outcast, the two form an unlikely friendship.",
      "runtime": 90
    },
    {
      "name": "A Bug's Life",
      "size": 363258859,
      "keywords": [
        "winter",
        "fight",
        "ant",
        "invention",
        "collector",
        "ant-hill",
        "kids and family",
        "grass",
        "duringcreditsstinger"
      ],
      "user_rating": 6.8,
      "votes": 2303,
      "release_year": 1998,
      "overview": "On behalf of \"oppressed bugs everywhere,\" an inventive ant named Flik hires a troupe of warrior bugs to defend his bustling colony from a horde of freeloading grasshoppers led by the evil-minded Hopper.",
      "runtime": 95
    },
    {
      "name": "Alvin and the Chipmunks",
      "size": 361366633,
      "keywords": [
        "pop",
        "pop star",
        "record producer",
        "surprise",
        "approach",
        "forest",
        "music",
        "concert",
        "friendship",
        "performance",
        "chipmunk",
        "talking animal",
        "songwriter",
        "talking to animals",
        "duringcreditsstinger"
      ],
      "user_rating": 5.5,
      "votes": 1177,
      "release_year": 2007,
      "overview": "A struggling songwriter named Dave Seville finds success when he comes across a trio of singing chipmunks: mischievous leader Alvin, brainy Simon, and chubby, impressionable Theodore.",
      "runtime": 92
    },
    {
      "name": "Hotel Transylvania",
      "size": 358375603,
      "keywords": [
        "witch",
        "magic",
        "mummy",
        "vampire",
        "dracula",
        "skeleton",
        "backpacker",
        "frankenstein",
        "wolfman",
        "zombie",
        "invisible man",
        "duringcreditsstinger",
        " nosferatu",
        "protective father",
        "fang vamp"
      ],
      "user_rating": 6.8,
      "votes": 2566,
      "release_year": 2012,
      "overview": "Dracula, who operates a high-end resort away from the human world, goes into overprotective mode when a boy discovers the resort and falls for the count's teen-aged daughter.",
      "runtime": 91
    },
    {
      "name": "Dinosaur",
      "size": 354248063,
      "keywords": [
        "cataclysm",
        "asteroid",
        "leader",
        "comet",
        "animation",
        "prehistoric",
        "prehistoric egg",
        "dinosaur",
        "nesting grounds",
        "prehistoric creature",
        "prehistoric adventure",
        "lemur",
        "prehistoric times"
      ],
      "user_rating": 6.2,
      "votes": 542,
      "release_year": 2000,
      "overview": "An orphaned dinosaur raised by lemurs joins an arduous trek to a sancturary after a meteorite shower destroys his family home.",
      "runtime": 82
    },
    {
      "name": "The Angry Birds Movie",
      "size": 349779543,
      "keywords": [
        "island",
        "bird",
        "pig",
        "talking animal",
        "based on video game",
        "anger management",
        "3d"
      ],
      "user_rating": 5.9,
      "votes": 1022,
      "release_year": 2016,
      "overview": "An island populated entirely by happy, flightless birds or almost entirely. In this paradise, Red, a bird with a temper problem, speedy Chuck, and the volatile Bomb have always been outsiders. But when the island is visited by mysterious green piggies, it’s up to these unlikely outcasts to figure out what the pigs are up to.",
      "runtime": 97
    },
    {
      "name": "The Smurfs 2",
      "size": 347434178,
      "keywords": [
        "based on cartoon",
        "animation",
        "smurf"
      ],
      "user_rating": 5.5,
      "votes": 695,
      "release_year": 2013,
      "overview": "The evil wizard Gargamel creates a couple of mischievous Smurf-like creatures called the Naughties that he hopes will let him harness the all-powerful, magical Smurf-essence. But when he discovers that only a real Smurf can give him what he wants, and only a secret spell that Smurfette knows can turn the Naughties into real Smurfs, Gargamel kidnaps Smurfette and brings her to Paris, where he has been winning the adoration of millions as the world¹s greatest sorcerer. It's up to Papa, Clumsy, Grouchy, and Vanity to return to our world, reunite with their human friends Patrick and Grace Winslow, and rescue her! Will Smurfette, who has always felt different from the other Smurfs, find a new connection with the Naughties Vexy and Hackus or will the Smurfs convince her that their love for her is True Blue?",
      "runtime": 105
    },
    {
      "name": "Pocahontas",
      "size": 346079773,
      "keywords": [
        "culture clash",
        "settler",
        "forbidden love",
        "colony",
        "musical",
        "gold rush",
        "princess",
        "romance",
        "native american",
        "animation",
        "virginia",
        "star crossed lovers",
        "reference to pizarro",
        "jamestown virginia",
        "pug dog",
        "cross cultural relationship",
        "musket",
        "animate tree",
        "indian chief",
        "based on folk tale",
        "17th century",
        "shamanism",
        "songs",
        "indians vs. settlers",
        "animal sidekick",
        "powhatan",
        "land claim"
      ],
      "user_rating": 6.7,
      "votes": 1457,
      "release_year": 1995,
      "overview": "History comes gloriously to life in Disney's epic animated tale about love and adventure in the New World. Pocahontas is a Native American woman whose father has arranged for her to marry her village's best warrior. But a vision tells her change is coming, and soon she comes face to face with it in the form of Capt. John Smith.",
      "runtime": 81
    },
    {
      "name": "Over the Hedge",
      "size": 343397247,
      "keywords": [
        "squirrel",
        "eating and drinking",
        "vororte",
        "garden",
        "grizzly bear",
        "entrapment",
        "suburbian idyll",
        "garbage",
        "forest",
        "turtle",
        "hiding in a garbage container",
        "skunk",
        "racoon",
        "animal"
      ],
      "user_rating": 6.3,
      "votes": 1074,
      "release_year": 2006,
      "overview": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating – and learns a lesson about family himself.",
      "runtime": 83
    },
    {
      "name": "Alvin and the Chipmunks: Chipwrecked",
      "size": 342695435,
      "keywords": [
        "sequel",
        "chipmunk",
        "cruise ship",
        "overboard"
      ],
      "user_rating": 5.4,
      "votes": 484,
      "release_year": 2011,
      "overview": "Playing around while aboard a cruise ship, the Chipmunks and Chipettes accidentally go overboard and end up marooned in a tropical paradise. They discover their new turf is not as deserted as it seems.",
      "runtime": 87
    },
    {
      "name": "The Good Dinosaur",
      "size": 331926147,
      "keywords": [
        "tyrannosaurus rex",
        "friends",
        "alternate history",
        "dinosaur",
        "fear",
        "storm",
        "nature",
        "human",
        "journey"
      ],
      "user_rating": 6.6,
      "votes": 1736,
      "release_year": 2015,
      "overview": "An epic journey into the world of dinosaurs where an Apatosaurus named Arlo makes an unlikely human friend.",
      "runtime": 93
    },
    {
      "name": "A Christmas Carol",
      "size": 325233863,
      "keywords": [
        "holiday",
        "based on novel",
        "victorian england",
        "money",
        "christmas eve",
        "scrooge",
        "christmas carol",
        "ghost",
        "lesson",
        "charles dickens",
        "christmas"
      ],
      "user_rating": 6.6,
      "votes": 1095,
      "release_year": 2009,
      "overview": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
      "runtime": 96
    },
    {
      "name": "Megamind",
      "size": 321887208,
      "keywords": [
        "saving the world",
        "date",
        "prison",
        "secret identity",
        "fish",
        "gun",
        "dna",
        "mayor",
        "anti hero",
        "rain",
        "museum",
        "one-sided love",
        "serum",
        "talking animal",
        "reporter",
        "duringcreditsstinger",
        "stronger villain"
      ],
      "user_rating": 6.7,
      "votes": 1918,
      "release_year": 2010,
      "overview": "Bumbling supervillain Megamind finally defeats his nemesis, the superhero Metro Man. But without a hero, he loses all purpose and must find new meaning to his life.",
      "runtime": 95
    },
    {
      "name": "Chicken Little",
      "size": 314432665,
      "keywords": [
        "fish",
        "small town",
        "space marine",
        "chicken",
        "alien",
        "best friend",
        "alien invasion",
        "animal",
        "duringcreditsstinger",
        "3d"
      ],
      "user_rating": 5.6,
      "votes": 944,
      "release_year": 2005,
      "overview": "When the sky really is falling and sanity has flown the coop, who will rise to save the day? Together with his hysterical band of misfit friends, Chicken Little must hatch a plan to save the planet from alien invasion and prove that the world's biggest hero is a little chicken.",
      "runtime": 81
    },
    {
      "name": "The SpongeBob Movie: Sponge Out of Water",
      "size": 311594032,
      "keywords": [
        "ocean",
        "sea",
        "star",
        "water",
        "comedy",
        "sponge",
        "spongebob",
        "live action and animation"
      ],
      "user_rating": 5.8,
      "votes": 719,
      "release_year": 2015,
      "overview": "Burger Beard is a pirate who is in search of the final page of a magical book that makes any evil plan he writes in it come true, which happens to be the Krabby Patty secret formula. When the entire city of Bikini Bottom is put in danger, SpongeBob, Patrick, Mr. Krabs, Squidward, Sandy, and Plankton need to go on a quest that takes them to the surface. In order to get back the recipe and save their city, the gang must retrieve the book and transform themselves into superheroes.",
      "runtime": 93
    },
    {
      "name": "Bolt",
      "size": 309979994,
      "keywords": [
        "hamster",
        "kids and family",
        "animal",
        "cat vs dog",
        "duringcreditsstinger",
        "dog cat friendship",
        "animal lead",
        "girl dog relationship"
      ],
      "user_rating": 6.3,
      "votes": 1750,
      "release_year": 2008,
      "overview": "Bolt is the star of the biggest show in Hollywood. The only problem is, he thinks it's real. After he's accidentally shipped to New York City and separated from Penny, his beloved co-star and owner, Bolt must harness all his \"super powers\" to find a way home.",
      "runtime": 98
    },
    {
      "name": "Rise of the Guardians",
      "size": 306941670,
      "keywords": [
        "dream",
        "santa claus",
        "nightmare",
        "easter bunny",
        "tooth fairy",
        "jack frost",
        "sandman",
        "duringcreditsstinger"
      ],
      "user_rating": 7.1,
      "votes": 1922,
      "release_year": 2012,
      "overview": "When an evil spirit known as Pitch lays down the gauntlet to take over the world, the immortal Guardians must join forces for the first time to protect the hopes, beliefs and imagination of children all over the world.",
      "runtime": 97
    },
    {
      "name": "The Polar Express",
      "size": 305875730,
      "keywords": [
        "santa claus",
        "nerd",
        "faith",
        "gift",
        "bell",
        "beard",
        "north pole",
        "chute",
        "trestle",
        "ticket",
        "christmas"
      ],
      "user_rating": 6.4,
      "votes": 1474,
      "release_year": 2004,
      "overview": "When a doubting young boy takes an extraordinary train ride to the North Pole, he embarks on a journey of self-discovery that shows him that the wonder of life never fades for those who believe.",
      "runtime": 100
    },
    {
      "name": "Mulan",
      "size": 304320254,
      "keywords": [
        "homeland",
        "musical",
        "training",
        "daughter",
        "cricket",
        "princess",
        "dragon",
        "luck"
      ],
      "user_rating": 7.6,
      "votes": 2008,
      "release_year": 1998,
      "overview": "A tomboyish girl disguises herself as a young man so she can fight with the Imperial Chinese Army against the invading Huns. With help from wise-cracking dragon Mushu, Mulan just might save her country -- and win the heart of handsome Captain Li Shang.",
      "runtime": 88
    },
    {
      "name": "Stuart Little",
      "size": 300135367,
      "keywords": [
        "brother brother relationship",
        "based on novel",
        "cat",
        "mouse",
        "adoption",
        "orphanage",
        "step brother",
        "kids and family",
        "new york city twin towers",
        "gangster"
      ],
      "user_rating": 5.8,
      "votes": 959,
      "release_year": 1999,
      "overview": "The adventures of a heroic and debonair stalwart mouse named Stuart Little with human qualities, who faces some comic misadventures while searching for his lost bird friend and living with a human family as their child.",
      "runtime": 84
    },
    {
      "name": "Bee Movie",
      "size": 287594577,
      "keywords": [
        "factory worker",
        "tennis",
        "flower",
        "florist",
        "flower shop",
        "pilot",
        "college",
        "airplane",
        "beehive",
        "court",
        "aftercreditsstinger"
      ],
      "user_rating": 5.7,
      "votes": 1171,
      "release_year": 2007,
      "overview": "Barry B. Benson, a bee who has just graduated from college, is disillusioned at his lone career choice: making honey. On a special trip outside the hive, Barry's life is saved by Vanessa, a florist in New York City. As their relationship blossoms, he discovers humans actually eat honey, and subsequently decides to sue us.",
      "runtime": 91
    },
    {
      "name": "Turbo",
      "size": 282570682,
      "keywords": [
        "underdog",
        "car race",
        "dream",
        "speed",
        "power",
        "snail",
        "fast",
        "friends",
        "superpower",
        "racer"
      ],
      "user_rating": 6.1,
      "votes": 1074,
      "release_year": 2013,
      "overview": "The tale of an ordinary garden snail who dreams of winning the Indy 500.",
      "runtime": 96
    },
    {
      "name": "Spirited Away",
      "size": 274925095,
      "keywords": [
        "witch",
        "parents kids relationship",
        "magic",
        "twilight",
        "darkness",
        "village and town",
        "bath house",
        "pig",
        "ghost world",
        "biology",
        "train",
        "amusement park",
        "yokai",
        "japanese mythology",
        "anime"
      ],
      "user_rating": 8.3,
      "votes": 3840,
      "release_year": 2001,
      "overview": "A ten year old girl who wanders away from her parents along a path that leads to a world ruled by strange and unusual monster-like animals. Her parents have been changed into pigs along with others inside a bathhouse full of these creatures. Will she ever see the world how it once was?",
      "runtime": 125
    },
    {
      "name": "Mr. Peabody & Sherman",
      "size": 272912430,
      "keywords": [
        "father son relationship",
        "egypt",
        "intelligence",
        "adoption",
        "time travel",
        "boy",
        "child prodigy",
        "friendship",
        "growing up",
        "children",
        "talking animal",
        "talking dog",
        "dog",
        "first love",
        "ancient egypt",
        "time traveler",
        "duringcreditsstinger",
        "new school",
        "george washington",
        "gags",
        "trouble",
        "time paradox",
        "prodigy"
      ],
      "user_rating": 6.7,
      "votes": 843,
      "release_year": 2014,
      "overview": "A young boy and his dog, who happens to have a genius-level IQ, spring into action when their time-travel machine is stolen and moments in history begin to be changed.",
      "runtime": 92
    },
    {
      "name": "Epic",
      "size": 268426634,
      "keywords": [
        "fantasy",
        "miniature people"
      ],
      "user_rating": 6.4,
      "votes": 1121,
      "release_year": 2013,
      "overview": "A teenager finds herself transported to a deep forest setting where a battle between the forces of good and the forces of evil is taking place. She bands together with a rag-tag group characters in order to save their world -- and ours.",
      "runtime": 102
    },
    {
      "name": "Bambi",
      "size": 267447150,
      "keywords": [
        "forest",
        "coming of age",
        "best friend",
        "loss of loved one"
      ],
      "user_rating": 6.8,
      "votes": 1405,
      "release_year": 1942,
      "overview": "Bambi's tale unfolds from season to season as the young prince of the forest learns about life, love, and friends.",
      "runtime": 70
    },
    {
      "name": "The Princess and the Frog",
      "size": 267045765,
      "keywords": [
        "based on novel",
        "voodoo",
        "kiss",
        "princess",
        "animation",
        "cajun",
        "firefly",
        "based on fairy tale",
        "duringcreditsstinger",
        "big dreams",
        "frog prince",
        "charlatan"
      ],
      "user_rating": 6.7,
      "votes": 1247,
      "release_year": 2009,
      "overview": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to do face the same problem after she kisses him.",
      "runtime": 97
    },
    {
      "name": "Robots",
      "size": 260696994,
      "keywords": [
        "inventor",
        "business man",
        "robot",
        "dishonesty"
      ],
      "user_rating": 6,
      "votes": 1333,
      "release_year": 2005,
      "overview": "Rodney Copperbottom is a young robot inventor who dreams of making the world a better place, until the evil Ratchet takes over Big Weld Industries. Now, Rodney's dreams – and those of his friends – are in danger of becoming obsolete.",
      "runtime": 91
    },
    {
      "name": "Space Jam",
      "size": 250200000,
      "keywords": [
        "sport",
        "basketball",
        "doctor",
        "basketball team",
        "basketball game",
        "referee",
        "basketball court",
        "tweety bird",
        "speedy gonzales",
        "cartoon chicken",
        "sylvester the cat",
        "cartoon reality crossover",
        "basketball hoop",
        "cartoon skunk"
      ],
      "user_rating": 6.5,
      "votes": 1288,
      "release_year": 1996,
      "overview": "In a desperate attempt to win a basketball match and earn their freedom, the Looney Tunes seek the aid of retired basketball champion, Michael Jordan.",
      "runtime": 88
    },
    {
      "name": "Cloudy with a Chance of Meatballs 2",
      "size": 248384621,
      "keywords": [
        "inventor",
        "food",
        "scientist"
      ],
      "user_rating": 6.4,
      "votes": 915,
      "release_year": 2013,
      "overview": "After the disastrous food storm in the first film, Flint and his friends are forced to leave the town. Flint accepts the invitation from his idol Chester V to join The Live Corp Company, which has been tasked to clean the island, and where the best inventors in the world create technologies for the betterment of mankind. When Flint discovers that his machine still operates and now creates mutant food beasts like living pickles, hungry tacodiles, shrimpanzees and apple pie-thons, he and his friends must return to save the world.",
      "runtime": 95
    },
    {
      "name": "The Peanuts Movie",
      "size": 246233113,
      "keywords": [
        "based on comic strip",
        "family",
        "3d",
        "charlie brown",
        "snoopy"
      ],
      "user_rating": 6.5,
      "votes": 604,
      "release_year": 2015,
      "overview": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their arch-nemesis, while his best pal Charlie Brown begins his own epic quest back home.",
      "runtime": 88
    },
    {
      "name": "Rango",
      "size": 245724603,
      "keywords": [
        "sheriff",
        "nevada",
        "pet",
        "rango",
        "chameleon",
        "las vegas",
        "cactus",
        "terrarium",
        "construction site",
        "armadillo",
        "disillusionment"
      ],
      "user_rating": 6.6,
      "votes": 2051,
      "release_year": 2011,
      "overview": "When Rango, a lost family pet, accidentally winds up in the gritty, gun-slinging town of Dirt, the less-than-courageous lizard suddenly finds he stands out. Welcomed as the last hope the town has been waiting for, new Sheriff Rango is forced to play his new role to the hilt.",
      "runtime": 107
    },
    {
      "name": "Cloudy with a Chance of Meatballs",
      "size": 242988466,
      "keywords": [
        "weather",
        "food",
        "science"
      ],
      "user_rating": 6.5,
      "votes": 1747,
      "release_year": 2009,
      "overview": "Inventor Flint Lockwood creates a machine that makes clouds rain food, enabling the down-and-out citizens of Chewandswallow to feed themselves. But when the falling food reaches gargantuan proportions, Flint must scramble to avert disaster. Can he regain control of the machine and put an end to the wild weather before the town is destroyed?",
      "runtime": 90
    },
    {
      "name": "Howl's Moving Castle",
      "size": 234710455,
      "keywords": [
        "flying",
        "witch",
        "rain",
        "castle",
        "scarecrow",
        "body exchange",
        "hatter",
        "bakery",
        "demon",
        "anime"
      ],
      "user_rating": 8.2,
      "votes": 1991,
      "release_year": 2004,
      "overview": "When Sophie, a shy young woman, is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking home.",
      "runtime": 119
    },
    {
      "name": "Alvin and the Chipmunks: The Road Chip",
      "size": 233755553,
      "keywords": [
        "chipmunk",
        "cgi",
        "talking animal",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 5.8,
      "votes": 428,
      "release_year": 2015,
      "overview": "Through a series of misunderstandings, Alvin, Simon and Theodore come to believe that Dave is going to propose to his new girlfriend in New York City - and dump them. They have three days to get to him and stop the proposal.",
      "runtime": 92
    },
    {
      "name": "Chicken Run",
      "size": 224834564,
      "keywords": [
        "chicken",
        "freedom",
        "escape",
        "chicken farm",
        "pie machine"
      ],
      "user_rating": 6.5,
      "votes": 1150,
      "release_year": 2000,
      "overview": "Having been hopelessly repressed and facing eventual certain death at the British chicken farm where they are held, Rocky the american rooster and Ginger the chicken decide to rebel against the evil Mr. and Mrs. Tweedy, the farm's owners. Rocky and Ginger lead their fellow chickens in a great escape from the murderous farmers and their farm of doom.",
      "runtime": 84
    },
    {
      "name": "The Prince of Egypt",
      "size": 218613188,
      "keywords": [
        "moses",
        "egypt",
        "pyramid",
        "exodus",
        "kingdom",
        "governance",
        "ancient egypt",
        "hebrew",
        "pharaoh",
        "woman director"
      ],
      "user_rating": 6.8,
      "votes": 817,
      "release_year": 1998,
      "overview": "This is the extraordinary tale of two brothers named Moses and Ramses, one born of royal blood, and one an orphan with a secret past. Growing up the best of friends, they share a strong bond of free-spirited youth and good-natured rivalry. But the truth will ultimately set them at odds, as one becomes the ruler of the most powerful empire on earth, and the other the chosen leader of his people! Their final confrontation will forever change their lives and the world.",
      "runtime": 99
    },
    {
      "name": "Yogi Bear",
      "size": 201584141,
      "keywords": [
        "picnic",
        "sandwich",
        "bear",
        "3d",
        "yogi"
      ],
      "user_rating": 5.2,
      "votes": 220,
      "release_year": 2010,
      "overview": "Jellystone Park has been losing business, so greedy Mayor Brown decides to shut it down and sell the land. That means families will no longer be able to experience the natural beauty of the outdoors -- and, even worse, Yogi and Boo Boo will be tossed out of the only home they've ever known. Faced with his biggest challenge ever, Yogi must prove that he really is \"smarter than the average bear\" as he and Boo Boo join forces with their old nemesis Ranger Smith to find a way to save Jellystone Park from closing forever.",
      "runtime": 80
    },
    {
      "name": "Garfield",
      "size": 200804534,
      "keywords": [
        "competition",
        "moderator",
        "lasagne",
        "garfield"
      ],
      "user_rating": 5.2,
      "votes": 820,
      "release_year": 2004,
      "overview": "Garfield, the fat, lazy, lasagna lover, has everything a cat could want. But when Jon, in an effort to impress the Liz - the vet and an old high-school crush - adopts a dog named Odie and brings him home, Garfield gets the one thing he doesn't want. Competition.",
      "runtime": 80
    },
    {
      "name": "Open Season",
      "size": 197309027,
      "keywords": [
        "hunter",
        "mountains",
        "garage",
        "grizzly bear",
        "bunny",
        "chase",
        "forest",
        "deer",
        "bear",
        "hunt"
      ],
      "user_rating": 6.1,
      "votes": 656,
      "release_year": 2006,
      "overview": "Boog, a domesticated 900lb. Grizzly bear finds himself stranded in the woods 3 days before Open Season. Forced to rely on Elliot, a fast-talking mule deer, the two form an unlikely friendship and must quickly rally other forest animals if they are to form a rag-tag army against the hunters.",
      "runtime": 83
    },
    {
      "name": "Beowulf",
      "size": 195735876,
      "keywords": [
        "denmark",
        "nordic mythology",
        "lie",
        "pride and vanity",
        "folk hero",
        "human weakness",
        "viking",
        "alienation",
        "festival hall",
        "sin",
        "royalty",
        "curse",
        "battle",
        "ancient world",
        "adult animation",
        "motion capture"
      ],
      "user_rating": 5.5,
      "votes": 841,
      "release_year": 2007,
      "overview": "6th-century Scandinavian warrior, Beowulf embarks on a mission to slay the manlike ogre Grendel, a descendant of Cain.",
      "runtime": 115
    },
    {
      "name": "The Curse of the Were-Rabbit",
      "size": 192452832,
      "keywords": [
        "competition",
        "garden",
        "vegetable",
        "stop motion",
        "animation",
        "contest",
        "dog",
        "rabbit",
        "pest control",
        "giant vegetable",
        "wallace & gromit"
      ],
      "user_rating": 6.8,
      "votes": 643,
      "release_year": 2005,
      "overview": "Cheese-loving eccentric Wallace and his cunning canine pal, Gromit, investigate a mystery in Nick Park's animated adventure, in which the lovable inventor and his intrepid pup run a business ridding the town of garden pests. Using only humane methods that turn their home into a halfway house for evicted vermin, the pair stumble upon a mystery involving a voracious vegetarian monster that threatens to ruin the annual veggie-growing contest.",
      "runtime": 85
    },
    {
      "name": "Ponyo",
      "size": 187479518,
      "keywords": [
        "mother",
        "fish",
        "cliff",
        "father",
        "mermaid",
        "princess",
        "anime"
      ],
      "user_rating": 7.5,
      "votes": 926,
      "release_year": 2008,
      "overview": "The son of a sailor, 5-year old Sosuke lives a quiet life on an oceanside cliff with his mother Lisa. One fateful day, he finds a beautiful goldfish trapped in a bottle on the beach and upon rescuing her, names her Ponyo. But she is no ordinary goldfish. The daughter of a masterful wizard and a sea goddess, Ponyo uses her father's magic to transform herself into a young girl and quickly falls in love with Sosuke, but the use of such powerful sorcery causes a dangerous imbalance in the world. As the moon steadily draws nearer to the earth and Ponyo's father sends the ocean's mighty waves to find his daughter, the two children embark on an adventure of a lifetime to save the world and fulfill Ponyo's dreams of becoming human.",
      "runtime": 100
    },
    {
      "name": "Atlantis: The Lost Empire",
      "size": 186053725,
      "keywords": [
        "sea",
        "atlantis",
        "animation",
        "underwater",
        "sea monster"
      ],
      "user_rating": 6.7,
      "votes": 1224,
      "release_year": 2001,
      "overview": "The world's most highly qualified crew of archaeologists and explorers is led by historian Milo Thatch as they board the incredible 1,000-foot submarine Ulysses and head deep into the mysteries of the sea.",
      "runtime": 95
    },
    {
      "name": "Snow White and the Seven Dwarfs",
      "size": 184925486,
      "keywords": [
        "poison",
        "witch",
        "becoming an adult",
        "sadness",
        "queen",
        "attempted murder",
        "dying and death",
        "appearance",
        "princess",
        "candlelight vigil",
        "snow white"
      ],
      "user_rating": 6.9,
      "votes": 1914,
      "release_year": 1937,
      "overview": "A beautiful girl, Snow White, takes refuge in the forest in the house of seven dwarfs to hide from her stepmother, the wicked Queen. The Queen is jealous because she wants to be known as \"the fairest in the land,\" and Snow White's beauty surpasses her own.",
      "runtime": 83
    },
    {
      "name": "Hop",
      "size": 183953723,
      "keywords": [
        "coup d'etat",
        "slacker",
        "easter",
        "easter bunny",
        "aftercreditsstinger",
        "live action and animation"
      ],
      "user_rating": 5.5,
      "votes": 331,
      "release_year": 2011,
      "overview": "E.B., the Easter Bunny's teenage son, heads to Hollywood, determined to become a drummer in a rock 'n' roll band. In LA, he's taken in by Fred after the out-of-work slacker hits E.B. with his car.",
      "runtime": 95
    }
  ],
  "links": [
    {
      "source": "Frozen",
      "target": "Minions",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Monsters University",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Big Hero 6",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Tangled",
      "value": 3
    },
    {
      "source": "Frozen",
      "target": "Brave",
      "value": 3
    },
    {
      "source": "Frozen",
      "target": "Aladdin",
      "value": 4
    },
    {
      "source": "Frozen",
      "target": "Shrek",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Shark Tale",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Pocahontas",
      "value": 3
    },
    {
      "source": "Frozen",
      "target": "Mulan",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Frozen",
      "target": "Snow White and the Seven Dwarfs",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Despicable Me 2",
      "value": 3
    },
    {
      "source": "Minions",
      "target": "Finding Nemo",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Ice Age: Dawn of the Dinosaurs",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Big Hero 6",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Despicable Me",
      "value": 3
    },
    {
      "source": "Minions",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Up",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Tangled",
      "value": 3
    },
    {
      "source": "Toy Story 3",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Toy Story 2",
      "value": 4
    },
    {
      "source": "Toy Story 3",
      "target": "Toy Story",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Ice Age: Dawn of the Dinosaurs",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Despicable Me",
      "value": 4
    },
    {
      "source": "Despicable Me 2",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "The Simpsons Movie",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Hotel Transylvania",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Mr. Peabody & Sherman",
      "value": 2
    },
    {
      "source": "Finding Nemo",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "Shrek 2",
      "target": "Shrek the Third",
      "value": 2
    },
    {
      "source": "Shrek 2",
      "target": "Shrek",
      "value": 4
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Despicable Me",
      "value": 2
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "The Secret Life of Pets",
      "target": "Rio",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Up",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Tangled",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Despicable Me",
      "value": 3
    },
    {
      "source": "Inside Out",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Rise of the Guardians",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Peanuts Movie",
      "value": 2
    },
    {
      "source": "Shrek the Third",
      "target": "Cars 2",
      "value": 2
    },
    {
      "source": "Shrek the Third",
      "target": "How to Train Your Dragon",
      "value": 3
    },
    {
      "source": "Shrek the Third",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Madagascar 3: Europe's Most Wanted",
      "target": "Penguins of Madagascar",
      "value": 2
    },
    {
      "source": "Monsters University",
      "target": "Big Hero 6",
      "value": 2
    },
    {
      "source": "Monsters University",
      "target": "Monsters, Inc.",
      "value": 2
    },
    {
      "source": "Monsters University",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "Up",
      "target": "Tangled",
      "value": 2
    },
    {
      "source": "Up",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Up",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Kung Fu Panda 2",
      "target": "Kung Fu Panda",
      "value": 2
    },
    {
      "source": "Kung Fu Panda 2",
      "target": "Kung Fu Panda 3",
      "value": 3
    },
    {
      "source": "Ice Age: The Meltdown",
      "target": "Ice Age",
      "value": 3
    },
    {
      "source": "Big Hero 6",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Big Hero 6",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Kung Fu Panda 3",
      "value": 6
    },
    {
      "source": "Kung Fu Panda",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Ratatouille",
      "target": "Stuart Little",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon 2",
      "target": "Despicable Me",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon 2",
      "target": "Kung Fu Panda 3",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon 2",
      "target": "How to Train Your Dragon",
      "value": 3
    },
    {
      "source": "Madagascar: Escape 2 Africa",
      "target": "Cars 2",
      "value": 2
    },
    {
      "source": "Madagascar: Escape 2 Africa",
      "target": "Madagascar",
      "value": 4
    },
    {
      "source": "Madagascar: Escape 2 Africa",
      "target": "Toy Story 2",
      "value": 2
    },
    {
      "source": "Madagascar: Escape 2 Africa",
      "target": "Happy Feet",
      "value": 3
    },
    {
      "source": "Madagascar: Escape 2 Africa",
      "target": "Penguins of Madagascar",
      "value": 2
    },
    {
      "source": "Tangled",
      "target": "The Smurfs",
      "value": 3
    },
    {
      "source": "Tangled",
      "target": "Aladdin",
      "value": 5
    },
    {
      "source": "Tangled",
      "target": "Rio",
      "value": 2
    },
    {
      "source": "Tangled",
      "target": "Shrek",
      "value": 2
    },
    {
      "source": "Tangled",
      "target": "Hotel Transylvania",
      "value": 2
    },
    {
      "source": "Tangled",
      "target": "Pocahontas",
      "value": 4
    },
    {
      "source": "Tangled",
      "target": "Mulan",
      "value": 2
    },
    {
      "source": "Tangled",
      "target": "The Princess and the Frog",
      "value": 4
    },
    {
      "source": "The Croods",
      "target": "Despicable Me",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Ice Age",
      "value": 3
    },
    {
      "source": "The Croods",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "Hotel Transylvania",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "The Smurfs 2",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Kung Fu Panda 3",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Cars",
      "value": 3
    },
    {
      "source": "Cars 2",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Despicable Me",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Brave",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Brave",
      "target": "The Prince of Egypt",
      "value": 2
    },
    {
      "source": "Brave",
      "target": "Yogi Bear",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "Mr. Peabody & Sherman",
      "value": 3
    },
    {
      "source": "Kung Fu Panda 3",
      "target": "How to Train Your Dragon",
      "value": 2
    },
    {
      "source": "Aladdin",
      "target": "Shrek",
      "value": 2
    },
    {
      "source": "Aladdin",
      "target": "Pocahontas",
      "value": 4
    },
    {
      "source": "Aladdin",
      "target": "Mulan",
      "value": 2
    },
    {
      "source": "Aladdin",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Toy Story",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "A Bug's Life",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Mr. Peabody & Sherman",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon",
      "target": "Mulan",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon",
      "target": "Beowulf",
      "value": 2
    },
    {
      "source": "Rio",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Rio",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Hotel Transylvania 2",
      "target": "Hotel Transylvania",
      "value": 10
    },
    {
      "source": "Hotel Transylvania 2",
      "target": "Spirited Away",
      "value": 2
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "The Lego Movie",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "The Lego Movie",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "The Lego Movie",
      "target": "Mr. Peabody & Sherman",
      "value": 3
    },
    {
      "source": "Cars",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Mr. Peabody & Sherman",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks: The Squeakquel",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks: The Squeakquel",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 4
    },
    {
      "source": "Happy Feet",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Happy Feet",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Ice Age",
      "target": "Dinosaur",
      "value": 4
    },
    {
      "source": "Monsters vs Aliens",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Toy Story",
      "target": "Mr. Peabody & Sherman",
      "value": 2
    },
    {
      "source": "Home",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "A Bug's Life",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks",
      "target": "Mr. Peabody & Sherman",
      "value": 3
    },
    {
      "source": "Alvin and the Chipmunks",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 3
    },
    {
      "source": "Hotel Transylvania",
      "target": "Spirited Away",
      "value": 2
    },
    {
      "source": "Pocahontas",
      "target": "Mulan",
      "value": 2
    },
    {
      "source": "Pocahontas",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Over the Hedge",
      "target": "Open Season",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Mr. Peabody & Sherman",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "Chicken Little",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Spirited Away",
      "target": "Howl's Moving Castle",
      "value": 2
    },
    {
      "source": "Mr. Peabody & Sherman",
      "target": "Alvin and the Chipmunks: The Road Chip",
      "value": 2
    },
    {
      "source": "Mr. Peabody & Sherman",
      "target": "The Prince of Egypt",
      "value": 2
    }
  ]
}