{
  "nodes": [
    {
      "name": "Minions",
      "size": 1156730962,
      "keywords": [
        "assistant",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "evil mastermind",
        "minions",
        "3d"
      ],
      "user_rating": 6.4,
      "votes": 4571,
      "release_year": 2015,
      "overview": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
      "runtime": 91
    },
    {
      "name": "Toy Story 3",
      "size": 1066969703,
      "keywords": [
        "hostage",
        "college",
        "toy",
        "barbie",
        "animation",
        "escape",
        "day care",
        "teddy bear",
        "duringcreditsstinger",
        "toy comes to life",
        "personification",
        "inanimate objects coming to life",
        "toy story"
      ],
      "user_rating": 7.6,
      "votes": 4597,
      "release_year": 2010,
      "overview": "Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally left at a nefarious day care center. The toys must band together to escape and return home to Andy.",
      "runtime": 103
    },
    {
      "name": "Despicable Me 2",
      "size": 970761885,
      "keywords": [
        "secret agent",
        "bakery",
        "falling in love",
        "father daughter relationship",
        "duringcreditsstinger",
        "first date",
        "minions",
        "3d"
      ],
      "user_rating": 7,
      "votes": 4637,
      "release_year": 2013,
      "overview": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal.",
      "runtime": 98
    },
    {
      "name": "Shrek 2",
      "size": 919838758,
      "keywords": [
        "prison",
        "magic",
        "liberation",
        "honeymoon",
        "parents-in-law",
        "kingdom",
        "enchantment",
        "dancing scene",
        "transformation",
        "fairy-tale figure"
      ],
      "user_rating": 6.7,
      "votes": 2988,
      "release_year": 2004,
      "overview": "Shrek, Fiona and Donkey set off to Far, Far Away to meet Fiona's mother and father. But not everyone is happy. Shrek and the King find it hard to get along, and there's tension in the marriage. The fairy godmother discovers that Shrek has married Fiona instead of her Son Prince Charming and sets about destroying their marriage.",
      "runtime": 93
    },
    {
      "name": "Ice Age: Dawn of the Dinosaurs",
      "size": 886686817,
      "keywords": [
        "ice age",
        "bridge",
        "insanity",
        "jungle",
        "dinosaur",
        "birth",
        "duringcreditsstinger",
        "3d"
      ],
      "user_rating": 6.5,
      "votes": 2271,
      "release_year": 2009,
      "overview": "Times are changing for Manny the moody mammoth, Sid the motor mouthed sloth and Diego the crafty saber-toothed tiger. Life heats up for our heroes when they meet some new and none-too-friendly neighbors – the mighty dinosaurs.",
      "runtime": 94
    },
    {
      "name": "Ice Age: Continental Drift",
      "size": 877244782,
      "keywords": [
        "blue footed booby",
        "prehistoric times",
        "melting ice",
        "badger",
        "elephant seal",
        "floating ice",
        "land bridge",
        "era",
        "glaciale",
        "deriva"
      ],
      "user_rating": 6.2,
      "votes": 2672,
      "release_year": 2012,
      "overview": "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world.",
      "runtime": 88
    },
    {
      "name": "Inside Out",
      "size": 857611174,
      "keywords": [
        "dream",
        "cartoon",
        "imaginary friend",
        "animation",
        "family",
        "moving",
        "kids",
        "unicorn",
        "duringcreditsstinger",
        "3d",
        "emotions"
      ],
      "user_rating": 8,
      "votes": 6560,
      "release_year": 2015,
      "overview": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
      "runtime": 94
    },
    {
      "name": "Shrek the Third",
      "size": 798958165,
      "keywords": [
        "ambush",
        "sadness",
        "stage",
        "liberation of prisoners",
        "island",
        "traitor",
        "shipwreck",
        "prince",
        "ship",
        "donkey",
        "kingdom",
        "theatre play",
        "transformation",
        "conciliation",
        "tricks",
        "heir to the throne",
        "assault",
        "boarding school",
        "coup d'etat",
        "teacher",
        "best friend",
        "dragon",
        "cowardliness",
        "pregnancy",
        "capture",
        "duringcreditsstinger"
      ],
      "user_rating": 6,
      "votes": 2278,
      "release_year": 2007,
      "overview": "The King of Far Far Away has died and Shrek and Fiona are to become King &amp; Queen. However, Shrek wants to return to his cozy swamp and live in peace and quiet, so when he finds out there is another heir to the throne, they set off to bring him back to rule the kingdom.",
      "runtime": 93
    },
    {
      "name": "Deadpool",
      "size": 783112979,
      "keywords": [
        "anti hero",
        "mercenary",
        "marvel comic",
        "superhero",
        "based on comic book",
        "breaking the fourth wall",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "self healing"
      ],
      "user_rating": 7.4,
      "votes": 10995,
      "release_year": 2016,
      "overview": "Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
      "runtime": 108
    },
    {
      "name": "Shrek Forever After",
      "size": 752600867,
      "keywords": [
        "ogre",
        "3d"
      ],
      "user_rating": 6,
      "votes": 1959,
      "release_year": 2010,
      "overview": "A bored and domesticated Shrek pacts with deal-maker Rumpelstiltskin to get back to feeling like a real ogre again, but when he's duped and sent to a twisted version of Far Far Away—where Rumpelstiltskin is king, ogres are hunted, and he and Fiona have never met—he sets out to restore his world and reclaim his true love.",
      "runtime": 93
    },
    {
      "name": "Up",
      "size": 735099082,
      "keywords": [
        "age difference",
        "central and south america",
        "balloon",
        "animation",
        "floating in the air",
        "duringcreditsstinger",
        "exploring"
      ],
      "user_rating": 7.7,
      "votes": 6870,
      "release_year": 2009,
      "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "runtime": 96
    },
    {
      "name": "Forrest Gump",
      "size": 677945399,
      "keywords": [
        "vietnam veteran",
        "hippie",
        "mentally disabled",
        "running",
        "based on novel",
        "vietnam",
        "vietnam war",
        "friendship",
        "love",
        "family relationships",
        "bully",
        "mother son relationship",
        "military",
        "hugging",
        "shrimping",
        "wounded soldier",
        "flashback",
        "park bench",
        "amputee"
      ],
      "user_rating": 8.2,
      "votes": 7927,
      "release_year": 1994,
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
      "runtime": 142
    },
    {
      "name": "Ice Age: The Meltdown",
      "size": 660940780,
      "keywords": [
        "mammoth",
        "sloth",
        "ice age",
        "barrier ice",
        "ice melting",
        "iceberg",
        "flooding",
        "adventure",
        "lovers",
        "deluge",
        "saber-toothed tiger"
      ],
      "user_rating": 6.5,
      "votes": 2951,
      "release_year": 2006,
      "overview": "Diego, Manny and Sid return in this sequel to the hit animated movie Ice Age. This time around, the deep freeze is over, and the ice-covered earth is starting to melt, which will destroy the trio's cherished valley. The impending disaster prompts them to reunite and warn all the other beasts about the desperate situation.",
      "runtime": 91
    },
    {
      "name": "Big Hero 6",
      "size": 652105443,
      "keywords": [
        "brother brother relationship",
        "hero",
        "talent",
        "revenge",
        "best friend",
        "another dimension",
        "robot",
        "boy genius",
        "hate",
        "aftercreditsstinger",
        "moral dilemma",
        "3d",
        "teen superheroes",
        "dead brother"
      ],
      "user_rating": 7.8,
      "votes": 6135,
      "release_year": 2014,
      "overview": "The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
      "runtime": 102
    },
    {
      "name": "Kung Fu Panda",
      "size": 631744560,
      "keywords": [
        "china",
        "martial arts",
        "kung fu",
        "mentor",
        "snake",
        "restaurant",
        "shop",
        "strong woman",
        "bravery",
        "tiger",
        "turtle",
        "panda",
        "sensei",
        "anthropomorphism",
        "fighting",
        "ancient china",
        "monkey",
        "master",
        "destiny",
        "evil",
        "aftercreditsstinger",
        "monkey warrior",
        "noodle"
      ],
      "user_rating": 6.9,
      "votes": 3145,
      "release_year": 2008,
      "overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
      "runtime": 90
    },
    {
      "name": "Men in Black 3",
      "size": 624026776,
      "keywords": [
        "time travel",
        "time machine",
        "alien",
        "fictional government agency",
        "seeing the future",
        "changing history"
      ],
      "user_rating": 6.2,
      "votes": 4160,
      "release_year": 2012,
      "overview": "Agents J (Will Smith) and K (Tommy Lee Jones) are back...in time. J has seen some inexplicable things in his 15 years with the Men in Black, but nothing, not even aliens, perplexes him as much as his wry, reticent partner. But when K's life and the fate of the planet are put at stake, Agent J will have to travel back in time to put things right. J discovers that there are secrets to the universe that K never told him - secrets that will reveal themselves as he teams up with the young Agent K (Josh Brolin) to save his partner, the agency, and the future of humankind.",
      "runtime": 106
    },
    {
      "name": "Ratatouille",
      "size": 623722818,
      "keywords": [
        "paris",
        "brother brother relationship",
        "expensive restaurant",
        "river",
        "cook",
        "mouse",
        "confidence",
        "roof",
        "window",
        "leaving one's family",
        "work",
        "restaurant critic",
        "kitchen",
        "spice",
        "court",
        "cookbook",
        "family",
        "chef",
        "rat"
      ],
      "user_rating": 7.5,
      "votes": 4369,
      "release_year": 2007,
      "overview": "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.",
      "runtime": 111
    },
    {
      "name": "Mamma Mia!",
      "size": 609841637,
      "keywords": [
        "single parent",
        "greece",
        "musical",
        "daughter",
        "single",
        "mother daughter relationship",
        "duringcreditsstinger",
        "woman director"
      ],
      "user_rating": 6.4,
      "votes": 1386,
      "release_year": 2008,
      "overview": "Set on an idyllic Greek island, the plot serves as a background for a wealth of ABBA hit songs. Donna, an independent, single mother who owns a small hotel on the island is about to let go of Sophie, the spirited young daughter she's raised alone. But Sophie has secretly invited three of her mother's ex-lovers in the hopes of finding her father.",
      "runtime": 108
    },
    {
      "name": "How to Train Your Dragon 2",
      "size": 609123048,
      "keywords": [
        "father son relationship",
        "wife husband relationship",
        "sacrifice",
        "viking",
        "sequel",
        "rescue",
        "dragon",
        "mother son relationship",
        "death of husband",
        "warrior",
        "3d"
      ],
      "user_rating": 7.6,
      "votes": 3106,
      "release_year": 2014,
      "overview": "The thrilling second chapter of the epic How To Train Your Dragon trilogy brings back the fantastical world of Hiccup and Toothless five years later. While Astrid, Snotlout and the rest of the gang are challenging each other to dragon races (the island's new favorite contact sport), the now inseparable pair journey through the skies, charting unmapped territories and exploring new worlds. When one of their adventures leads to the discovery of a secret ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace.",
      "runtime": 102
    },
    {
      "name": "Men in Black",
      "size": 589390539,
      "keywords": [
        "secret identity",
        "sun glasses",
        "undercover",
        "space marine",
        "illegal immigration",
        "deportation",
        "new identity",
        "giant cockroach",
        "cannon",
        "flying saucer",
        "stay permit",
        "alien",
        "fictional government agency"
      ],
      "user_rating": 6.9,
      "votes": 4412,
      "release_year": 1997,
      "overview": "Men in Black follows the exploits of agents Kay and Jay, members of a top-secret organization established to monitor and police alien activity on Earth. The two Men in Black find themselves in the middle of the deadly plot by an intergalactic terrorist who has arrived on Earth to assassinate two ambassadors from opposing galaxies. In order to prevent worlds from colliding, the MiB must track down the terrorist and prevent the destruction of Earth. It's just another typical day for the Men in Black.",
      "runtime": 98
    },
    {
      "name": "The Croods",
      "size": 585178928,
      "keywords": [
        "stone age",
        "daughter",
        "father",
        "prehistoric",
        "ancient world",
        "father daughter relationship",
        "family",
        "cavemen",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.8,
      "votes": 2399,
      "release_year": 2013,
      "overview": "The Croods is a prehistoric comedy adventure that follows the world's first family as they embark on a journey of a lifetime when the cave that has always shielded them from danger is destroyed. Traveling across a spectacular landscape, the Croods discover an incredible new world filled with fantastic creatures -- and their outlook is changed forever.",
      "runtime": 98
    },
    {
      "name": "Night at the Museum",
      "size": 574480841,
      "keywords": [
        "museum",
        "skeleton",
        "night shift",
        "chaos",
        "genghis khan",
        "maya civilization",
        "natural history",
        "theodore roosevelt",
        "dinosaur",
        "based on children's book",
        "magical object",
        "security guard",
        "duringcreditsstinger",
        "inanimate objects coming to life"
      ],
      "user_rating": 6.3,
      "votes": 2862,
      "release_year": 2006,
      "overview": "Chaos reigns at the natural history museum when night watchman Larry Daley accidentally stirs up an ancient curse, awakening Attila the Hun, an army of gladiators, a Tyrannosaurus rex and other exhibits. Larry tries desperately to keep the museum under control, but he's fighting a losing battle until President Teddy Roosevelt comes to the rescue.",
      "runtime": 108
    },
    {
      "name": "The Smurfs",
      "size": 563749323,
      "keywords": [
        "moon",
        "magic",
        "based on comic book",
        "animation",
        "good vs evil",
        "smurf",
        "blue",
        "vortex",
        "mischief",
        "cat and mouse",
        "duringcreditsstinger"
      ],
      "user_rating": 5.5,
      "votes": 1179,
      "release_year": 2011,
      "overview": "When the evil wizard Gargamel chases the tiny blue Smurfs out of their village, they tumble from their magical world and into ours -- in fact, smack dab in the middle of Central Park. Just three apples high and stuck in the Big Apple, the Smurfs must find a way to get back to their village before Gargamel tracks them down.",
      "runtime": 103
    },
    {
      "name": "Monsters, Inc.",
      "size": 562816256,
      "keywords": [
        "monster",
        "infant",
        "energy supply",
        "company",
        "rivalry",
        "hijinks",
        "best friend",
        "scream",
        "conveyor belt",
        "energy company",
        "friend"
      ],
      "user_rating": 7.5,
      "votes": 5996,
      "release_year": 2001,
      "overview": "James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business... even though they're more afraid of the children than they are of them. When a child accidentally enters their world, James and Mike suddenly find that kids are not to be afraid of and they uncover a conspiracy that could threaten all children across the world.",
      "runtime": 92
    },
    {
      "name": "Cars 2",
      "size": 559852396,
      "keywords": [
        "car race",
        "sequel",
        "comedy",
        "anthropomorphism",
        "best friend",
        "duringcreditsstinger"
      ],
      "user_rating": 5.8,
      "votes": 2033,
      "release_year": 2011,
      "overview": "Star race car Lightning McQueen and his pal Mater head overseas to compete in the World Grand Prix race. But the road to the championship becomes rocky as Mater gets caught up in an intriguing adventure of his own: international espionage.",
      "runtime": 106
    },
    {
      "name": "Ted",
      "size": 549368315,
      "keywords": [
        "friendship",
        "love",
        "teddy bear",
        "toy comes to life",
        "wishes come true"
      ],
      "user_rating": 6.3,
      "votes": 4697,
      "release_year": 2012,
      "overview": "John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear or his girlfriend, Lori.",
      "runtime": 106
    },
    {
      "name": "Brave",
      "size": 538983207,
      "keywords": [
        "scotland",
        "rebel",
        "bravery",
        "kingdom",
        "archer",
        "wish",
        "bear",
        "scot",
        "rebellious daughter",
        "turns into animal",
        "archery",
        "ruins",
        "aftercreditsstinger",
        "peace offering",
        "woman director",
        "courage",
        "3d"
      ],
      "user_rating": 6.7,
      "votes": 4641,
      "release_year": 2012,
      "overview": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
      "runtime": 93
    },
    {
      "name": "The Simpsons Movie",
      "size": 527068851,
      "keywords": [
        "father son relationship",
        "lake",
        "springfield",
        "the simpsons",
        "duff beer",
        "garbage",
        "pig",
        "pollution",
        "environmental protection agency",
        "quarantine",
        "alcoholism",
        "love",
        "alaska",
        "dysfunctional family",
        "dysfunctional marriage",
        "ecology",
        "saving lives",
        "first love",
        "duringcreditsstinger",
        "donuts"
      ],
      "user_rating": 6.9,
      "votes": 2264,
      "release_year": 2007,
      "overview": "After Homer accidentally pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
      "runtime": 87
    },
    {
      "name": "Kung Fu Panda 3",
      "size": 521170825,
      "keywords": [
        "china",
        "martial arts",
        "kung fu",
        "village",
        "panda",
        "sequel",
        "talking animal",
        "anthropomorphism",
        "dragon",
        "ancient china",
        "wuxia",
        "woman director"
      ],
      "user_rating": 6.7,
      "votes": 1603,
      "release_year": 2016,
      "overview": "Continuing his \"legendary adventures of awesomeness\", Po must face two hugely epic, but different threats: one supernatural and the other a little closer to his home.",
      "runtime": 95
    },
    {
      "name": "Meet the Fockers",
      "size": 516642939,
      "keywords": [
        "cia",
        "parents kids relationship",
        "florida",
        "anti-authoritarian upbringing",
        "jew",
        "parents-in-law",
        "orderly",
        "just married",
        "sex therapy",
        "bad father-in-law",
        "family",
        "illegitimate son"
      ],
      "user_rating": 6.1,
      "votes": 1373,
      "release_year": 2004,
      "overview": "Hard-to-crack ex-CIA man, Jack Byrnes and his wife, Dina head for the warmer climes of Florida to meet son-in-law-to-be, Greg Focker's parents. Unlike their happily matched offspring, the future in-laws find themselves in a situation of opposites that definitely do not attract.",
      "runtime": 115
    },
    {
      "name": "Aladdin",
      "size": 504050219,
      "keywords": [
        "magic",
        "musical",
        "cartoon",
        "princess",
        "love",
        "comedy",
        "animation",
        "monkey",
        "arab",
        "aftercreditsstinger",
        "genie",
        "animal sidekick"
      ],
      "user_rating": 7.4,
      "votes": 3416,
      "release_year": 1992,
      "overview": "Princess Jasmine grows tired of being forced to remain in the palace and she sneaks out into the marketplace  in disguise where she meets street-urchin Aladdin and the two fall in love, although she may only marry a prince. After being thrown in jail, Aladdin and becomes embroiled in a plot to find a mysterious lamp with which the evil Jafar hopes to rule the land.",
      "runtime": 90
    },
    {
      "name": "Rio 2",
      "size": 500188435,
      "keywords": [
        "bird",
        "sequel",
        "jungle",
        "audition",
        "amazon rainforest",
        "parrots"
      ],
      "user_rating": 6.3,
      "votes": 978,
      "release_year": 2014,
      "overview": "It's a jungle out there for Blu, Jewel and their three kids after they're hurtled from Rio de Janeiro to the wilds of the Amazon. As Blu tries to fit in, he goes beak-to-beak with the vengeful Nigel, and meets the most fearsome adversary of all: his father-in-law.",
      "runtime": 102
    },
    {
      "name": "Toy Story 2",
      "size": 497366869,
      "keywords": [
        "museum",
        "prosecution",
        "identity crisis",
        "airplane",
        "flea market",
        "collector",
        "teamwork",
        "friendship",
        "rescue team",
        "garage sale",
        "duringcreditsstinger",
        "toy comes to life",
        "personification",
        "inanimate objects coming to life"
      ],
      "user_rating": 7.3,
      "votes": 3806,
      "release_year": 1999,
      "overview": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
      "runtime": 92
    },
    {
      "name": "Rio",
      "size": 484635760,
      "keywords": [
        "brazil",
        "pet",
        "bird",
        "musical",
        "canary",
        "samba",
        "animal",
        "duringcreditsstinger",
        "rio 1",
        "río 1"
      ],
      "user_rating": 6.5,
      "votes": 2166,
      "release_year": 2011,
      "overview": "Captured by smugglers when he was just a hatchling, a macaw named Blu never learned to fly and lives a happily domesticated life in Minnesota with his human friend, Linda. Blu is thought to be the last of his kind, but when word comes that Jewel, a lone female, lives in Rio de Janeiro, Blu and Linda go to meet her. Animal smugglers kidnap Blu and Jewel, but the pair soon escape and begin a perilous adventure back to freedom -- and Linda.",
      "runtime": 96
    },
    {
      "name": "Bruce Almighty",
      "size": 484572835,
      "keywords": [
        "christianity",
        "moon",
        "responsability",
        "moses",
        "street gang",
        "lovesickness",
        "journalism",
        "new love",
        "faith",
        "prayer",
        "god",
        "car crash"
      ],
      "user_rating": 6.4,
      "votes": 3012,
      "release_year": 2003,
      "overview": "Bruce Nolan toils as a \"human interest\" television reporter in Buffalo, N.Y. Despite his high ratings and the love of his beautiful girlfriend, Grace, Bruce remains unfulfilled. At the end of the worst day in his life, he angrily ridicules God -- and the Almighty responds, endowing Bruce with all of His divine powers.",
      "runtime": 101
    },
    {
      "name": "Shrek",
      "size": 484409218,
      "keywords": [
        "magic",
        "liberation",
        "lordship",
        "castle",
        "robin hood",
        "enchantment",
        "fairy-tale figure",
        "princess",
        "parody",
        "woman director",
        "ogre"
      ],
      "user_rating": 7.3,
      "votes": 4056,
      "release_year": 2001,
      "overview": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
      "runtime": 90
    },
    {
      "name": "Mr. & Mrs. Smith",
      "size": 478207520,
      "keywords": [
        "bomb",
        "assassin",
        "secret identity",
        "secret",
        "assault rifle",
        "gun",
        "married couple",
        "hitman",
        "decoy",
        "marriage crisis",
        "marriage",
        "job",
        "dysfunctional marriage",
        "gunfight",
        "bullet wound"
      ],
      "user_rating": 6.5,
      "votes": 2965,
      "release_year": 2005,
      "overview": "After five (or six) years of vanilla-wedded bliss, ordinary suburbanites John and Jane Smith are stuck in a huge rut. Unbeknownst to each other, they are both coolly lethal, highly-paid assassins working for rival organisations. When they discover they're each other's next target, their secret lives collide in a spicy, explosive mix of wicked comedy, pent-up passion, nonstop action and high-tech weaponry.",
      "runtime": 120
    },
    {
      "name": "Teenage Mutant Ninja Turtles",
      "size": 477200000,
      "keywords": [
        "martial arts",
        "terrorist",
        "hero",
        "mutation",
        "van",
        "turtle",
        "vigilante",
        "superhero",
        "based on comic book",
        "ninja",
        "new york city",
        "sewer",
        "reboot",
        "science experiment",
        "3d"
      ],
      "user_rating": 5.8,
      "votes": 2636,
      "release_year": 2014,
      "overview": "The city needs heroes. Darkness has settled over New York City as Shredder and his evil Foot Clan have an iron grip on everything from the police to the politicians. The future is grim until four unlikely outcast brothers rise from the sewers and discover their destiny as Teenage Mutant Ninja Turtles. The Turtles must work with fearless reporter April and her wise-cracking cameraman Vern Fenwick to save the city and unravel Shredder's diabolical plan.",
      "runtime": 101
    },
    {
      "name": "Home Alone",
      "size": 476684675,
      "keywords": [
        "holiday",
        "burglar",
        "home invasion",
        "mischief",
        "booby trap",
        "home alone",
        "suburban chicago",
        "mischievous child",
        "christmas",
        "child"
      ],
      "user_rating": 7.1,
      "votes": 2414,
      "release_year": 1990,
      "overview": "Eight-year-old Kevin McCallister makes the most of the situation after his family unwittingly leaves him behind when they go on Christmas vacation. But when a pair of bungling burglars set their sights on Kevin's house, the plucky kid stands ready to defend his territory. By planting booby traps galore, adorably mischievous Kevin stands his ground as his frantic mother attempts to race home before.",
      "runtime": 103
    },
    {
      "name": "Charlie and the Chocolate Factory",
      "size": 474968763,
      "keywords": [
        "london england",
        "father son relationship",
        "chocolate",
        "factory worker",
        "based on novel",
        "parents kids relationship",
        "candy",
        "overweight child",
        "grandfather grandson relationship",
        "teacher"
      ],
      "user_rating": 6.7,
      "votes": 3624,
      "release_year": 2005,
      "overview": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
      "runtime": 115
    },
    {
      "name": "Hotel Transylvania 2",
      "size": 473226958,
      "keywords": [
        "transylvania",
        "hotel",
        "witch",
        "technology",
        "magic",
        "mummy",
        "dracula",
        "skeleton",
        "only child",
        "backpacker",
        "marriage",
        "frankenstein",
        "wolfman",
        "zombie",
        "moving out",
        "invisible man",
        "new life"
      ],
      "user_rating": 6.7,
      "votes": 1497,
      "release_year": 2015,
      "overview": "When the old-old-old-fashioned vampire Vlad arrives at the hotel for an impromptu family get-together, Hotel Transylvania is in for a collision of supernatural old-school and modern day cool.",
      "runtime": 89
    },
    {
      "name": "Wreck-It Ralph",
      "size": 471222889,
      "keywords": [
        "support group",
        "product placement",
        "bullying",
        "racing",
        "arcade",
        "medal",
        "self esteem",
        "curiosity",
        "precocious child",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "first person shooter",
        "glitch",
        "carefree",
        "video gamer",
        "q*bert",
        "interrupted wedding",
        "social reject"
      ],
      "user_rating": 7.1,
      "votes": 4570,
      "release_year": 2012,
      "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
      "runtime": 108
    },
    {
      "name": "The Lego Movie",
      "size": 469160692,
      "keywords": [
        "father son relationship",
        "creativity",
        "friendship",
        "part live action",
        "toys",
        "based on toy",
        "falling in love",
        "super powers",
        "duringcreditsstinger",
        "different worlds",
        "lego",
        "batman"
      ],
      "user_rating": 7.5,
      "votes": 3070,
      "release_year": 2014,
      "overview": "An ordinary Lego mini-figure, mistakenly thought to be the extraordinary MasterBuilder, is recruited to join a quest to stop an evil Lego tyrant from gluing the universe together.",
      "runtime": 100
    },
    {
      "name": "Pretty Woman",
      "size": 463000000,
      "keywords": [
        "prostitute",
        "capitalism",
        "cinderella",
        "expensive restaurant",
        "sports car",
        "workaholic",
        "fire escape",
        "friendship",
        "los angeles",
        "piano"
      ],
      "user_rating": 7,
      "votes": 1746,
      "release_year": 1990,
      "overview": "When millionaire wheeler-dealer Edward Lewis enters a business contract with Hollywood hooker Vivian Ward, he loses his heart in the bargain in this charming romantic comedy. After Edward hires Vivian as his date for a week and gives her a Cinderella makeover, she returns the favor by mellowing the hardnosed tycoon's outlook. Can the poor prostitute and the rich capitalist live happily ever after?",
      "runtime": 119
    },
    {
      "name": "Cars",
      "size": 461983149,
      "keywords": [
        "car race",
        "car journey",
        "village and town",
        "auto",
        "route 66",
        "wrecker",
        "porsche",
        "retirement",
        "media",
        "friendship",
        "sport",
        "anthropomorphism",
        "los angeles",
        "road movie",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.6,
      "votes": 3877,
      "release_year": 2006,
      "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
      "runtime": 117
    },
    {
      "name": "The Hangover",
      "size": 459270619,
      "keywords": [
        "underwear",
        "tiger",
        "stag night",
        "hangover",
        "lost weekend",
        "bag over head",
        "chapel",
        "hit with tire iron",
        "memory loss",
        "las vegas",
        "duringcreditsstinger",
        "elevator"
      ],
      "user_rating": 7.2,
      "votes": 6173,
      "release_year": 2009,
      "overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
      "runtime": 100
    },
    {
      "name": "Alvin and the Chipmunks: The Squeakquel",
      "size": 443140005,
      "keywords": [
        "chipmunk",
        "cgi",
        "based on tv series",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "woman director"
      ],
      "user_rating": 5.4,
      "votes": 666,
      "release_year": 2009,
      "overview": "Pop sensations Alvin, Simon and Theodore end up in the care of Dave Seville's twenty-something nephew Toby. The boys must put aside music super stardom to return to school, and are tasked with saving the school's music program by winning the $25,000 prize in a battle of the bands. But the Chipmunks unexpectedly meet their match in three singing chipmunks known as The Chipettes - Brittany, Eleanor and Jeanette. Romantic and musical sparks are ignited when the Chipmunks and Chipettes square off.",
      "runtime": 88
    },
    {
      "name": "Men in Black II",
      "size": 441818803,
      "keywords": [
        "saving the world",
        "secret identity",
        "sun glasses",
        "undercover",
        "space marine",
        "illegal immigration",
        "deportation",
        "new identity",
        "flying saucer",
        "light",
        "firearm",
        "alien",
        "fictional government agency"
      ],
      "user_rating": 6,
      "votes": 3114,
      "release_year": 2002,
      "overview": "Kay and Jay reunite to provide our best, last and only line of defense against a sinister seductress who levels the toughest challenge yet to the MIB's untarnished mission statement – protecting Earth from the scum of the universe. It's been four years since the alien-seeking agents averted an intergalactic disaster of epic proportions. Now it's a race against the clock as Jay must convince Kay – who not only has absolutely no memory of his time spent with the MIB, but is also the only living person left with the expertise to save the galaxy – to reunite with the MIB before the earth submits to ultimate destruction.",
      "runtime": 88
    },
    {
      "name": "Mrs. Doubtfire",
      "size": 441286195,
      "keywords": [
        "san francisco",
        "parents kids relationship",
        "restaurant",
        "nanny",
        "mask",
        "custody battle",
        "fake identity"
      ],
      "user_rating": 7,
      "votes": 1591,
      "release_year": 1993,
      "overview": "Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as an English nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.",
      "runtime": 125
    },
    {
      "name": "Night at the Museum: Battle of the Smithsonian",
      "size": 413106170,
      "keywords": [
        "museum",
        "theodore roosevelt",
        "duringcreditsstinger",
        "amelia earhart",
        "smithsonian"
      ],
      "user_rating": 5.9,
      "votes": 1971,
      "release_year": 2009,
      "overview": "Hapless museum night watchman Larry Daley must help his living, breathing exhibit friends out of a pickle now that they've been transferred to the archives at the Smithsonian Institution. Larry's (mis)adventures this time include close encounters with Amelia Earhart, Abe Lincoln and Ivan the Terrible.",
      "runtime": 105
    },
    {
      "name": "The Wolf of Wall Street",
      "size": 392000694,
      "keywords": [
        "corruption",
        "sex",
        "sexuality",
        "bank",
        "humor",
        "biography",
        "wall street",
        "marriage crisis",
        "rise and fall",
        "stockbroker",
        "drug",
        "stock broker"
      ],
      "user_rating": 7.9,
      "votes": 6571,
      "release_year": 2013,
      "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
      "runtime": 180
    },
    {
      "name": "Happy Feet",
      "size": 384335608,
      "keywords": [
        "ocean",
        "fish",
        "zoo",
        "penguin",
        "tap dancing",
        "love",
        "crush",
        "snow",
        "anthropomorphism",
        "singing",
        "antarctica",
        "family",
        "duringcreditsstinger"
      ],
      "user_rating": 5.9,
      "votes": 1410,
      "release_year": 2006,
      "overview": "Into the world of the Emperor Penguins, who find their soul mates through song, a penguin is born who cannot sing. But he can tap dance something fierce!",
      "runtime": 108
    },
    {
      "name": "Ice Age",
      "size": 383257136,
      "keywords": [
        "human evolution",
        "parents kids relationship",
        "squirrel",
        "ice",
        "loss of child",
        "mammoth",
        "sloth",
        "dying and death",
        "stone age",
        "prehistoric",
        "saber-toothed tiger",
        "cavemen",
        "prehistoric creature",
        "prehistoric adventure",
        "prehistoric times",
        "prehistoric man"
      ],
      "user_rating": 7.1,
      "votes": 3857,
      "release_year": 2002,
      "overview": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
      "runtime": 81
    },
    {
      "name": "Back to the Future",
      "size": 381109762,
      "keywords": [
        "clock tower",
        "car race",
        "terrorist",
        "delorean",
        "lightning",
        "guitar",
        "plutonium",
        "sports car",
        "inventor",
        "journey in the past",
        "time travel",
        "race against time",
        "partner",
        "misfit",
        "mad scientist",
        "fish out of water",
        "teenage love",
        "destiny",
        "hidden identity",
        "odd couple",
        "escapade",
        "disorder",
        "chases and races",
        "love and romance",
        "teenage life",
        "misfit partners",
        "changing the past or future",
        "getting home",
        "inventions and discoveries"
      ],
      "user_rating": 8,
      "votes": 6079,
      "release_year": 1985,
      "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
      "runtime": 116
    },
    {
      "name": "What Women Want",
      "size": 374111707,
      "keywords": [
        "women",
        "telepathy",
        "supernatural powers",
        "advertising executive",
        "woman director"
      ],
      "user_rating": 6.1,
      "votes": 992,
      "release_year": 2000,
      "overview": "Advertising executive Nick Marshall is as cocky as they come, but what happens to a chauvinistic guy when he can suddenly hear what women are thinking? Nick gets passed over for a promotion, but after an accident enables him to hear women's thoughts, he puts his newfound talent to work against Darcy, his new boss, who seems to be infatuated with him.",
      "runtime": 127
    },
    {
      "name": "Toy Story",
      "size": 373554033,
      "keywords": [
        "jealousy",
        "toy",
        "boy",
        "friendship",
        "friends",
        "rivalry",
        "boy next door",
        "new toy",
        "toy comes to life"
      ],
      "user_rating": 7.7,
      "votes": 5269,
      "release_year": 1995,
      "overview": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
      "runtime": 81
    },
    {
      "name": "Penguins of Madagascar",
      "size": 373552094,
      "keywords": [
        "penguin",
        "madagascar",
        "3d"
      ],
      "user_rating": 6.5,
      "votes": 1346,
      "release_year": 2014,
      "overview": "Skipper, Kowalski, Rico and Private join forces with undercover organization The North Wind to stop the villainous Dr. Octavius Brine from destroying the world as we know it.",
      "runtime": 92
    },
    {
      "name": "There's Something About Mary",
      "size": 369884651,
      "keywords": [
        "surgeon",
        "stalker",
        "romantic comedy",
        "dream girl",
        "taboo",
        "screwball comedy",
        "frisbee",
        "troubadour",
        "gross out comedy",
        "intellectual disability"
      ],
      "user_rating": 6.5,
      "votes": 1590,
      "release_year": 1998,
      "overview": "Having never fully recovered from a prom date that became a total disaster, a man finally gets a chance to reunite with his old prom date, only to run up against other suitors including the sleazy detective he hired to find her.",
      "runtime": 119
    },
    {
      "name": "Home",
      "size": 368871007,
      "keywords": [
        "friendship",
        "spaceship",
        "space",
        "alien",
        "alien invasion",
        "alien friendship",
        "awful leader",
        "taking resposibility"
      ],
      "user_rating": 6.8,
      "votes": 1519,
      "release_year": 2015,
      "overview": "When Earth is taken over by the overly-confident Boov, an alien race in search of a new place to call home, all humans are promptly relocated, while all Boov get busy reorganizing the planet. But when one resourceful girl, Tip, manages to avoid capture, she finds herself the accidental accomplice of a banished Boov named Oh. The two fugitives realize there’s a lot more at stake than intergalactic relations as they embark on the road trip of a lifetime.",
      "runtime": 94
    },
    {
      "name": "My Big Fat Greek Wedding",
      "size": 368744044,
      "keywords": [
        "usa",
        "parents kids relationship",
        "greece",
        "culture clash",
        "midlife crisis",
        "restaurant",
        "bad mother-in-law",
        "mother-in-law",
        "parents-in-law",
        "son-in-law",
        "father-in-law",
        "patriarch",
        "bad father-in-law",
        "greek",
        "wedding",
        "family",
        "xenophobia"
      ],
      "user_rating": 6.2,
      "votes": 671,
      "release_year": 2002,
      "overview": "A young Greek woman falls in love with a non-Greek and struggles to get her family to accept him while she comes to terms with her heritage and cultural identity.",
      "runtime": 95
    },
    {
      "name": "Hitch",
      "size": 368100420,
      "keywords": [
        "speed date",
        "romantic comedy",
        "dating"
      ],
      "user_rating": 6.4,
      "votes": 1665,
      "release_year": 2005,
      "overview": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships.",
      "runtime": 118
    },
    {
      "name": "Shark Tale",
      "size": 367275019,
      "keywords": [
        "fish",
        "hero",
        "mission of murder",
        "threat to death",
        "secret love",
        "animation",
        "shark",
        "woman director"
      ],
      "user_rating": 5.8,
      "votes": 1557,
      "release_year": 2004,
      "overview": "Oscar is a small fish whose big aspirations often get him into trouble. Meanwhile, Lenny is a great white shark with a surprising secret that no sea creature would guess: He's a vegetarian. When a lie turns Oscar into an improbable hero and Lenny becomes an outcast, the two form an unlikely friendship.",
      "runtime": 90
    },
    {
      "name": "Notting Hill",
      "size": 363889678,
      "keywords": [
        "london england",
        "bookshop",
        "birthday",
        "new love",
        "film maker",
        "paparazzi",
        "press conference",
        "wheelchair",
        "bath tub",
        "cohabitant",
        "friendship",
        "fame",
        "celebration",
        "movie star",
        "spectacle"
      ],
      "user_rating": 7,
      "votes": 1262,
      "release_year": 1999,
      "overview": "The British comedy from director Roger Michell tells the love story between a famous actress and a simple book seller from London. A look into the attempt for famous people to have a personal and private life and the ramifications that follow. Nominated for three Golden Globes in 2000.",
      "runtime": 124
    },
    {
      "name": "A Bug's Life",
      "size": 363258859,
      "keywords": [
        "winter",
        "fight",
        "ant",
        "invention",
        "collector",
        "ant-hill",
        "kids and family",
        "grass",
        "duringcreditsstinger"
      ],
      "user_rating": 6.8,
      "votes": 2303,
      "release_year": 1998,
      "overview": "On behalf of \"oppressed bugs everywhere,\" an inventive ant named Flik hires a troupe of warrior bugs to defend his bustling colony from a horde of freeloading grasshoppers led by the evil-minded Hopper.",
      "runtime": 95
    },
    {
      "name": "Alvin and the Chipmunks",
      "size": 361366633,
      "keywords": [
        "pop",
        "pop star",
        "record producer",
        "surprise",
        "approach",
        "forest",
        "music",
        "concert",
        "friendship",
        "performance",
        "chipmunk",
        "talking animal",
        "songwriter",
        "talking to animals",
        "duringcreditsstinger"
      ],
      "user_rating": 5.5,
      "votes": 1177,
      "release_year": 2007,
      "overview": "A struggling songwriter named Dave Seville finds success when he comes across a trio of singing chipmunks: mischievous leader Alvin, brainy Simon, and chubby, impressionable Theodore.",
      "runtime": 92
    },
    {
      "name": "Home Alone 2: Lost in New York",
      "size": 358991681,
      "keywords": [
        "holiday",
        "new york",
        "new york city",
        "christmas"
      ],
      "user_rating": 6.3,
      "votes": 2395,
      "release_year": 1992,
      "overview": "Instead of flying to Florida with his folks, Kevin ends up alone in New York, where he gets a hotel room with his dad's credit card—despite problems from a clerk and meddling bellboy. But when Kevin runs into his old nemeses, the Wet Bandits, he's determined to foil their plans to rob a toy store on Christmas eve.",
      "runtime": 120
    },
    {
      "name": "Hotel Transylvania",
      "size": 358375603,
      "keywords": [
        "witch",
        "magic",
        "mummy",
        "vampire",
        "dracula",
        "skeleton",
        "backpacker",
        "frankenstein",
        "wolfman",
        "zombie",
        "invisible man",
        "duringcreditsstinger",
        " nosferatu",
        "protective father",
        "fang vamp"
      ],
      "user_rating": 6.8,
      "votes": 2566,
      "release_year": 2012,
      "overview": "Dracula, who operates a high-end resort away from the human world, goes into overprotective mode when a boy discovers the resort and falls for the count's teen-aged daughter.",
      "runtime": 91
    },
    {
      "name": "The Mask",
      "size": 351583407,
      "keywords": [
        "dual identity",
        "bank",
        "mockery",
        "green",
        "balloon",
        "jail cell",
        "norse mythology"
      ],
      "user_rating": 6.6,
      "votes": 2472,
      "release_year": 1994,
      "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
      "runtime": 101
    },
    {
      "name": "Night at the Museum: Secret of the Tomb",
      "size": 349424282,
      "keywords": [
        "night watchman",
        "museum",
        "natural history",
        "history",
        "smithsonian"
      ],
      "user_rating": 6.1,
      "votes": 1851,
      "release_year": 2014,
      "overview": "When the magic powers of The Tablet of Ahkmenrah begin to die out, Larry Daley (Ben Stiller) spans the globe, uniting favorite and new characters while embarking on an epic quest to save the magic before it is gone forever.",
      "runtime": 97
    },
    {
      "name": "The Smurfs 2",
      "size": 347434178,
      "keywords": [
        "based on cartoon",
        "animation",
        "smurf"
      ],
      "user_rating": 5.5,
      "votes": 695,
      "release_year": 2013,
      "overview": "The evil wizard Gargamel creates a couple of mischievous Smurf-like creatures called the Naughties that he hopes will let him harness the all-powerful, magical Smurf-essence. But when he discovers that only a real Smurf can give him what he wants, and only a secret spell that Smurfette knows can turn the Naughties into real Smurfs, Gargamel kidnaps Smurfette and brings her to Paris, where he has been winning the adoration of millions as the world¹s greatest sorcerer. It's up to Papa, Clumsy, Grouchy, and Vanity to return to our world, reunite with their human friends Patrick and Grace Winslow, and rescue her! Will Smurfette, who has always felt different from the other Smurfs, find a new connection with the Naughties Vexy and Hackus or will the Smurfs convince her that their love for her is True Blue?",
      "runtime": 105
    },
    {
      "name": "Rush Hour 2",
      "size": 347325802,
      "keywords": [
        "duringcreditsstinger"
      ],
      "user_rating": 6.4,
      "votes": 1054,
      "release_year": 2001,
      "overview": "It's vacation time for Carter as he finds himself alongside Lee in Hong Kong wishing for more excitement. While Carter wants to party and meet the ladies, Lee is out to track down a Triad gang lord who may be responsible for killing two men at the American Embassy. Things get complicated as the pair stumble onto a counterfeiting plot. The boys are soon up to their necks in fist fights and life-threatening situations. A trip back to the U.S. may provide the answers about the bombing, the counterfeiting, and the true allegiance of sexy customs agent Isabella.",
      "runtime": 90
    },
    {
      "name": "How the Grinch Stole Christmas",
      "size": 345141403,
      "keywords": [
        "holiday",
        "christmas party",
        "new love",
        "santa claus",
        "village",
        "kids and family"
      ],
      "user_rating": 6.2,
      "votes": 1386,
      "release_year": 2000,
      "overview": "Inside a snowflake exists the magical land of Whoville. In Whoville, live the Whos, an almost mutated sort of Munchkin-like people. All the Whos love Christmas, yet just outside of their beloved Whoville lives the Grinch. The Grinch is a nasty creature that hates Christmas, and plots to steal it away from the Whos, whom he equally abhors. Yet a small child, Cindy Lou Who, decides to try befriending the Grinch.",
      "runtime": 104
    },
    {
      "name": "Over the Hedge",
      "size": 343397247,
      "keywords": [
        "squirrel",
        "eating and drinking",
        "vororte",
        "garden",
        "grizzly bear",
        "entrapment",
        "suburbian idyll",
        "garbage",
        "forest",
        "turtle",
        "hiding in a garbage container",
        "skunk",
        "racoon",
        "animal"
      ],
      "user_rating": 6.3,
      "votes": 1074,
      "release_year": 2006,
      "overview": "A scheming raccoon fools a mismatched family of forest creatures into helping him repay a debt of food, by invading the new suburban sprawl that popped up while they were hibernating – and learns a lesson about family himself.",
      "runtime": 83
    },
    {
      "name": "Alvin and the Chipmunks: Chipwrecked",
      "size": 342695435,
      "keywords": [
        "sequel",
        "chipmunk",
        "cruise ship",
        "overboard"
      ],
      "user_rating": 5.4,
      "votes": 484,
      "release_year": 2011,
      "overview": "Playing around while aboard a cruise ship, the Chipmunks and Chipettes accidentally go overboard and end up marooned in a tropical paradise. They discover their new turf is not as deserted as it seems.",
      "runtime": 87
    },
    {
      "name": "The Flintstones",
      "size": 341631208,
      "keywords": [
        "manager",
        "jealousy",
        "bad mother-in-law",
        "adoption",
        "family's daily life",
        "stone age",
        "plan",
        "friendship",
        "best friend",
        "dinosaur"
      ],
      "user_rating": 5,
      "votes": 543,
      "release_year": 1994,
      "overview": "Modern Stone Age family the Flintstones hit the big screen in this live-action version of the classic cartoon. Fred helps Barney adopt a child. Barney sees an opportunity to repay him when Slate Mining tests its employees to find a new executive. But no good deed goes unpunished.",
      "runtime": 91
    },
    {
      "name": "Enchanted",
      "size": 340487652,
      "keywords": [
        "poison",
        "queen",
        "fairy tale",
        "musical",
        "princess",
        "portal",
        "animation",
        "fantasy world",
        "evil witch",
        "part animation"
      ],
      "user_rating": 6.6,
      "votes": 1449,
      "release_year": 2007,
      "overview": "The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a \"happily ever after\" basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?",
      "runtime": 107
    },
    {
      "name": "Now You See Me 2",
      "size": 334901337,
      "keywords": [
        "london england",
        "china",
        "magic",
        "secret society",
        "vigilante",
        "sequel",
        "revenge",
        "heist",
        "on the run",
        "macau china",
        "magician"
      ],
      "user_rating": 6.7,
      "votes": 3235,
      "release_year": 2016,
      "overview": "One year after outwitting the FBI and winning the public’s adulation with their mind-bending spectacles, the Four Horsemen resurface only to find themselves face to face with a new enemy who enlists them to pull off their most dangerous heist yet.",
      "runtime": 129
    },
    {
      "name": "Back to the Future Part II",
      "size": 332000000,
      "keywords": [
        "skateboarding",
        "flying car",
        "car race",
        "delorean",
        "lightning",
        "almanac",
        "inventor",
        "time travel",
        "sequel",
        "diner",
        "alternate history",
        "teenager",
        "electric guitar",
        "walking cane",
        "high school dance",
        "hoverboard",
        "video phone"
      ],
      "user_rating": 7.4,
      "votes": 3829,
      "release_year": 1989,
      "overview": "Marty and Doc are at it again in this wacky sequel to the 1985 blockbuster as the time-traveling duo head to 2015 to nip some McFly family woes in the bud. But things go awry thanks to bully Biff Tannen and a pesky sports almanac. In a last-ditch attempt to set things straight, Marty finds himself bound for 1955 and face to face with his teenage parents -- again.",
      "runtime": 108
    },
    {
      "name": "Meet the Parents",
      "size": 330444045,
      "keywords": [
        "cia",
        "airport",
        "cat",
        "jew",
        "orderly",
        "airplane",
        "father-in-law",
        "epistaxis",
        "daughter",
        "lost baggage",
        "urn",
        "pavilion",
        "volleyball",
        "hospital",
        "wedding"
      ],
      "user_rating": 6.6,
      "votes": 1698,
      "release_year": 2000,
      "overview": "Greg Focker is ready to marry his girlfriend, Pam, but before he pops the question, he must win over her formidable father, humorless former CIA agent Jack Byrnes, at the wedding of Pam's sister. As Greg bends over backward to make a good impression, his visit to the Byrnes home turns into a hilarious series of disasters, and everything that can go wrong does, all under Jack's critical, hawklike gaze.",
      "runtime": 108
    },
    {
      "name": "Crocodile Dundee",
      "size": 328203506,
      "keywords": [
        "new york",
        "prostitute",
        "hotel",
        "journalist",
        "culture clash",
        "subway",
        "crocodile",
        "wilderness",
        "knife",
        "tourist",
        "limousine",
        "poacher",
        "city",
        "australian outback",
        "kangaroo"
      ],
      "user_rating": 6.3,
      "votes": 503,
      "release_year": 1986,
      "overview": "When a New York reporter plucks crocodile hunter Dundee from the Australian Outback for a visit to the Big Apple, it's a clash of cultures and a recipe for good-natured comedy as naïve Dundee negotiates the concrete jungle. Dundee proves that his instincts are quite useful in the city and adeptly handles everything from wily muggers to high-society snoots without breaking a sweat.",
      "runtime": 97
    },
    {
      "name": "The Devil Wears Prada",
      "size": 326551094,
      "keywords": [
        "paris",
        "journalist",
        "journalism",
        "world of fasion",
        "fashion journal",
        "assistant",
        "job entrant",
        "job interview",
        "editor-in-chief"
      ],
      "user_rating": 7,
      "votes": 3088,
      "release_year": 2006,
      "overview": "The Devil Wears Prada is about a young journalist who moves to New York to work in the fashion industry. Her boss however is extremely demanding and cruel and won’t let her succeed if she doesn’t fit into the high class elegant look of their magazine when all she really wants to be a good journalist.",
      "runtime": 109
    },
    {
      "name": "Megamind",
      "size": 321887208,
      "keywords": [
        "saving the world",
        "date",
        "prison",
        "secret identity",
        "fish",
        "gun",
        "dna",
        "mayor",
        "anti hero",
        "rain",
        "museum",
        "one-sided love",
        "serum",
        "talking animal",
        "reporter",
        "duringcreditsstinger",
        "stronger villain"
      ],
      "user_rating": 6.7,
      "votes": 1918,
      "release_year": 2010,
      "overview": "Bumbling supervillain Megamind finally defeats his nemesis, the superhero Metro Man. But without a hero, he loses all purpose and must find new meaning to his life.",
      "runtime": 95
    },
    {
      "name": "Lethal Weapon 3",
      "size": 321731527,
      "keywords": [
        "rookie cop",
        "dog biscuit",
        "shooting practice",
        "sitting on a toilet",
        "judo throw",
        "police psychologist",
        "buddy cop",
        "firing range",
        "aftercreditsstinger"
      ],
      "user_rating": 6.4,
      "votes": 811,
      "release_year": 1992,
      "overview": "Archetypal buddy cops Riggs and Murtaugh are back for another round of high-stakes action, this time setting their collective sights on bringing down a former Los Angeles police lieutenant turned black market weapons dealer. Lorna Cole joins as the beautiful yet hardnosed internal affairs sergeant who catches Riggs's eye.",
      "runtime": 118
    },
    {
      "name": "The Proposal",
      "size": 317375031,
      "keywords": [
        "fictitious marriage",
        "deportation",
        "immigration law",
        "romantic comedy",
        "alaska",
        "naked scene",
        "co-worker",
        "humiliation",
        "book editor",
        "fake boyfriend",
        "duringcreditsstinger",
        "woman director",
        "pretend relationship"
      ],
      "user_rating": 6.7,
      "votes": 1804,
      "release_year": 2009,
      "overview": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
      "runtime": 108
    },
    {
      "name": "Beverly Hills Cop",
      "size": 316360478,
      "keywords": [
        "california",
        "showdown",
        "undercover",
        "strip club",
        "investigation",
        "weapon",
        "police",
        "smuggling",
        "swimming pool",
        "gunfight",
        "mansion",
        "los angeles",
        "foot chase",
        "art gallery",
        "car chase",
        "warehouse",
        "beverly hills",
        "buddy comedy",
        "country club",
        "maverick cop",
        "detroit michigan",
        "damsel in distress",
        "bar fight"
      ],
      "user_rating": 6.8,
      "votes": 961,
      "release_year": 1984,
      "overview": "Tough-talking Detroit cop Axel Foley heads to the rarified world of Beverly Hills in his beat-up Chevy Nova to investigate a friend's murder. But soon, he realizes he's stumbled onto something much more complicated. Bungling rookie detective Billy Rosewood joins the fish-out-of-water Axel and shows him the West Los Angeles ropes.",
      "runtime": 105
    },
    {
      "name": "Chicken Little",
      "size": 314432665,
      "keywords": [
        "fish",
        "small town",
        "space marine",
        "chicken",
        "alien",
        "best friend",
        "alien invasion",
        "animal",
        "duringcreditsstinger",
        "3d"
      ],
      "user_rating": 5.6,
      "votes": 944,
      "release_year": 2005,
      "overview": "When the sky really is falling and sanity has flown the coop, who will rise to save the day? Together with his hysterical band of misfit friends, Chicken Little must hatch a plan to save the planet from alien invasion and prove that the world's biggest hero is a little chicken.",
      "runtime": 81
    },
    {
      "name": "As Good as It Gets",
      "size": 314178011,
      "keywords": [
        "single parent",
        "waitress",
        "lone wolf",
        "friendship",
        "neighbor",
        "author",
        "cowardliness",
        "writer",
        "dog",
        "rude",
        "obnoxious",
        "unlikely friendship",
        "noodle salad"
      ],
      "user_rating": 7.2,
      "votes": 915,
      "release_year": 1997,
      "overview": "New York City. Melvin Udall, a cranky, bigoted, obsessive-compulsive writer, finds his life turned upside down when neighboring gay artist Simon is hospitalized and his dog is entrusted to Melvin. In addition, Carol, the only waitress who will tolerate him, must leave work to care for her sick son, making it impossible for Melvin to eat breakfast.",
      "runtime": 139
    },
    {
      "name": "The SpongeBob Movie: Sponge Out of Water",
      "size": 311594032,
      "keywords": [
        "ocean",
        "sea",
        "star",
        "water",
        "comedy",
        "sponge",
        "spongebob",
        "live action and animation"
      ],
      "user_rating": 5.8,
      "votes": 719,
      "release_year": 2015,
      "overview": "Burger Beard is a pirate who is in search of the final page of a magical book that makes any evil plan he writes in it come true, which happens to be the Krabby Patty secret formula. When the entire city of Bikini Bottom is put in danger, SpongeBob, Patrick, Mr. Krabs, Squidward, Sandy, and Plankton need to go on a quest that takes them to the surface. In order to get back the recipe and save their city, the gang must retrieve the book and transform themselves into superheroes.",
      "runtime": 93
    },
    {
      "name": "Austin Powers: The Spy Who Shagged Me",
      "size": 310940086,
      "keywords": [
        "saving the world",
        "moon",
        "submarine",
        "clone",
        "spy",
        "cia",
        "showdown",
        "android",
        "usa president",
        "exotic island",
        "cat",
        "lasergun",
        "nasa",
        "undercover",
        "space marine",
        "car journey",
        "auto",
        "time travel",
        "supermodel",
        "single",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.2,
      "votes": 1011,
      "release_year": 1999,
      "overview": "When diabolical genius, Dr. Evil travels back in time to steal superspy Austin Powers's ‘mojo’, Austin must return to the swingin' '60s himself – with the help of American agent, Felicity Shagwell – to stop the dastardly plan. Once there, Austin faces off against Dr. Evil's army of minions and saves the world in his own unbelievably groovy way.",
      "runtime": 95
    },
    {
      "name": "Little Fockers",
      "size": 310650585,
      "keywords": [
        "nurse",
        "cat",
        "father-in-law",
        "vomit",
        "kids and family",
        "viagra",
        "duringcreditsstinger"
      ],
      "user_rating": 5.4,
      "votes": 1060,
      "release_year": 2010,
      "overview": "It has taken 10 years, two little Fockers with wife Pam and countless hurdles for Greg to finally get in with his tightly wound father-in-law, Jack. After the cash-strapped dad takes a job moonlighting for a drug company, Jack's suspicions about his favorite male nurse come roaring back. When Greg and Pam's entire clan descends for the twins' birthday party, Greg must prove to the skeptical Jack that he's fully capable as the man of the house.",
      "runtime": 98
    },
    {
      "name": "Bolt",
      "size": 309979994,
      "keywords": [
        "hamster",
        "kids and family",
        "animal",
        "cat vs dog",
        "duringcreditsstinger",
        "dog cat friendship",
        "animal lead",
        "girl dog relationship"
      ],
      "user_rating": 6.3,
      "votes": 1750,
      "release_year": 2008,
      "overview": "Bolt is the star of the biggest show in Hollywood. The only problem is, he thinks it's real. After he's accidentally shipped to New York City and separated from Penny, his beloved co-star and owner, Bolt must harness all his \"super powers\" to find a way home.",
      "runtime": 98
    },
    {
      "name": "Runaway Bride",
      "size": 309457509,
      "keywords": [
        "small town",
        "self-discovery",
        "just married",
        "reporter",
        "wedding",
        "relationship"
      ],
      "user_rating": 5.7,
      "votes": 455,
      "release_year": 1999,
      "overview": "Ike Graham, New York columnist, writes his text always at the last minute. This time, a drunken man in his favourite bar tells Ike about Maggie Carpenter, a woman who always flees from her grooms in the last possible moment. Ike, who does not have the best opinion about females anyway, writes an offensive column without researching the subject thoroughly.",
      "runtime": 116
    },
    {
      "name": "Chicago",
      "size": 306776732,
      "keywords": [
        "chicago",
        "based on stage musical",
        "prison matron",
        "jazz age",
        "nude man murdered"
      ],
      "user_rating": 6.9,
      "votes": 677,
      "release_year": 2002,
      "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
      "runtime": 113
    },
    {
      "name": "Hook",
      "size": 300854823,
      "keywords": [
        "flying",
        "swordplay",
        "sword",
        "fantasy",
        "peter pan",
        "daughter",
        "fairy-tale figure",
        "rescue"
      ],
      "user_rating": 6.6,
      "votes": 1532,
      "release_year": 1991,
      "overview": "The boy who wasn't supposed to grow up—Peter Pan—did just that, becoming a soulless corporate lawyer whose workaholism could cost him his wife and kids. But a trip to see Granny Wendy in London, where the vengeful Capt. Hook kidnaps Peter's kids and forces Peter to return to Neverland, could lead to a chance at redemption, in this family-oriented fantasy from director Steven Spielberg.",
      "runtime": 144
    },
    {
      "name": "Stuart Little",
      "size": 300135367,
      "keywords": [
        "brother brother relationship",
        "based on novel",
        "cat",
        "mouse",
        "adoption",
        "orphanage",
        "step brother",
        "kids and family",
        "new york city twin towers",
        "gangster"
      ],
      "user_rating": 5.8,
      "votes": 959,
      "release_year": 1999,
      "overview": "The adventures of a heroic and debonair stalwart mouse named Stuart Little with human qualities, who faces some comic misadventures while searching for his lost bird friend and living with a human family as their child.",
      "runtime": 84
    },
    {
      "name": "Beverly Hills Cop II",
      "size": 299965036,
      "keywords": [
        "smuggling of arms",
        "detective",
        "intensive care",
        "undercover",
        "strip club",
        "armored car",
        "investigation",
        "police",
        "swimming pool",
        "sequel",
        "shootout",
        "gunfight",
        "los angeles",
        "explosion",
        "violence",
        "car chase",
        "detroit",
        "horse track",
        "beverly hills",
        "buddy cop",
        "oil field",
        "cement truck",
        "playboy mansion",
        "shooting range"
      ],
      "user_rating": 6.1,
      "votes": 613,
      "release_year": 1987,
      "overview": "Detroit cop, Axel Foley heads for the land of sunshine and palm trees to find out who shot police Captain Andrew Bogomil. Thanks to a couple of old friends, Axel's investigation uncovers a series of robberies masterminded by a heartless weapons kingpin – and the chase is on.",
      "runtime": 100
    },
    {
      "name": "My Best Friend's Wedding",
      "size": 299288605,
      "keywords": [
        "karaoke",
        "marriage proposal",
        "new love",
        "love of one's life",
        "kiss",
        "man-woman relation",
        "secret love",
        "wedding"
      ],
      "user_rating": 6.3,
      "votes": 584,
      "release_year": 1997,
      "overview": "When she receives word that her longtime platonic pal Michael O'Neal is getting married to debutante Kimberly Wallace, food critic Julianne Potter realizes her true feelings for Michael -- and sets out to sabotage the wedding.",
      "runtime": 105
    },
    {
      "name": "Austin Powers in Goldmember",
      "size": 296655431,
      "keywords": [
        "saving the world",
        "submarine",
        "brother brother relationship",
        "clone",
        "spy",
        "helicopter",
        "gold",
        "submachine gun",
        "asteroid",
        "undercover",
        "belgium",
        "dutch",
        "car journey",
        "nightclub",
        "laser",
        "sumo ringer",
        "family history",
        "auto",
        "clowning",
        "overweight man",
        "conciliation",
        "james bond spoof",
        "duringcreditsstinger"
      ],
      "user_rating": 5.9,
      "votes": 979,
      "release_year": 2002,
      "overview": "The world's most shagadelic spy continues his fight against Dr. Evil. This time, the diabolical doctor and his clone, Mini-Me, team up with a new foe -- '70s kingpin Goldmember. While pursuing the team of villains to stop them from world domination, Austin gets help from his dad and an old girlfriend.",
      "runtime": 94
    },
    {
      "name": "Doctor Dolittle",
      "size": 294456605,
      "keywords": [
        "talking to animals",
        "woman director"
      ],
      "user_rating": 5.4,
      "votes": 686,
      "release_year": 1998,
      "overview": "A successful physician and devoted family man, John Dolittle (Eddie Murphy) seems to have the world by the tail, until a long suppressed talent he possessed as a child, the ability to communicate with animals is suddenly reawakened with a vengeance! Now every creature within squawking distance wants the good doctor's advice, unleashing an outrageous chain of events that turns his world upside down!",
      "runtime": 85
    },
    {
      "name": "G-Force",
      "size": 292817841,
      "keywords": [
        "dyr",
        "duringcreditsstinger"
      ],
      "user_rating": 5.1,
      "votes": 510,
      "release_year": 2009,
      "overview": "A team of trained secret agent animals, guinea pigs Darwin, Juarez, Blaster, mole Speckles, and fly Mooch takes on a mission for the US government to stop evil Leonard Saber, who plans to destroy the world with household appliances. But the government shuts them down and they are sentenced to a pet shop. Can they escape to defeat the villain and save the world?",
      "runtime": 88
    }
  ],
  "links": [
    {
      "source": "Minions",
      "target": "Despicable Me 2",
      "value": 3
    },
    {
      "source": "Minions",
      "target": "Ice Age: Dawn of the Dinosaurs",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Deadpool",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Big Hero 6",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Minions",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Up",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Night at the Museum",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Ted",
      "value": 2
    },
    {
      "source": "Toy Story 3",
      "target": "Toy Story 2",
      "value": 4
    },
    {
      "source": "Toy Story 3",
      "target": "Toy Story",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Ice Age: Dawn of the Dinosaurs",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "Despicable Me 2",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Shrek 2",
      "target": "Shrek the Third",
      "value": 2
    },
    {
      "source": "Shrek 2",
      "target": "Shrek",
      "value": 4
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Inside Out",
      "value": 2
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Night at the Museum",
      "value": 2
    },
    {
      "source": "Ice Age: Dawn of the Dinosaurs",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Up",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Inside Out",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Shrek the Third",
      "target": "Cars 2",
      "value": 2
    },
    {
      "source": "Shrek the Third",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Shrek the Third",
      "target": "Austin Powers in Goldmember",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Teenage Mutant Ninja Turtles",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Deadpool",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Up",
      "target": "The Smurfs",
      "value": 2
    },
    {
      "source": "Forrest Gump",
      "target": "Ted",
      "value": 2
    },
    {
      "source": "Ice Age: The Meltdown",
      "target": "Ice Age",
      "value": 3
    },
    {
      "source": "Big Hero 6",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Big Hero 6",
      "target": "Teenage Mutant Ninja Turtles",
      "value": 2
    },
    {
      "source": "Big Hero 6",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Brave",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Kung Fu Panda 3",
      "value": 6
    },
    {
      "source": "Kung Fu Panda",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Teenage Mutant Ninja Turtles",
      "value": 2
    },
    {
      "source": "Kung Fu Panda",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Men in Black 3",
      "target": "Men in Black",
      "value": 2
    },
    {
      "source": "Men in Black 3",
      "target": "Men in Black II",
      "value": 2
    },
    {
      "source": "Ratatouille",
      "target": "Stuart Little",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "The Croods",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "Rio",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "How to Train Your Dragon 2",
      "target": "Kung Fu Panda 3",
      "value": 2
    },
    {
      "source": "Men in Black",
      "target": "Men in Black II",
      "value": 10
    },
    {
      "source": "Men in Black",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Men in Black",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Wreck-It Ralph",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "The Croods",
      "target": "Ice Age",
      "value": 3
    },
    {
      "source": "The Croods",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Night at the Museum",
      "target": "Toy Story 2",
      "value": 3
    },
    {
      "source": "Night at the Museum",
      "target": "Night at the Museum: Battle of the Smithsonian",
      "value": 3
    },
    {
      "source": "Night at the Museum",
      "target": "Hotel Transylvania",
      "value": 2
    },
    {
      "source": "Night at the Museum",
      "target": "Night at the Museum: Secret of the Tomb",
      "value": 2
    },
    {
      "source": "Night at the Museum",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "Aladdin",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "Hotel Transylvania",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "The Smurfs 2",
      "value": 2
    },
    {
      "source": "The Smurfs",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Kung Fu Panda 3",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Cars",
      "value": 3
    },
    {
      "source": "Cars 2",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Back to the Future Part II",
      "value": 2
    },
    {
      "source": "Cars 2",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Ted",
      "target": "Toy Story 2",
      "value": 2
    },
    {
      "source": "Ted",
      "target": "Toy Story",
      "value": 2
    },
    {
      "source": "Brave",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "The Simpsons Movie",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Kung Fu Panda 3",
      "target": "Now You See Me 2",
      "value": 2
    },
    {
      "source": "Meet the Fockers",
      "target": "My Big Fat Greek Wedding",
      "value": 4
    },
    {
      "source": "Meet the Fockers",
      "target": "Meet the Parents",
      "value": 3
    },
    {
      "source": "Aladdin",
      "target": "Shrek",
      "value": 2
    },
    {
      "source": "Aladdin",
      "target": "Enchanted",
      "value": 3
    },
    {
      "source": "Toy Story 2",
      "target": "The Lego Movie",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Night at the Museum: Battle of the Smithsonian",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Toy Story",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "A Bug's Life",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Toy Story 2",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Rio",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Rio",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Mr. & Mrs. Smith",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Home Alone",
      "target": "Home Alone 2: Lost in New York",
      "value": 2
    },
    {
      "source": "Hotel Transylvania 2",
      "target": "Hotel Transylvania",
      "value": 10
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Wreck-It Ralph",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "The Lego Movie",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "The Lego Movie",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Pretty Woman",
      "target": "Cars",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Alvin and the Chipmunks: The Squeakquel",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Happy Feet",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Cars",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 4
    },
    {
      "source": "Cars",
      "target": "Austin Powers in Goldmember",
      "value": 3
    },
    {
      "source": "Alvin and the Chipmunks: The Squeakquel",
      "target": "Alvin and the Chipmunks",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks: The Squeakquel",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks: The Squeakquel",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Men in Black II",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Men in Black II",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Men in Black II",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 3
    },
    {
      "source": "Men in Black II",
      "target": "Austin Powers in Goldmember",
      "value": 2
    },
    {
      "source": "Mrs. Doubtfire",
      "target": "My Big Fat Greek Wedding",
      "value": 2
    },
    {
      "source": "Night at the Museum: Battle of the Smithsonian",
      "target": "Night at the Museum: Secret of the Tomb",
      "value": 2
    },
    {
      "source": "Night at the Museum: Battle of the Smithsonian",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Happy Feet",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Happy Feet",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Back to the Future",
      "target": "Back to the Future Part II",
      "value": 5
    },
    {
      "source": "Toy Story",
      "target": "The Flintstones",
      "value": 2
    },
    {
      "source": "Home",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "My Big Fat Greek Wedding",
      "target": "Meet the Parents",
      "value": 2
    },
    {
      "source": "A Bug's Life",
      "target": "Little Fockers",
      "value": 2
    },
    {
      "source": "A Bug's Life",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Alvin and the Chipmunks",
      "target": "Megamind",
      "value": 2
    },
    {
      "source": "Meet the Parents",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Meet the Parents",
      "target": "Little Fockers",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Chicken Little",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Megamind",
      "target": "Austin Powers in Goldmember",
      "value": 2
    },
    {
      "source": "Beverly Hills Cop",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Beverly Hills Cop",
      "target": "Beverly Hills Cop II",
      "value": 9
    },
    {
      "source": "Chicken Little",
      "target": "Austin Powers: The Spy Who Shagged Me",
      "value": 2
    },
    {
      "source": "Chicken Little",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Austin Powers: The Spy Who Shagged Me",
      "target": "Little Fockers",
      "value": 2
    },
    {
      "source": "Austin Powers: The Spy Who Shagged Me",
      "target": "Austin Powers in Goldmember",
      "value": 8
    },
    {
      "source": "Little Fockers",
      "target": "Bolt",
      "value": 2
    },
    {
      "source": "Little Fockers",
      "target": "Stuart Little",
      "value": 2
    }
  ]
}