{
  "nodes": [
    {
      "name": "Titanic",
      "size": 1845034188,
      "keywords": [
        "shipwreck",
        "iceberg",
        "ship",
        "panic",
        "titanic",
        "ocean liner",
        "epic",
        "rich woman - poor man",
        "love",
        "disaster",
        "tragic love",
        "class differences",
        "imax",
        "star crossed lovers",
        "steerage",
        "salvage",
        "rich snob",
        "3d",
        "1910s"
      ],
      "user_rating": 7.5,
      "votes": 7562,
      "release_year": 1997,
      "overview": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "runtime": 194
    },
    {
      "name": "The Dark Knight Rises",
      "size": 1084939099,
      "keywords": [
        "dc comics",
        "crime fighter",
        "terrorist",
        "secret identity",
        "burglar",
        "hostage drama",
        "time bomb",
        "gotham city",
        "vigilante",
        "cover-up",
        "superhero",
        "villainess",
        "tragic hero",
        "terrorism",
        "destruction",
        "catwoman",
        "cat burglar",
        "imax",
        "flood",
        "criminal underworld",
        "batman"
      ],
      "user_rating": 7.6,
      "votes": 9106,
      "release_year": 2012,
      "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
      "runtime": 165
    },
    {
      "name": "The Dark Knight",
      "size": 1004558444,
      "keywords": [
        "dc comics",
        "crime fighter",
        "secret identity",
        "scarecrow",
        "sadism",
        "chaos",
        "gotham city",
        "vigilante",
        "joker",
        "superhero",
        "based on comic book",
        "tragic hero",
        "organized crime",
        "criminal mastermind",
        "district attorney",
        "imax",
        "super villain",
        "super powers",
        "batman"
      ],
      "user_rating": 8.2,
      "votes": 12002,
      "release_year": 2008,
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "runtime": 152
    },
    {
      "name": "The Jungle Book",
      "size": 966550600,
      "keywords": [
        "based on novel",
        "snake",
        "wolf",
        "elephant",
        "tiger",
        "feral child",
        "panther",
        "remake",
        "bear",
        "jungle",
        "talking animal",
        "orphan",
        "animal",
        "talking to animals"
      ],
      "user_rating": 6.7,
      "votes": 2892,
      "release_year": 2016,
      "overview": "After a threat from the tiger Shere Khan forces him to flee the jungle, a man-cub named Mowgli embarks on a journey of self discovery with the help of panther, Bagheera, and free spirited bear, Baloo.",
      "runtime": 106
    },
    {
      "name": "Inside Out",
      "size": 857611174,
      "keywords": [
        "dream",
        "cartoon",
        "imaginary friend",
        "animation",
        "family",
        "moving",
        "kids",
        "unicorn",
        "duringcreditsstinger",
        "3d",
        "emotions"
      ],
      "user_rating": 8,
      "votes": 6560,
      "release_year": 2015,
      "overview": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
      "runtime": 94
    },
    {
      "name": "The Twilight Saga: Breaking Dawn - Part 2",
      "size": 829000000,
      "keywords": [
        "vampire",
        "romance",
        "villainess",
        "super strength",
        "imprinting",
        "cross breed",
        "bloodsucker",
        "grudge",
        "vampire vs vampire",
        "chief of police",
        "dhampir",
        "forks washington",
        "wolf pack",
        "misinformation",
        "seeing the future",
        "fang vamp"
      ],
      "user_rating": 6.1,
      "votes": 2553,
      "release_year": 2012,
      "overview": "After the birth of Renesmee, the Cullens gather other vampire clans in order to protect the child from a false allegation that puts the family in front of the Volturi.",
      "runtime": 115
    },
    {
      "name": "The Lion King",
      "size": 788241776,
      "keywords": [
        "loss of parents",
        "wild boar",
        "uncle",
        "shaman",
        "redemption",
        "king",
        "scar",
        "hyena",
        "meerkat"
      ],
      "user_rating": 8,
      "votes": 5376,
      "release_year": 1994,
      "overview": "A young lion cub named Simba can't wait to be king. But his uncle craves the title for himself and will stop at nothing to get it.",
      "runtime": 89
    },
    {
      "name": "Gravity",
      "size": 716392705,
      "keywords": [
        "space mission",
        "loss",
        "space",
        "astronaut",
        "trapped in space"
      ],
      "user_rating": 7.3,
      "votes": 5751,
      "release_year": 2013,
      "overview": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
      "runtime": 91
    },
    {
      "name": "Dawn of the Planet of the Apes",
      "size": 710644566,
      "keywords": [
        "leader",
        "colony",
        "post-apocalyptic",
        "dystopia",
        "forest",
        "sequel",
        "woods",
        "ape",
        "scientist",
        "monkey",
        "medical research",
        "animal attack",
        "plague",
        "3d"
      ],
      "user_rating": 7.3,
      "votes": 4410,
      "release_year": 2014,
      "overview": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
      "runtime": 130
    },
    {
      "name": "The Twilight Saga: New Moon",
      "size": 709827462,
      "keywords": [
        "moon",
        "cinema",
        "vampire",
        "werewolf",
        "fang vamp"
      ],
      "user_rating": 5.6,
      "votes": 2436,
      "release_year": 2009,
      "overview": "Forks, Washington resident Bella Swan is reeling from the departure of her vampire love, Edward Cullen, and finds comfort in her friendship with Jacob Black, a werewolf. But before she knows it, she's thrust into a centuries-old conflict, and her desire to be with Edward at any cost leads her to take greater and greater risks.",
      "runtime": 130
    },
    {
      "name": "The Twilight Saga: Eclipse",
      "size": 698491347,
      "keywords": [
        "vampire",
        "graduation",
        "bite",
        "immortality",
        "werewolf",
        "fang vamp"
      ],
      "user_rating": 5.8,
      "votes": 2301,
      "release_year": 2010,
      "overview": "Bella once again finds herself surrounded by danger as Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob, knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella is confronted with the most important decision of her life.",
      "runtime": 124
    },
    {
      "name": "Forrest Gump",
      "size": 677945399,
      "keywords": [
        "vietnam veteran",
        "hippie",
        "mentally disabled",
        "running",
        "based on novel",
        "vietnam",
        "vietnam war",
        "friendship",
        "love",
        "family relationships",
        "bully",
        "mother son relationship",
        "military",
        "hugging",
        "shrimping",
        "wounded soldier",
        "flashback",
        "park bench",
        "amputee"
      ],
      "user_rating": 8.2,
      "votes": 7927,
      "release_year": 1994,
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
      "runtime": 142
    },
    {
      "name": "Interstellar",
      "size": 675120017,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "father son relationship",
        "single parent",
        "nasa",
        "expedition",
        "wormhole",
        "space travel",
        "famine",
        "black hole",
        "dystopia",
        "race against time",
        "quantum mechanics",
        "spaceship",
        "space",
        "rescue",
        "family relationships",
        "farmhouse",
        "robot",
        "astronaut",
        "scientist",
        "father daughter relationship",
        "single father",
        "farmer",
        "space station",
        "imax",
        "astrophysics",
        "zero gravity",
        "courage",
        "time paradox",
        "relativity"
      ],
      "user_rating": 8.1,
      "votes": 10867,
      "release_year": 2014,
      "overview": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "runtime": 169
    },
    {
      "name": "The Sixth Sense",
      "size": 672806292,
      "keywords": [
        "child abuse",
        "sense of guilt",
        "loss of child",
        "confidence",
        "psychology",
        "dying and death",
        "marriage crisis",
        "afterlife",
        "single",
        "paranormal phenomena",
        "cowardliness",
        "child",
        "spiritism"
      ],
      "user_rating": 7.7,
      "votes": 3147,
      "release_year": 1999,
      "overview": "A psychological thriller about an eight year old boy named Cole Sear who believes he can see into the world of the dead. A child psychologist named Malcolm Crowe comes to Cole to help him deal with his problem, learning that he really can see ghosts of dead people.",
      "runtime": 107
    },
    {
      "name": "The Martian",
      "size": 630161890,
      "keywords": [
        "based on novel",
        "mars",
        "nasa",
        "isolation",
        "botanist",
        "stranded",
        "spaceship",
        "space",
        "engineering",
        "survival",
        "astronaut",
        "science",
        "deep space explorer",
        "duringcreditsstinger",
        "battle for survival"
      ],
      "user_rating": 7.6,
      "votes": 7268,
      "release_year": 2015,
      "overview": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
      "runtime": 141
    },
    {
      "name": "The Passion of the Christ",
      "size": 611899420,
      "keywords": [
        "christianity",
        "jewry",
        "roman empire",
        "jesus christ",
        "suffering",
        "apostle",
        "last supper",
        "roman",
        "bible",
        "mission",
        "torture"
      ],
      "user_rating": 6.9,
      "votes": 864,
      "release_year": 2004,
      "overview": "\"The Passion of the Christ\" is a film about the last 12 hours in the life of Jesus. Director Mel Gibson received much criticism from critics and audiences for his explicit depiction of and focus on violence and on christs suffering, especially on the part of the jewish community. The films languages are Arabic, Latin and Hebrew and its actors are laymen which was controversially received as well.",
      "runtime": 127
    },
    {
      "name": "Life of Pi",
      "size": 609016565,
      "keywords": [
        "ocean",
        "shipwreck",
        "hindu",
        "tiger",
        "faith",
        "zookeeper",
        "teenage boy",
        "cargo ship",
        "lifeboat",
        "injured animal"
      ],
      "user_rating": 7.2,
      "votes": 5797,
      "release_year": 2012,
      "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
      "runtime": 127
    },
    {
      "name": "I Am Legend",
      "size": 585349010,
      "keywords": [
        "saving the world",
        "lost civilisation",
        "post-apocalyptic",
        "dystopia",
        "matter of life and death",
        "alone",
        "helplessness",
        "virus",
        "pandemic"
      ],
      "user_rating": 6.9,
      "votes": 4853,
      "release_year": 2007,
      "overview": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
      "runtime": 101
    },
    {
      "name": "Fifty Shades of Grey",
      "size": 571006128,
      "keywords": [
        "based on novel",
        "perversion",
        "spanking",
        "billionaire",
        "bdsm",
        "woman director"
      ],
      "user_rating": 5.2,
      "votes": 3254,
      "release_year": 2015,
      "overview": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
      "runtime": 125
    },
    {
      "name": "King Kong",
      "size": 550000000,
      "keywords": [
        "film business",
        "screenplay",
        "show business",
        "film making",
        "film producer",
        "exotic island",
        "monster",
        "indigenous",
        "ship",
        "dinosaur"
      ],
      "user_rating": 6.6,
      "votes": 2337,
      "release_year": 2005,
      "overview": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
      "runtime": 187
    },
    {
      "name": "Cinderella",
      "size": 543514353,
      "keywords": [
        "cinderella",
        "magic",
        "prince",
        "fairy tale",
        "kingdom",
        "royalty",
        "orphan",
        "lost shoe",
        "evil stepmother",
        "retelling"
      ],
      "user_rating": 6.7,
      "votes": 2374,
      "release_year": 2015,
      "overview": "When her father unexpectedly passes away, young Ella finds herself at the mercy of her cruel stepmother and her daughters. Never one to give up hope, Ella's fortunes begin to change after meeting a dashing stranger in the woods.",
      "runtime": 105
    },
    {
      "name": "The Revenant",
      "size": 532950503,
      "keywords": [
        "father son relationship",
        "rape",
        "based on novel",
        "mountains",
        "winter",
        "grizzly bear",
        "wilderness",
        "frontier",
        "revenge",
        "murder",
        "native american",
        "survival",
        "bear",
        "snow",
        "violence",
        "animal death",
        "bear attack",
        "death of son",
        "based on true events",
        "fur trapper"
      ],
      "user_rating": 7.3,
      "votes": 6396,
      "release_year": 2015,
      "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
      "runtime": 156
    },
    {
      "name": "World War Z",
      "size": 531865000,
      "keywords": [
        "dystopia",
        "apocalypse",
        "zombie",
        "nuclear weapons",
        "multiple perspectives",
        "zombie apocalypse"
      ],
      "user_rating": 6.7,
      "votes": 5560,
      "release_year": 2013,
      "overview": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.",
      "runtime": 116
    },
    {
      "name": "Ghost",
      "size": 505000000,
      "keywords": [
        "corruption",
        "fortune teller",
        "money transfer",
        "money laundering",
        "pottery",
        "afterlife",
        "spiritism"
      ],
      "user_rating": 6.9,
      "votes": 1339,
      "release_year": 1990,
      "overview": "Sam Wheat is a banker, Molly Jensen is an artist, and the two are madly in love. However, when Sam is murdered by his friend and corrupt business partner Carl Bruner over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown to set things right and protect Molly from Carl and his goons.",
      "runtime": 127
    },
    {
      "name": "Troy",
      "size": 497409852,
      "keywords": [
        "brother brother relationship",
        "adultery",
        "mythology",
        "beauty",
        "trojan war",
        "bravery",
        "wall",
        "fraud",
        "hostility",
        "epic",
        "sword fight",
        "battlefield",
        "ancient world",
        "pyre",
        "ancient greece",
        "trojan horse",
        "trojan",
        "bronze age",
        "sparta greece",
        "helen of troy",
        "homer's iliad"
      ],
      "user_rating": 6.9,
      "votes": 2759,
      "release_year": 2004,
      "overview": "In year 1250 B.C. during the late Bronze age, two emerging nations begin to clash. Paris, the Trojan prince, convinces Helen, Queen of Sparta, to leave her husband Menelaus, and sail with him back to Troy. After Menelaus finds out that his wife was taken by the Trojans, he asks his brother Agamemnom to help him get her back. Agamemnon sees this as an opportunity for power. So they set off with 1,000 ships holding 50,000 Greeks to Troy. With the help of Achilles, the Greeks are able to fight the never before defeated Trojans.",
      "runtime": 163
    },
    {
      "name": "Twister",
      "size": 494471524,
      "keywords": [
        "wife husband relationship",
        "tornado",
        "twister",
        "oklahoma",
        "metereologist",
        "invention",
        "climate",
        "barn",
        "natural disaster",
        "cow",
        "truck",
        "disaster",
        "aunt niece relationship",
        "storm chaser",
        "divorce"
      ],
      "user_rating": 6.1,
      "votes": 950,
      "release_year": 1996,
      "overview": "TV weatherman Bill Harding is trying to get his tornado-hunter wife, Jo, to sign divorce papers so he can marry his girlfriend Melissa. But Mother Nature, in the form of a series of intense storms sweeping across Oklahoma, has other plans. Soon the three have joined the team of stormchasers as they attempt to insert a revolutionary measuring device into the very heart of several extremely violent tornados.",
      "runtime": 113
    },
    {
      "name": "Rise of the Planet of the Apes",
      "size": 482860185,
      "keywords": [
        "intelligence",
        "zoo",
        "cage",
        "dystopia",
        "golden gate bridge",
        "ape",
        "monkey",
        "medical research",
        "alzheimer's disease"
      ],
      "user_rating": 7,
      "votes": 4347,
      "release_year": 2011,
      "overview": "Scientist Will Rodman is determined to find a cure for Alzheimer's, the disease which has slowly consumed his father. Will feels certain he is close to a breakthrough and tests his latest serum on apes, noticing dramatic increases in intelligence and brain activity in the primate subjects – especially Caesar, his pet chimpanzee.",
      "runtime": 105
    },
    {
      "name": "Saving Private Ryan",
      "size": 481840909,
      "keywords": [
        "war crimes",
        "self sacrifice",
        "war veteran",
        "world war ii",
        "war ship",
        "airplane",
        "bravery",
        "normandy",
        "parachute",
        "troops",
        "waffen ss",
        "omaha beach",
        "army",
        "cowardice",
        "american flag",
        "war memorial",
        "deserted town",
        "military",
        "1940s"
      ],
      "user_rating": 7.9,
      "votes": 5048,
      "release_year": 1998,
      "overview": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home.",
      "runtime": 169
    },
    {
      "name": "Mr. & Mrs. Smith",
      "size": 478207520,
      "keywords": [
        "bomb",
        "assassin",
        "secret identity",
        "secret",
        "assault rifle",
        "gun",
        "married couple",
        "hitman",
        "decoy",
        "marriage crisis",
        "marriage",
        "job",
        "dysfunctional marriage",
        "gunfight",
        "bullet wound"
      ],
      "user_rating": 6.5,
      "votes": 2965,
      "release_year": 2005,
      "overview": "After five (or six) years of vanilla-wedded bliss, ordinary suburbanites John and Jane Smith are stuck in a huge rut. Unbeknownst to each other, they are both coolly lethal, highly-paid assassins working for rival organisations. When they discover they're each other's next target, their secret lives collide in a spicy, explosive mix of wicked comedy, pent-up passion, nonstop action and high-tech weaponry.",
      "runtime": 120
    },
    {
      "name": "San Andreas",
      "size": 470490832,
      "keywords": [
        "california",
        "earthquake",
        "catastrophe",
        "disaster film",
        "3d",
        "san andreas",
        "san andreas california",
        "rescue operation"
      ],
      "user_rating": 6,
      "votes": 2968,
      "release_year": 2015,
      "overview": "In the aftermath of a massive earthquake in California, a rescue-chopper pilot makes a dangerous journey across the state in order to rescue his estranged daughter.",
      "runtime": 114
    },
    {
      "name": "Gladiator",
      "size": 457640427,
      "keywords": [
        "rome",
        "gladiator",
        "arena",
        "senate",
        "roman empire",
        "emperor",
        "slavery",
        "battlefield",
        "blood",
        "ancient world",
        "father daughter relationship",
        "combat",
        "mother son relationship",
        "dream sequence",
        "chariot",
        "philosopher",
        "barbarian horde",
        "2nd century",
        "successor"
      ],
      "user_rating": 7.9,
      "votes": 5439,
      "release_year": 2000,
      "overview": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos. Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences. His battle skills serve him well, and he becomes one of the most famous and admired men to fight in the Colosseum. Determined to avenge himself against the man who took away his freedom and laid waste to his family, Maximus believes that he can use his fame and skill in the ring to avenge the loss of his family and former glory. As the gladiator begins to challenge his rule, Commodus decides to put his own fighting mettle to the test by squaring off with Maximus in a battle to the death.",
      "runtime": 155
    },
    {
      "name": "The Last Samurai",
      "size": 456758981,
      "keywords": [
        "japan",
        "war crimes",
        "sense of guilt",
        "swordplay",
        "general",
        "samurai",
        "war veteran",
        "katana",
        "sword",
        "arms deal",
        "homeland",
        "emperor",
        "language barrier",
        "self-discovery",
        "mountain village",
        "foreign legion",
        "mercenary",
        "campaign",
        "commercial agreement",
        "insurgence",
        "leader",
        "war strategy",
        "gettysburg",
        "loss of husband",
        "slaughter",
        "soldier",
        "alcoholic",
        "u.s. soldier",
        "japanese army",
        "19th century",
        "war trauma"
      ],
      "user_rating": 7.3,
      "votes": 1895,
      "release_year": 2003,
      "overview": "Nathan Algren is an American hired to instruct the Japanese army in the ways of modern warfare, which finds him learning to respect the samurai and the honorable principles that rule them. Pressed to destroy the samurai's way of life in the name of modernization and open trade, Algren decides to become an ultimate warrior himself and to fight for their right to exist.",
      "runtime": 154
    },
    {
      "name": "The Bourne Ultimatum",
      "size": 442824138,
      "keywords": [
        "paris",
        "corruption",
        "madrid",
        "assassin",
        "based on novel",
        "europe",
        "prosecution",
        "dangerous",
        "false identity",
        "revelation",
        "government",
        "weapon",
        "interpol",
        "sequel",
        "conspiracy",
        "shootout",
        "espionage",
        "motorcycle",
        "violence",
        "foot chase",
        "moskow",
        "dark past",
        "langley virginia",
        "flashback",
        "chase on the roof",
        "security leak"
      ],
      "user_rating": 7.3,
      "votes": 2888,
      "release_year": 2007,
      "overview": "Bourne is brought out of hiding once again by reporter Simon Ross who is trying to unveil Operation Blackbriar, an upgrade to Project Treadstone, in a series of newspaper columns. Information from the reporter stirs a new set of memories, and Bourne must finally uncover his dark past while dodging The Company's best efforts to eradicate him.",
      "runtime": 115
    },
    {
      "name": "Les Misérables",
      "size": 441809770,
      "keywords": [
        "france",
        "robbery",
        "brothel",
        "mayor",
        "star",
        "musical",
        "arrest",
        "army",
        "rebellion",
        "wedding",
        "falling in love",
        "corpse",
        "parole",
        "convict",
        "girl disguised as boy"
      ],
      "user_rating": 7.1,
      "votes": 1884,
      "release_year": 2012,
      "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France, in which a paroled prisoner named Jean Valjean seeks redemption.",
      "runtime": 157
    },
    {
      "name": "The Exorcist",
      "size": 441306145,
      "keywords": [
        "exorcism",
        "holy water",
        "religion and supernatural",
        "vomit",
        "christian",
        "possession",
        "profanity",
        "priest",
        "ouija board",
        "satan",
        "paranormal phenomena",
        "girl",
        "demon",
        "strong language",
        "disturbed child",
        "crisis of faith",
        "sfx"
      ],
      "user_rating": 7.5,
      "votes": 2005,
      "release_year": 1973,
      "overview": "12-year-old Regan MacNeil begins to adapt an explicit new personality as strange events befall the local area of Georgetown. Her mother becomes torn between science and superstition in a desperate bid to save her daughter, and ultimately turns to her last hope: Father Damien Karras, a troubled priest who is struggling with his own faith.",
      "runtime": 122
    },
    {
      "name": "Mrs. Doubtfire",
      "size": 441286195,
      "keywords": [
        "san francisco",
        "parents kids relationship",
        "restaurant",
        "nanny",
        "mask",
        "custody battle",
        "fake identity"
      ],
      "user_rating": 7,
      "votes": 1591,
      "release_year": 1993,
      "overview": "Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as an English nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.",
      "runtime": 125
    },
    {
      "name": "Cast Away",
      "size": 429632142,
      "keywords": [
        "exotic island",
        "suicide attempt",
        "volleyball",
        "loneliness",
        "airplane crash",
        "deserted island",
        "tropical island",
        "survival skills"
      ],
      "user_rating": 7.5,
      "votes": 3218,
      "release_year": 2000,
      "overview": "Chuck, a top international manager for FedEx, and Kelly, a Ph.D. student, are in love and heading towards marriage. Then Chuck's plane to Malaysia ditches at sea during a terrible storm. He's the only survivor, and he washes up on a tiny island with nothing but some flotsam and jetsam from the aircraft's cargo.",
      "runtime": 143
    },
    {
      "name": "Django Unchained",
      "size": 425368238,
      "keywords": [
        "bounty hunter",
        "hero",
        "plantation",
        "society",
        "friendship",
        "friends",
        "revenge",
        "rivalry",
        "rescue",
        "shootout",
        "racism",
        "danger",
        "dentist",
        "django",
        "dual role",
        "aftercreditsstinger",
        "odd couple",
        "black slave",
        "deadly",
        "chases and races",
        "19th century"
      ],
      "user_rating": 7.8,
      "votes": 10099,
      "release_year": 2012,
      "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "runtime": 165
    },
    {
      "name": "Dances with Wolves",
      "size": 424208848,
      "keywords": [
        "countryside",
        "based on novel",
        "suicide attempt",
        "culture clash",
        "loss of family",
        "deserter",
        "interpreter",
        "language barrier",
        "self-discovery",
        "dakota",
        "buffalo",
        "chief",
        "unsociability",
        "freedom",
        "native american",
        "19th century",
        "lakota"
      ],
      "user_rating": 7.6,
      "votes": 1046,
      "release_year": 1990,
      "overview": "Wounded Civil War soldier, John Dunbar tries to commit suicide – and becomes a hero instead. As a reward, he's assigned to his dream post, a remote junction on the Western frontier, and soon makes unlikely friends with the local Sioux tribe.",
      "runtime": 181
    },
    {
      "name": "The King's Speech",
      "size": 414211549,
      "keywords": [
        "great britain",
        "radio",
        "monarchy",
        "radio transmission",
        "royal family",
        "speech",
        "marriage",
        "royalty",
        "death of father"
      ],
      "user_rating": 7.6,
      "votes": 2752,
      "release_year": 2010,
      "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
      "runtime": 118
    },
    {
      "name": "Rain Man",
      "size": 412800000,
      "keywords": [
        "individual",
        "mentally disabled",
        "autism",
        "loss of father",
        "yuppie",
        "car dealer",
        "egocentrism",
        "travel",
        "convertible",
        "psychiatrist",
        "duringcreditsstinger",
        "savant"
      ],
      "user_rating": 7.6,
      "votes": 1709,
      "release_year": 1988,
      "overview": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country.",
      "runtime": 133
    },
    {
      "name": "The Bodyguard",
      "size": 411006740,
      "keywords": [
        "sister sister relationship",
        "anonymous letter",
        "diva",
        "bodyguard",
        "oscar award",
        "los angeles"
      ],
      "user_rating": 6.1,
      "votes": 661,
      "release_year": 1992,
      "overview": "A former Secret Service agent grudgingly takes an assignment to protect a pop idol who's threatened by a crazed fan. At first, the safety-obsessed bodyguard and the self-indulgent diva totally clash. But before long, all that tension sparks fireworks of another sort, and the love-averse tough guy is torn between duty and romance.",
      "runtime": 129
    },
    {
      "name": "Signs",
      "size": 408247917,
      "keywords": [
        "symbolism",
        "water",
        "farm",
        "faith",
        "alien",
        "family relationships",
        "rural setting",
        "alien invasion",
        "rural",
        "crop circle",
        "alien attack",
        "rural pennsylvania",
        "rural america",
        "rural farm",
        "loss of faith",
        "alien encounter"
      ],
      "user_rating": 6.4,
      "votes": 1599,
      "release_year": 2002,
      "overview": "A family living on a farm finds mysterious crop circles in their fields which suggests something more frightening to come.",
      "runtime": 106
    },
    {
      "name": "Gone with the Wind",
      "size": 400176459,
      "keywords": [
        "life and death",
        "civil war",
        "southern usa",
        "loss of child",
        "marriage proposal",
        "atlanta",
        "luxury",
        "plantation",
        "typhus",
        "business woman",
        "marriage crisis"
      ],
      "user_rating": 7.7,
      "votes": 970,
      "release_year": 1939,
      "overview": "An American classic in which a manipulative woman and a roguish man carry on a turbulent love affair in the American south during the Civil War and Reconstruction.",
      "runtime": 238
    },
    {
      "name": "Snow White and the Huntsman",
      "size": 396600000,
      "keywords": [
        "queen",
        "magic",
        "fairy tale",
        "immortality",
        "forest",
        "deception",
        "woman",
        "eternal youth",
        "snow white",
        "evil queen",
        "evil stepmother",
        "imprisoned",
        "sorceress"
      ],
      "user_rating": 5.8,
      "votes": 3118,
      "release_year": 2012,
      "overview": "After the Evil Queen marries the King, she performs a violent coup in which the King is murdered and his daughter, Snow White, is taken captive. Almost a decade later, a grown Snow White is still in the clutches of the Queen. In order to obtain immortality, The Evil Queen needs the heart of Snow White. After Snow escapes the castle, the Queen sends the Huntsman to find her in the Dark Forest.",
      "runtime": 127
    },
    {
      "name": "Twilight",
      "size": 392616625,
      "keywords": [
        "soulmates",
        "vampire",
        "forbidden love",
        "immortality",
        "trust",
        "desire",
        "duringcreditsstinger",
        "woman director",
        "interspecies romance",
        "based on young adult novel",
        "fang vamp"
      ],
      "user_rating": 5.8,
      "votes": 3561,
      "release_year": 2008,
      "overview": "When Bella Swan moves to a small town in the Pacific Northwest to live with her father, she starts school and meets the reclusive Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't help but fall in love with him, a fatal move that endangers her own life when a coven of bloodsuckers try to challenge the Cullen clan.",
      "runtime": 122
    },
    {
      "name": "The Wolf of Wall Street",
      "size": 392000694,
      "keywords": [
        "corruption",
        "sex",
        "sexuality",
        "bank",
        "humor",
        "biography",
        "wall street",
        "marriage crisis",
        "rise and fall",
        "stockbroker",
        "drug",
        "stock broker"
      ],
      "user_rating": 7.9,
      "votes": 6571,
      "release_year": 2013,
      "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
      "runtime": 180
    },
    {
      "name": "Slumdog Millionaire",
      "size": 377910544,
      "keywords": [
        "slum",
        "indian lead",
        "cheating",
        "suspicion",
        "game show",
        "orphan",
        "duringcreditsstinger"
      ],
      "user_rating": 7.6,
      "votes": 2827,
      "release_year": 2008,
      "overview": "Jamal Malik is an impoverished Indian teen who becomes a contestant on the Hindi version of ‘Who Wants to Be a Millionaire?’ but, after he wins, he is suspected of cheating.",
      "runtime": 120
    },
    {
      "name": "Batman Begins",
      "size": 374218673,
      "keywords": [
        "himalaya",
        "martial arts",
        "dc comics",
        "crime fighter",
        "secret identity",
        "undercover",
        "hero",
        "loss of father",
        "society",
        "gotham city",
        "vigilante",
        "superhero",
        "based on comic book",
        "rivalry",
        "tragic hero",
        "ninja",
        "good vs evil",
        "crime",
        "super powers",
        "haunted by the past",
        "evil doctor",
        "escapade",
        "master villain",
        "fighting crime",
        "unfulfillment",
        "love and romance",
        "unfulfilled love"
      ],
      "user_rating": 7.5,
      "votes": 7359,
      "release_year": 2005,
      "overview": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
      "runtime": 140
    },
    {
      "name": "Gone Girl",
      "size": 369330363,
      "keywords": [
        "based on novel",
        "marriage crisis",
        "disappearance",
        "cheating husband",
        "missing person",
        "search party",
        "criminal lawyer",
        "wife murder",
        "murder suspect",
        "missing wife"
      ],
      "user_rating": 7.9,
      "votes": 5862,
      "release_year": 2014,
      "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
      "runtime": 145
    },
    {
      "name": "My Big Fat Greek Wedding",
      "size": 368744044,
      "keywords": [
        "usa",
        "parents kids relationship",
        "greece",
        "culture clash",
        "midlife crisis",
        "restaurant",
        "bad mother-in-law",
        "mother-in-law",
        "parents-in-law",
        "son-in-law",
        "father-in-law",
        "patriarch",
        "bad father-in-law",
        "greek",
        "wedding",
        "family",
        "xenophobia"
      ],
      "user_rating": 6.2,
      "votes": 671,
      "release_year": 2002,
      "overview": "A young Greek woman falls in love with a non-Greek and struggles to get her family to accept him while she comes to terms with her heritage and cultural identity.",
      "runtime": 95
    },
    {
      "name": "Hitch",
      "size": 368100420,
      "keywords": [
        "speed date",
        "romantic comedy",
        "dating"
      ],
      "user_rating": 6.4,
      "votes": 1665,
      "release_year": 2005,
      "overview": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships.",
      "runtime": 118
    },
    {
      "name": "Notting Hill",
      "size": 363889678,
      "keywords": [
        "london england",
        "bookshop",
        "birthday",
        "new love",
        "film maker",
        "paparazzi",
        "press conference",
        "wheelchair",
        "bath tub",
        "cohabitant",
        "friendship",
        "fame",
        "celebration",
        "movie star",
        "spectacle"
      ],
      "user_rating": 7,
      "votes": 1262,
      "release_year": 1999,
      "overview": "The British comedy from director Roger Michell tells the love story between a famous actress and a simple book seller from London. A look into the attempt for famous people to have a personal and private life and the ramifications that follow. Nominated for three Golden Globes in 2000.",
      "runtime": 124
    },
    {
      "name": "Noah",
      "size": 362637473,
      "keywords": [
        "bible",
        "god",
        "noah",
        "3d"
      ],
      "user_rating": 5.6,
      "votes": 2350,
      "release_year": 2014,
      "overview": "A man who suffers visions of an apocalyptic deluge takes measures to protect his family from the coming flood.",
      "runtime": 139
    },
    {
      "name": "American Beauty",
      "size": 356296601,
      "keywords": [
        "male nudity",
        "female nudity",
        "adultery",
        "midlife crisis",
        "coming out",
        "first time",
        "camcorder",
        "virgin",
        "nudity",
        "film maker",
        "estate agent",
        "satire",
        "loneliness",
        "dark comedy",
        "suburbia",
        "coming of age",
        "marijuana",
        "exercise",
        "parent child relationship",
        "bittersweet",
        "affair"
      ],
      "user_rating": 7.9,
      "votes": 3313,
      "release_year": 1999,
      "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
      "runtime": 122
    },
    {
      "name": "Apollo 13",
      "size": 355237933,
      "keywords": [
        "moon",
        "florida",
        "nasa",
        "spaceman",
        "race against time",
        "houston",
        "based on true story",
        "space",
        "rescue",
        "survival",
        "disaster",
        "explosion",
        "astronaut",
        "imax",
        "saturn v rocket",
        "courage",
        "hypothermia",
        "apollo program",
        "cape kennedy",
        "lunar mission",
        "spacecraft accident"
      ],
      "user_rating": 7.3,
      "votes": 1599,
      "release_year": 1995,
      "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1971, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
      "runtime": 140
    },
    {
      "name": "Catch Me If You Can",
      "size": 352114312,
      "keywords": [
        "con man",
        "biography",
        "fbi agent",
        "overhead camera shot",
        "attempted jailbreak",
        "engagement party",
        "mislaid trust",
        "bank fraud",
        "inspired by a true story"
      ],
      "user_rating": 7.7,
      "votes": 3795,
      "release_year": 2002,
      "overview": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
      "runtime": 141
    },
    {
      "name": "The Great Gatsby",
      "size": 351040419,
      "keywords": [
        "based on novel",
        "infidelity",
        "obsession",
        "hope",
        "3d"
      ],
      "user_rating": 7.3,
      "votes": 3769,
      "release_year": 2013,
      "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
      "runtime": 143
    },
    {
      "name": "Pocahontas",
      "size": 346079773,
      "keywords": [
        "culture clash",
        "settler",
        "forbidden love",
        "colony",
        "musical",
        "gold rush",
        "princess",
        "romance",
        "native american",
        "animation",
        "virginia",
        "star crossed lovers",
        "reference to pizarro",
        "jamestown virginia",
        "pug dog",
        "cross cultural relationship",
        "musket",
        "animate tree",
        "indian chief",
        "based on folk tale",
        "17th century",
        "shamanism",
        "songs",
        "indians vs. settlers",
        "animal sidekick",
        "powhatan",
        "land claim"
      ],
      "user_rating": 6.7,
      "votes": 1457,
      "release_year": 1995,
      "overview": "History comes gloriously to life in Disney's epic animated tale about love and adventure in the New World. Pocahontas is a Native American woman whose father has arranged for her to marry her village's best warrior. But a vision tells her change is coming, and soon she comes face to face with it in the form of Capt. John Smith.",
      "runtime": 81
    },
    {
      "name": "The Curious Case of Benjamin Button",
      "size": 333932083,
      "keywords": [
        "diary",
        "navy",
        "funeral",
        "tea",
        "travel",
        "hospital"
      ],
      "user_rating": 7.3,
      "votes": 3292,
      "release_year": 2008,
      "overview": "Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences.",
      "runtime": 166
    },
    {
      "name": "Black Swan",
      "size": 327803731,
      "keywords": [
        "dancing",
        "competition",
        "sex",
        "dancer",
        "obsession",
        "paranoia",
        "insanity",
        "suspense",
        "ballet",
        "new york city",
        "heartbreak",
        "mental illness",
        "madness",
        "swan lake",
        "ballerina",
        "body horror"
      ],
      "user_rating": 7.3,
      "votes": 4430,
      "release_year": 2010,
      "overview": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.",
      "runtime": 108
    },
    {
      "name": "The Devil Wears Prada",
      "size": 326551094,
      "keywords": [
        "paris",
        "journalist",
        "journalism",
        "world of fasion",
        "fashion journal",
        "assistant",
        "job entrant",
        "job interview",
        "editor-in-chief"
      ],
      "user_rating": 7,
      "votes": 3088,
      "release_year": 2006,
      "overview": "The Devil Wears Prada is about a young journalist who moves to New York to work in the fashion industry. Her boss however is extremely demanding and cruel and won’t let her succeed if she doesn’t fit into the high class elegant look of their magazine when all she really wants to be a good journalist.",
      "runtime": 109
    },
    {
      "name": "The Perfect Storm",
      "size": 325756637,
      "keywords": [
        "u.s. air force",
        "grocery",
        "jamaican",
        "meteorologist",
        "rescue boat",
        "marina",
        "city hall",
        "the flemish cap",
        "male camaraderie",
        "storm at sea"
      ],
      "user_rating": 6.2,
      "votes": 597,
      "release_year": 2000,
      "overview": "In October 1991, a confluence of weather conditions combined to form a killer storm in the North Atlantic. Caught in the storm was the sword-fishing boat Andrea Gail. Magnificent foreshadowing and anticipation fill this true-life drama while minute details of the fishing boats, their gear and the weather are juxtaposed with the sea adventure.",
      "runtime": 130
    },
    {
      "name": "A Christmas Carol",
      "size": 325233863,
      "keywords": [
        "holiday",
        "based on novel",
        "victorian england",
        "money",
        "christmas eve",
        "scrooge",
        "christmas carol",
        "ghost",
        "lesson",
        "charles dickens",
        "christmas"
      ],
      "user_rating": 6.6,
      "votes": 1095,
      "release_year": 2009,
      "overview": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
      "runtime": 96
    },
    {
      "name": "Schindler's List",
      "size": 321365567,
      "keywords": [
        "factory",
        "concentration camp",
        "hero",
        "holocaust",
        "world war ii",
        "nazis",
        "defense industry",
        "biography",
        "the holocaust"
      ],
      "user_rating": 8.3,
      "votes": 4329,
      "release_year": 1993,
      "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
      "runtime": 195
    },
    {
      "name": "Fatal Attraction",
      "size": 320145693,
      "keywords": [
        "sexual obsession",
        "wife husband relationship",
        "deceived wife",
        "marriage crisis",
        "suspense",
        "lawyer",
        "extramarital affair",
        "erotic movie"
      ],
      "user_rating": 6.6,
      "votes": 291,
      "release_year": 1987,
      "overview": "A married man's one night stand comes back to haunt him when that lover begins to stalk him and his family.",
      "runtime": 119
    },
    {
      "name": "Inglourious Basterds",
      "size": 319131050,
      "keywords": [
        "paris",
        "guerrilla",
        "cinema",
        "self sacrifice",
        "dynamite",
        "mexican standoff",
        "world war ii",
        "jew persecution",
        "jew",
        "nazis",
        "masochism",
        "sadism",
        "scalp",
        "winston churchill",
        "knife in hand",
        "anti semitism",
        "gore",
        "swastika",
        "blood bath",
        "german occupation of france",
        "violence",
        "gun violence"
      ],
      "user_rating": 7.9,
      "votes": 6430,
      "release_year": 2009,
      "overview": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
      "runtime": 153
    },
    {
      "name": "The Proposal",
      "size": 317375031,
      "keywords": [
        "fictitious marriage",
        "deportation",
        "immigration law",
        "romantic comedy",
        "alaska",
        "naked scene",
        "co-worker",
        "humiliation",
        "book editor",
        "fake boyfriend",
        "duringcreditsstinger",
        "woman director",
        "pretend relationship"
      ],
      "user_rating": 6.7,
      "votes": 1804,
      "release_year": 2009,
      "overview": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
      "runtime": 108
    },
    {
      "name": "A Beautiful Mind",
      "size": 313542341,
      "keywords": [
        "individual",
        "schizophrenia",
        "massachusetts",
        "love of one's life",
        "intelligence",
        "mathematician",
        "market economy",
        "economic theory",
        "princeton university",
        "nobel prize",
        "mathematical theorem",
        "m.i.t.",
        "mathematics",
        "delusion"
      ],
      "user_rating": 7.7,
      "votes": 3009,
      "release_year": 2001,
      "overview": "At Princeton University, John Nash struggles to make a worthwhile contribution to serve as his legacy to the world of mathematics. He finally makes a revolutionary breakthrough that will eventually earn him the Nobel Prize. After graduate school he turns to teaching, becoming romantically involved with his student Alicia. Meanwhile the government asks his help with breaking Soviet codes, which soon gets him involved in a terrifying conspiracy plot. Nash grows more and more paranoid until a discovery that turns his entire world upside down. Now it is only with Alicia's help that he will be able to recover his mental strength and regain his status as the great mathematician we know him as today..",
      "runtime": 135
    },
    {
      "name": "The Blind Side",
      "size": 309208309,
      "keywords": [
        "american football",
        "adoption",
        "education",
        "private school",
        "sport",
        "american football player",
        "duringcreditsstinger"
      ],
      "user_rating": 7.2,
      "votes": 1597,
      "release_year": 2009,
      "overview": "Oversized African-American, Michael Oher, the teen from across the tracks and a broken home, has nowhere to sleep at age 16. Taken in by an affluent Memphis couple, Michael embarks on a remarkable rise to play for the NFL.",
      "runtime": 129
    },
    {
      "name": "The Fault in Our Stars",
      "size": 307166834,
      "keywords": [
        "amsterdam",
        "based on novel",
        "support group",
        "cancer",
        "teenager",
        "star crossed lovers",
        "teen drama",
        "oxygen tank",
        "based on young adult novel"
      ],
      "user_rating": 7.6,
      "votes": 3759,
      "release_year": 2014,
      "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
      "runtime": 125
    },
    {
      "name": "The Pursuit of Happyness",
      "size": 307077295,
      "keywords": [
        "san francisco",
        "single parent",
        "homeless person",
        "bus",
        "worker",
        "homelessness",
        "work",
        "church service",
        "bad luck",
        "biography",
        "salesman",
        "stockbroker"
      ],
      "user_rating": 7.7,
      "votes": 2525,
      "release_year": 2006,
      "overview": "The true story of Christopher Gardner, who invests heavily in a device known as a 'Bone Density Scanner', only to find himself struggle to sell the product as it's just marginally better than the current technology, and much more expensive. His wife leaves him,  he loses his house, bank account and credit cards and, now forced to live out in the streets with his young son,  he's desperate to find a steady job. He takes on a job as a stockbroker but, before he can receive pay, he needs to go through 6 months of training, and must sell his devices.",
      "runtime": 117
    },
    {
      "name": "Chicago",
      "size": 306776732,
      "keywords": [
        "chicago",
        "based on stage musical",
        "prison matron",
        "jazz age",
        "nude man murdered"
      ],
      "user_rating": 6.9,
      "votes": 677,
      "release_year": 2002,
      "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
      "runtime": 113
    },
    {
      "name": "Close Encounters of the Third Kind",
      "size": 303788635,
      "keywords": [
        "indiana",
        "obsession",
        "extraterrestrial technology",
        "evacuation",
        "blackout",
        "flying saucer",
        "secret base",
        "light",
        "contact",
        "beguilement",
        "exchange",
        "ufo",
        "alien",
        "vision",
        "missing person",
        "mother ship",
        "escapade",
        "obsessive quest",
        "life turned upside down"
      ],
      "user_rating": 7.2,
      "votes": 1098,
      "release_year": 1977,
      "overview": "After an encounter with UFOs, a line worker feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
      "runtime": 135
    },
    {
      "name": "Real Steel",
      "size": 299268508,
      "keywords": [
        "father son relationship",
        "fight",
        "sport",
        "robot",
        "prizefighting",
        "father son reunion",
        "robot fighting"
      ],
      "user_rating": 6.6,
      "votes": 2692,
      "release_year": 2011,
      "overview": "In the near-future, Charlie Kenton is a washed-up fighter who retired from the ring when robots took over the sport. After Charlie's robot is trashed, he reluctantly teams up with his estranged son Max to rebuild and train an unlikely contender.",
      "runtime": 127
    },
    {
      "name": "Shutter Island",
      "size": 294804195,
      "keywords": [
        "based on novel",
        "island",
        "hurricane",
        "investigation",
        "psychiatric hospital",
        "u.s. marshal",
        "conspiracy theory",
        "1950s"
      ],
      "user_rating": 7.8,
      "votes": 6336,
      "release_year": 2010,
      "overview": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by his troubling visions and also by a mysterious doctor.",
      "runtime": 138
    },
    {
      "name": "The Departed",
      "size": 289847354,
      "keywords": [
        "undercover",
        "boston",
        "police",
        "friends",
        "mafia",
        "undercover cop",
        "mobster",
        "mole",
        "state police",
        "police training",
        "realtor"
      ],
      "user_rating": 7.9,
      "votes": 4339,
      "release_year": 2006,
      "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
      "runtime": 151
    },
    {
      "name": "The Bourne Supremacy",
      "size": 288500217,
      "keywords": [
        "berlin",
        "assassin",
        "based on novel",
        "amnesia",
        "sniper",
        "lie",
        "sequel",
        "suspense",
        "on the run",
        "shootout",
        "espionage",
        "violence",
        "foot chase",
        "car chase",
        "exploding house",
        "though guy",
        "one against many",
        "rail car",
        "dark past",
        "moscow",
        "hand to hand combat"
      ],
      "user_rating": 7.2,
      "votes": 2825,
      "release_year": 2004,
      "overview": "When a CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive.",
      "runtime": 108
    },
    {
      "name": "Sex and the City 2",
      "size": 288347692,
      "keywords": [],
      "user_rating": 5.4,
      "votes": 426,
      "release_year": 2010,
      "overview": "Carrie, Charlotte, and Miranda are all married now, but they're still up for a little fun in the sun. When Samantha gets the chance to visit one of the most extravagant vacation destinations on the planet and offers to bring them all along, they surmise that a women-only retreat may be the perfect excuse to eschew their responsibilities and remember what life was like before they decided to settle down.",
      "runtime": 146
    },
    {
      "name": "The Sound of Music",
      "size": 286214286,
      "keywords": [
        "resistance",
        "austria",
        "world war ii",
        "musical",
        "music competition",
        "salzburg",
        "based on play",
        "classic",
        "alps",
        "governess",
        "convent",
        "music contest",
        "novice",
        "puppet show",
        "nun in love",
        "nazi occupation",
        "1930s"
      ],
      "user_rating": 7.4,
      "votes": 941,
      "release_year": 1965,
      "overview": "Film adaptation of a classic Rodgers and Hammerstein musical based on a nun who becomes a governess for an Austrian family.",
      "runtime": 174
    },
    {
      "name": "Elysium",
      "size": 286140700,
      "keywords": [
        "dystopia",
        "space station",
        "class conflict"
      ],
      "user_rating": 6.4,
      "votes": 3439,
      "release_year": 2013,
      "overview": "In the year 2159, two classes of people exist: the very wealthy who live on a pristine man-made space station called Elysium, and the rest, who live on an overpopulated, ruined Earth. Secretary Rhodes (Jodie Foster), a hard line government ofﬁcial, will stop at nothing to enforce anti-immigration laws and preserve the luxurious lifestyle of the citizens of Elysium. That doesn’t stop the people of Earth from trying to get in, by any means they can. When unlucky Max (Matt Damon) is backed into a corner, he agrees to take on a daunting mission that, if successful, will not only save his life, but could bring equality to these polarized worlds.",
      "runtime": 109
    },
    {
      "name": "The Green Mile",
      "size": 284600000,
      "keywords": [
        "southern usa",
        "black people",
        "mentally disabled",
        "based on novel",
        "heal",
        "death row",
        "jail guard",
        "great depression",
        "prison guard",
        "electric chair",
        "magic realism",
        "healing",
        "death row inmate",
        "1930s"
      ],
      "user_rating": 8.2,
      "votes": 4048,
      "release_year": 1999,
      "overview": "A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cellblock's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.",
      "runtime": 189
    },
    {
      "name": "Bridget Jones's Diary",
      "size": 281929795,
      "keywords": [
        "holiday",
        "london england",
        "england",
        "alcohol",
        "sex",
        "lovesickness",
        "telecaster",
        "birthday",
        "christmas party",
        "news broadcast",
        "sexual frustration",
        "diary",
        "cigarette",
        "daughter",
        "mother daughter relationship",
        "lawyer",
        "reporter",
        "extramarital affair",
        "duringcreditsstinger",
        "woman director",
        "christmas"
      ],
      "user_rating": 6.5,
      "votes": 1356,
      "release_year": 2001,
      "overview": "A chaotic Bridget Jones meets a snobbish lawyer, and he soon enters her world of imperfections.",
      "runtime": 97
    },
    {
      "name": "Lincoln",
      "size": 275293450,
      "keywords": [
        "usa president",
        "speech",
        "battlefield",
        "family conflict",
        "mourning",
        "american civil war",
        "cultural conflict",
        "based on true events",
        "battle of gettysburg",
        "secession",
        "presidential cabinet",
        "gettysburg address",
        "conflagration",
        "ethical dilemma",
        "emancipation",
        "abraham lincoln"
      ],
      "user_rating": 6.7,
      "votes": 1429,
      "release_year": 2012,
      "overview": "A revealing drama that focuses on the 16th President's tumultuous final months in office. In a nation divided by war and the strong winds of change, Lincoln pursues a course of action designed to end the war, unite the country and abolish slavery. With the moral courage and fierce determination to succeed, his choices during this critical moment will change the fate of generations to come.",
      "runtime": 149
    },
    {
      "name": "Jerry Maguire",
      "size": 273552592,
      "keywords": [
        "stadium",
        "career",
        "sport",
        "sports agent"
      ],
      "user_rating": 6.7,
      "votes": 913,
      "release_year": 1996,
      "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
      "runtime": 139
    },
    {
      "name": "The Silence of the Lambs",
      "size": 272742922,
      "keywords": [
        "based on novel",
        "psychopath",
        "horror",
        "suspense",
        "serial killer",
        "psychological thriller",
        "cannibal",
        "fbi agent",
        "animal in cast credits",
        "cannibalism"
      ],
      "user_rating": 8.1,
      "votes": 4443,
      "release_year": 1991,
      "overview": "FBI trainee, Clarice Starling ventures into a maximum-security asylum to pick the diseased brain of Hannibal Lecter, a psychiatrist turned homicidal cannibal. Starling needs clues to help her capture a serial killer. but her Faustian relationship with Lecter soon leads to his escape, and now two deranged killers are on the loose.",
      "runtime": 119
    },
    {
      "name": "The Firm",
      "size": 270248367,
      "keywords": [
        "fbi",
        "law",
        "tennessee",
        "lawyer",
        "law firm",
        "bar exam"
      ],
      "user_rating": 6.6,
      "votes": 501,
      "release_year": 1993,
      "overview": "Mitch McDeere is a young man with a promising future in Law. About to sit his Bar exam, he is approached by 'The Firm' and made an offer he doesn't refuse. Seduced by the money and gifts showered on him, he is totally oblivious to the more sinister side of his company. Then, two Associates are murdered. The FBI contact him, asking him for information and suddenly his life is ruined. He has a choice - work with the FBI, or stay with the Firm. Either way he will lose his life as he knows it. Mitch figures the only way out is to follow his own plan...",
      "runtime": 154
    },
    {
      "name": "Gran Torino",
      "size": 269958228,
      "keywords": [
        "rape",
        "war veteran",
        "immigration",
        "priest",
        "gang",
        "old man",
        "teenager",
        "gangster",
        "detroit",
        "widower",
        "car",
        "hmong"
      ],
      "user_rating": 7.8,
      "votes": 3086,
      "release_year": 2008,
      "overview": "Walt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy old man who can't get along with either his kids or his neighbors. He is a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood.",
      "runtime": 116
    },
    {
      "name": "Exodus: Gods and Kings",
      "size": 268031828,
      "keywords": [
        "moses",
        "bible",
        "ancient egypt",
        "3d",
        "ramses"
      ],
      "user_rating": 5.6,
      "votes": 1921,
      "release_year": 2014,
      "overview": "The defiant leader Moses rises up against the Egyptian Pharaoh Ramses, setting 400,000 slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.",
      "runtime": 150
    },
    {
      "name": "Bambi",
      "size": 267447150,
      "keywords": [
        "forest",
        "coming of age",
        "best friend",
        "loss of loved one"
      ],
      "user_rating": 6.8,
      "votes": 1405,
      "release_year": 1942,
      "overview": "Bambi's tale unfolds from season to season as the young prince of the forest learns about life, love, and friends.",
      "runtime": 70
    },
    {
      "name": "Something's Gotta Give",
      "size": 266728738,
      "keywords": [
        "age difference",
        "ladykiller",
        "woman director"
      ],
      "user_rating": 6.3,
      "votes": 410,
      "release_year": 2003,
      "overview": "Harry Sanborn is an aged music industry exec with a fondness for younger women like Marin, his latest trophy girlfriend. Things get a little awkward when Harry suffers a heart attack at the home of Marin's mother, Erica. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
      "runtime": 128
    },
    {
      "name": "American Gangster",
      "size": 266465037,
      "keywords": [
        "underdog",
        "black people",
        "drug traffic",
        "drug smuggle",
        "society",
        "ambition",
        "rise and fall",
        "cop",
        "drug dealing",
        "police corruption",
        "gangster",
        "crime",
        "police detective",
        "family",
        "law enforcement",
        "aftercreditsstinger",
        "dishonesty",
        "criminal heroes"
      ],
      "user_rating": 7.4,
      "votes": 1502,
      "release_year": 2007,
      "overview": "Following the death of his employer and mentor, Bumpy Johnson, Frank Lucas establishes himself as the number one importer of heroin in the Harlem district of Manhattan. He does so by buying heroin directly from the source in South East Asia and he comes up with a unique way of importing the drugs into the United States. Based on a true story.",
      "runtime": 157
    },
    {
      "name": "The Truman Show",
      "size": 264118201,
      "keywords": [
        "claustrophobia",
        "hidden camera",
        "dystopia",
        "reality show",
        "make believe",
        "pretend"
      ],
      "user_rating": 7.8,
      "votes": 4537,
      "release_year": 1998,
      "overview": "Truman Burbank is the star of \"The Truman Show\", a 24-hour-a-day \"reality\" TV show that broadcasts every aspect of his life -- live and in color -- without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows -- including his wife and his best friend -- is really an actor, paid to be part of his life.",
      "runtime": 103
    },
    {
      "name": "The Village",
      "size": 256697520,
      "keywords": [
        "secret",
        "forest",
        "rural setting",
        "blindness",
        "courtship",
        "mentally handicapped man",
        "human nature",
        "aura",
        "romantic",
        "village council"
      ],
      "user_rating": 6.2,
      "votes": 1071,
      "release_year": 2004,
      "overview": "When a willful young man tries to venture beyond his sequestered Pennsylvania hamlet, his actions set off a chain of chilling incidents that will alter the community forever.",
      "runtime": 108
    },
    {
      "name": "Erin Brockovich",
      "size": 256271286,
      "keywords": [
        "biography",
        "based on true story",
        "single mother",
        "water pollution",
        "environmental law"
      ],
      "user_rating": 7.1,
      "votes": 716,
      "release_year": 2000,
      "overview": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
      "runtime": 131
    },
    {
      "name": "Four Weddings and a Funeral",
      "size": 254700832,
      "keywords": [
        "upper class",
        "love at first sight",
        "wedding vows",
        "marriage proposal",
        "yuppie",
        "love of one's life",
        "lone wolf",
        "snob",
        "witness",
        "bride",
        "bridegroom",
        "bridesmaid",
        "funeral",
        "clumsy fellow",
        "friendship",
        "wedding",
        "gay couple"
      ],
      "user_rating": 6.6,
      "votes": 632,
      "release_year": 1994,
      "overview": "Four Weddings And A Funeral is a British comedy about a British Man named Charles and an American Woman named Carrie who go through numerous weddings before they determine if they are right for one another.",
      "runtime": 117
    },
    {
      "name": "Babe",
      "size": 254134910,
      "keywords": [
        "sheep",
        "pig",
        "affection",
        "piglet",
        "heroism",
        "talking animal",
        "separation",
        "german shepherd",
        "grandson",
        "talking pig"
      ],
      "user_rating": 6,
      "votes": 733,
      "release_year": 1995,
      "overview": "Babe is a little pig who doesn't quite know his place in the world. With a bunch of odd friends, like Ferdinand the duck who thinks he is a rooster and Fly the dog he calls mom, Babe realizes that he has the makings to become the greatest sheep pig of all time, and Farmer Hogget knows it. With the help of the sheep dogs Babe learns that a pig can be anything that he wants to be.",
      "runtime": 89
    },
    {
      "name": "True Grit",
      "size": 252276927,
      "keywords": [
        "loss of father",
        "father murder",
        "texas ranger",
        "alcoholism",
        "betrayal"
      ],
      "user_rating": 7.2,
      "votes": 1668,
      "release_year": 2010,
      "overview": "Following the murder of her father by hired hand Tom Chaney, 14-year-old farm girl Mattie Ross sets out to capture the killer. To aid her, she hires the toughest U.S. Marshal she can find, a man with \"true grit,\" Reuben J. \"Rooster\" Cogburn. Mattie insists on accompanying Cogburn, whose drinking, sloth, and generally reprobate character do not augment her faith in him. Against his wishes, she joins him in his trek into the Indian Nations in search of Chaney. They are joined by Texas Ranger LaBoeuf, who wants Chaney for his own purposes. The unlikely trio find danger and adventure on the journey, and each has his or her \"grit\" tested.",
      "runtime": 110
    },
    {
      "name": "American Hustle",
      "size": 251171807,
      "keywords": [
        "con artist",
        "scam",
        "mobster",
        "fbi agent"
      ],
      "user_rating": 6.8,
      "votes": 2807,
      "release_year": 2013,
      "overview": "A con man, Irving Rosenfeld, along with his seductive partner Sydney Prosser, is forced to work for a wild FBI agent, Richie DiMaso, who pushes them into a world of Jersey powerbrokers and mafia.",
      "runtime": 138
    },
    {
      "name": "Enemy of the State",
      "size": 250649836,
      "keywords": [
        "corruption",
        "washington d.c.",
        "helicopter",
        "falsely accused",
        "identity",
        "mexican standoff",
        "blackmail",
        "intelligence",
        "wiretap",
        "satellite",
        "national security agency (nsa)",
        "politics",
        "exploding building",
        "suspense",
        "mystery",
        "mafia",
        "conspiracy",
        "lawyer",
        "crime",
        "privacy",
        "surveillance",
        "baltimore maryland",
        "secret hideout"
      ],
      "user_rating": 6.7,
      "votes": 1240,
      "release_year": 1998,
      "overview": "Hotshot Washington lawyer, Robert Dean becomes a victim of high-tech identity theft when a hacker slips an incriminating video into his pocket. Soon, a rogue National Security agent sets out to recover the tape – and destroy Dean.",
      "runtime": 132
    }
  ],
  "links": [
    {
      "source": "Titanic",
      "target": "Apollo 13",
      "value": 2
    },
    {
      "source": "The Dark Knight Rises",
      "target": "The Dark Knight",
      "value": 9
    },
    {
      "source": "The Dark Knight Rises",
      "target": "Batman Begins",
      "value": 7
    },
    {
      "source": "The Dark Knight",
      "target": "Batman Begins",
      "value": 9
    },
    {
      "source": "The Jungle Book",
      "target": "The Revenant",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "The Twilight Saga: New Moon",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "The Twilight Saga: Eclipse",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "Twilight",
      "value": 2
    },
    {
      "source": "Gravity",
      "target": "Interstellar",
      "value": 2
    },
    {
      "source": "Gravity",
      "target": "The Martian",
      "value": 2
    },
    {
      "source": "Gravity",
      "target": "Apollo 13",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Interstellar",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "I Am Legend",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Rise of the Planet of the Apes",
      "value": 4
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "The Twilight Saga: Eclipse",
      "value": 3
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "Twilight",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Eclipse",
      "target": "Twilight",
      "value": 3
    },
    {
      "source": "Forrest Gump",
      "target": "The Bourne Ultimatum",
      "value": 2
    },
    {
      "source": "Forrest Gump",
      "target": "The Green Mile",
      "value": 2
    },
    {
      "source": "Interstellar",
      "target": "The Martian",
      "value": 4
    },
    {
      "source": "Interstellar",
      "target": "I Am Legend",
      "value": 2
    },
    {
      "source": "Interstellar",
      "target": "Apollo 13",
      "value": 7
    },
    {
      "source": "Interstellar",
      "target": "Real Steel",
      "value": 2
    },
    {
      "source": "Interstellar",
      "target": "Elysium",
      "value": 2
    },
    {
      "source": "The Sixth Sense",
      "target": "Ghost",
      "value": 2
    },
    {
      "source": "The Sixth Sense",
      "target": "Gone with the Wind",
      "value": 2
    },
    {
      "source": "The Martian",
      "target": "The Revenant",
      "value": 2
    },
    {
      "source": "The Martian",
      "target": "Apollo 13",
      "value": 4
    },
    {
      "source": "Cinderella",
      "target": "Snow White and the Huntsman",
      "value": 3
    },
    {
      "source": "The Revenant",
      "target": "The Bourne Ultimatum",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "Dances with Wolves",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "Troy",
      "target": "Gladiator",
      "value": 2
    },
    {
      "source": "Saving Private Ryan",
      "target": "The Last Samurai",
      "value": 2
    },
    {
      "source": "Saving Private Ryan",
      "target": "Inglourious Basterds",
      "value": 2
    },
    {
      "source": "The Last Samurai",
      "target": "Dances with Wolves",
      "value": 3
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Inglourious Basterds",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "The Bourne Supremacy",
      "value": 8
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Enemy of the State",
      "value": 2
    },
    {
      "source": "Mrs. Doubtfire",
      "target": "My Big Fat Greek Wedding",
      "value": 2
    },
    {
      "source": "Django Unchained",
      "target": "Batman Begins",
      "value": 3
    },
    {
      "source": "Django Unchained",
      "target": "American Gangster",
      "value": 2
    },
    {
      "source": "Dances with Wolves",
      "target": "Pocahontas",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "The Wolf of Wall Street",
      "target": "The Pursuit of Happyness",
      "value": 2
    },
    {
      "source": "Batman Begins",
      "target": "American Gangster",
      "value": 2
    },
    {
      "source": "Notting Hill",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Noah",
      "target": "Exodus: Gods and Kings",
      "value": 2
    },
    {
      "source": "A Christmas Carol",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Schindler's List",
      "target": "Inglourious Basterds",
      "value": 2
    },
    {
      "source": "Fatal Attraction",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Fatal Attraction",
      "target": "Enemy of the State",
      "value": 2
    },
    {
      "source": "The Proposal",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "The Bourne Supremacy",
      "target": "The Silence of the Lambs",
      "value": 2
    }
  ]
}