{
  "nodes": [
    {
      "name": "Titanic",
      "size": 1845034188,
      "keywords": [
        "shipwreck",
        "iceberg",
        "ship",
        "panic",
        "titanic",
        "ocean liner",
        "epic",
        "rich woman - poor man",
        "love",
        "disaster",
        "tragic love",
        "class differences",
        "imax",
        "star crossed lovers",
        "steerage",
        "salvage",
        "rich snob",
        "3d",
        "1910s"
      ],
      "user_rating": 7.5,
      "votes": 7562,
      "release_year": 1997,
      "overview": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "runtime": 194
    },
    {
      "name": "The Twilight Saga: Breaking Dawn - Part 2",
      "size": 829000000,
      "keywords": [
        "vampire",
        "romance",
        "villainess",
        "super strength",
        "imprinting",
        "cross breed",
        "bloodsucker",
        "grudge",
        "vampire vs vampire",
        "chief of police",
        "dhampir",
        "forks washington",
        "wolf pack",
        "misinformation",
        "seeing the future",
        "fang vamp"
      ],
      "user_rating": 6.1,
      "votes": 2553,
      "release_year": 2012,
      "overview": "After the birth of Renesmee, the Cullens gather other vampire clans in order to protect the child from a false allegation that puts the family in front of the Volturi.",
      "runtime": 115
    },
    {
      "name": "Maleficent",
      "size": 758539785,
      "keywords": [
        "fairy tale",
        "villain",
        "sleeping beauty",
        "dark fantasy",
        "based on fairy tale",
        "adaptation",
        "retelling",
        "literary adaptation",
        "3d"
      ],
      "user_rating": 7,
      "votes": 4496,
      "release_year": 2014,
      "overview": "The untold story of Disney's most iconic villain from the 1959 classic 'Sleeping Beauty'. A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land.  Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and to Maleficent's true happiness as well.",
      "runtime": 97
    },
    {
      "name": "The Twilight Saga: New Moon",
      "size": 709827462,
      "keywords": [
        "moon",
        "cinema",
        "vampire",
        "werewolf",
        "fang vamp"
      ],
      "user_rating": 5.6,
      "votes": 2436,
      "release_year": 2009,
      "overview": "Forks, Washington resident Bella Swan is reeling from the departure of her vampire love, Edward Cullen, and finds comfort in her friendship with Jacob Black, a werewolf. But before she knows it, she's thrust into a centuries-old conflict, and her desire to be with Edward at any cost leads her to take greater and greater risks.",
      "runtime": 130
    },
    {
      "name": "The Twilight Saga: Eclipse",
      "size": 698491347,
      "keywords": [
        "vampire",
        "graduation",
        "bite",
        "immortality",
        "werewolf",
        "fang vamp"
      ],
      "user_rating": 5.8,
      "votes": 2301,
      "release_year": 2010,
      "overview": "Bella once again finds herself surrounded by danger as Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob, knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella is confronted with the most important decision of her life.",
      "runtime": 124
    },
    {
      "name": "Forrest Gump",
      "size": 677945399,
      "keywords": [
        "vietnam veteran",
        "hippie",
        "mentally disabled",
        "running",
        "based on novel",
        "vietnam",
        "vietnam war",
        "friendship",
        "love",
        "family relationships",
        "bully",
        "mother son relationship",
        "military",
        "hugging",
        "shrimping",
        "wounded soldier",
        "flashback",
        "park bench",
        "amputee"
      ],
      "user_rating": 8.2,
      "votes": 7927,
      "release_year": 1994,
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
      "runtime": 142
    },
    {
      "name": "Mamma Mia!",
      "size": 609841637,
      "keywords": [
        "single parent",
        "greece",
        "musical",
        "daughter",
        "single",
        "mother daughter relationship",
        "duringcreditsstinger",
        "woman director"
      ],
      "user_rating": 6.4,
      "votes": 1386,
      "release_year": 2008,
      "overview": "Set on an idyllic Greek island, the plot serves as a background for a wealth of ABBA hit songs. Donna, an independent, single mother who owns a small hotel on the island is about to let go of Sophie, the spirited young daughter she's raised alone. But Sophie has secretly invited three of her mother's ex-lovers in the hopes of finding her father.",
      "runtime": 108
    },
    {
      "name": "Fifty Shades of Grey",
      "size": 571006128,
      "keywords": [
        "based on novel",
        "perversion",
        "spanking",
        "billionaire",
        "bdsm",
        "woman director"
      ],
      "user_rating": 5.2,
      "votes": 3254,
      "release_year": 2015,
      "overview": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
      "runtime": 125
    },
    {
      "name": "Cinderella",
      "size": 543514353,
      "keywords": [
        "cinderella",
        "magic",
        "prince",
        "fairy tale",
        "kingdom",
        "royalty",
        "orphan",
        "lost shoe",
        "evil stepmother",
        "retelling"
      ],
      "user_rating": 6.7,
      "votes": 2374,
      "release_year": 2015,
      "overview": "When her father unexpectedly passes away, young Ella finds herself at the mercy of her cruel stepmother and her daughters. Never one to give up hope, Ella's fortunes begin to change after meeting a dashing stranger in the woods.",
      "runtime": 105
    },
    {
      "name": "Meet the Fockers",
      "size": 516642939,
      "keywords": [
        "cia",
        "parents kids relationship",
        "florida",
        "anti-authoritarian upbringing",
        "jew",
        "parents-in-law",
        "orderly",
        "just married",
        "sex therapy",
        "bad father-in-law",
        "family",
        "illegitimate son"
      ],
      "user_rating": 6.1,
      "votes": 1373,
      "release_year": 2004,
      "overview": "Hard-to-crack ex-CIA man, Jack Byrnes and his wife, Dina head for the warmer climes of Florida to meet son-in-law-to-be, Greg Focker's parents. Unlike their happily matched offspring, the future in-laws find themselves in a situation of opposites that definitely do not attract.",
      "runtime": 115
    },
    {
      "name": "Ghost",
      "size": 505000000,
      "keywords": [
        "corruption",
        "fortune teller",
        "money transfer",
        "money laundering",
        "pottery",
        "afterlife",
        "spiritism"
      ],
      "user_rating": 6.9,
      "votes": 1339,
      "release_year": 1990,
      "overview": "Sam Wheat is a banker, Molly Jensen is an artist, and the two are madly in love. However, when Sam is murdered by his friend and corrupt business partner Carl Bruner over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown to set things right and protect Molly from Carl and his goons.",
      "runtime": 127
    },
    {
      "name": "Aladdin",
      "size": 504050219,
      "keywords": [
        "magic",
        "musical",
        "cartoon",
        "princess",
        "love",
        "comedy",
        "animation",
        "monkey",
        "arab",
        "aftercreditsstinger",
        "genie",
        "animal sidekick"
      ],
      "user_rating": 7.4,
      "votes": 3416,
      "release_year": 1992,
      "overview": "Princess Jasmine grows tired of being forced to remain in the palace and she sneaks out into the marketplace  in disguise where she meets street-urchin Aladdin and the two fall in love, although she may only marry a prince. After being thrown in jail, Aladdin and becomes embroiled in a plot to find a mysterious lamp with which the evil Jafar hopes to rule the land.",
      "runtime": 90
    },
    {
      "name": "Pretty Woman",
      "size": 463000000,
      "keywords": [
        "prostitute",
        "capitalism",
        "cinderella",
        "expensive restaurant",
        "sports car",
        "workaholic",
        "fire escape",
        "friendship",
        "los angeles",
        "piano"
      ],
      "user_rating": 7,
      "votes": 1746,
      "release_year": 1990,
      "overview": "When millionaire wheeler-dealer Edward Lewis enters a business contract with Hollywood hooker Vivian Ward, he loses his heart in the bargain in this charming romantic comedy. After Edward hires Vivian as his date for a week and gives her a Cinderella makeover, she returns the favor by mellowing the hardnosed tycoon's outlook. Can the poor prostitute and the rich capitalist live happily ever after?",
      "runtime": 119
    },
    {
      "name": "Pearl Harbor",
      "size": 449220945,
      "keywords": [
        "nurse",
        "patriotism",
        "hawaii",
        "world war ii",
        "pilot",
        "pearl harbor",
        "u.s. air force",
        "airplane",
        "war",
        "army",
        "love",
        "pin-up"
      ],
      "user_rating": 6.6,
      "votes": 1791,
      "release_year": 2001,
      "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
      "runtime": 183
    },
    {
      "name": "Les Misérables",
      "size": 441809770,
      "keywords": [
        "france",
        "robbery",
        "brothel",
        "mayor",
        "star",
        "musical",
        "arrest",
        "army",
        "rebellion",
        "wedding",
        "falling in love",
        "corpse",
        "parole",
        "convict",
        "girl disguised as boy"
      ],
      "user_rating": 7.1,
      "votes": 1884,
      "release_year": 2012,
      "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France, in which a paroled prisoner named Jean Valjean seeks redemption.",
      "runtime": 157
    },
    {
      "name": "The Bodyguard",
      "size": 411006740,
      "keywords": [
        "sister sister relationship",
        "anonymous letter",
        "diva",
        "bodyguard",
        "oscar award",
        "los angeles"
      ],
      "user_rating": 6.1,
      "votes": 661,
      "release_year": 1992,
      "overview": "A former Secret Service agent grudgingly takes an assignment to protect a pop idol who's threatened by a crazed fan. At first, the safety-obsessed bodyguard and the self-indulgent diva totally clash. But before long, all that tension sparks fireworks of another sort, and the love-averse tough guy is torn between duty and romance.",
      "runtime": 129
    },
    {
      "name": "Gone with the Wind",
      "size": 400176459,
      "keywords": [
        "life and death",
        "civil war",
        "southern usa",
        "loss of child",
        "marriage proposal",
        "atlanta",
        "luxury",
        "plantation",
        "typhus",
        "business woman",
        "marriage crisis"
      ],
      "user_rating": 7.7,
      "votes": 970,
      "release_year": 1939,
      "overview": "An American classic in which a manipulative woman and a roguish man carry on a turbulent love affair in the American south during the Civil War and Reconstruction.",
      "runtime": 238
    },
    {
      "name": "Twilight",
      "size": 392616625,
      "keywords": [
        "soulmates",
        "vampire",
        "forbidden love",
        "immortality",
        "trust",
        "desire",
        "duringcreditsstinger",
        "woman director",
        "interspecies romance",
        "based on young adult novel",
        "fang vamp"
      ],
      "user_rating": 5.8,
      "votes": 3561,
      "release_year": 2008,
      "overview": "When Bella Swan moves to a small town in the Pacific Northwest to live with her father, she starts school and meets the reclusive Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't help but fall in love with him, a fatal move that endangers her own life when a coven of bloodsuckers try to challenge the Cullen clan.",
      "runtime": 122
    },
    {
      "name": "Slumdog Millionaire",
      "size": 377910544,
      "keywords": [
        "slum",
        "indian lead",
        "cheating",
        "suspicion",
        "game show",
        "orphan",
        "duringcreditsstinger"
      ],
      "user_rating": 7.6,
      "votes": 2827,
      "release_year": 2008,
      "overview": "Jamal Malik is an impoverished Indian teen who becomes a contestant on the Hindi version of ‘Who Wants to Be a Millionaire?’ but, after he wins, he is suspected of cheating.",
      "runtime": 120
    },
    {
      "name": "What Women Want",
      "size": 374111707,
      "keywords": [
        "women",
        "telepathy",
        "supernatural powers",
        "advertising executive",
        "woman director"
      ],
      "user_rating": 6.1,
      "votes": 992,
      "release_year": 2000,
      "overview": "Advertising executive Nick Marshall is as cocky as they come, but what happens to a chauvinistic guy when he can suddenly hear what women are thinking? Nick gets passed over for a promotion, but after an accident enables him to hear women's thoughts, he puts his newfound talent to work against Darcy, his new boss, who seems to be infatuated with him.",
      "runtime": 127
    },
    {
      "name": "There's Something About Mary",
      "size": 369884651,
      "keywords": [
        "surgeon",
        "stalker",
        "romantic comedy",
        "dream girl",
        "taboo",
        "screwball comedy",
        "frisbee",
        "troubadour",
        "gross out comedy",
        "intellectual disability"
      ],
      "user_rating": 6.5,
      "votes": 1590,
      "release_year": 1998,
      "overview": "Having never fully recovered from a prom date that became a total disaster, a man finally gets a chance to reunite with his old prom date, only to run up against other suitors including the sleazy detective he hired to find her.",
      "runtime": 119
    },
    {
      "name": "My Big Fat Greek Wedding",
      "size": 368744044,
      "keywords": [
        "usa",
        "parents kids relationship",
        "greece",
        "culture clash",
        "midlife crisis",
        "restaurant",
        "bad mother-in-law",
        "mother-in-law",
        "parents-in-law",
        "son-in-law",
        "father-in-law",
        "patriarch",
        "bad father-in-law",
        "greek",
        "wedding",
        "family",
        "xenophobia"
      ],
      "user_rating": 6.2,
      "votes": 671,
      "release_year": 2002,
      "overview": "A young Greek woman falls in love with a non-Greek and struggles to get her family to accept him while she comes to terms with her heritage and cultural identity.",
      "runtime": 95
    },
    {
      "name": "Hitch",
      "size": 368100420,
      "keywords": [
        "speed date",
        "romantic comedy",
        "dating"
      ],
      "user_rating": 6.4,
      "votes": 1665,
      "release_year": 2005,
      "overview": "Dating coach Alex 'Hitch' Hitchens mentors a bumbling client, Albert, who hopes to win the heart of the glamorous Allegra Cole. While Albert makes progress, Hitch faces his own romantic setbacks when proven techniques fail to work on Sara Melas, a tabloid reporter digging for dirt on Allegra Cole's love life. When Sara discovers Hitch's connection to Albert – now Allegra's boyfriend – it threatens to destroy both relationships.",
      "runtime": 118
    },
    {
      "name": "Notting Hill",
      "size": 363889678,
      "keywords": [
        "london england",
        "bookshop",
        "birthday",
        "new love",
        "film maker",
        "paparazzi",
        "press conference",
        "wheelchair",
        "bath tub",
        "cohabitant",
        "friendship",
        "fame",
        "celebration",
        "movie star",
        "spectacle"
      ],
      "user_rating": 7,
      "votes": 1262,
      "release_year": 1999,
      "overview": "The British comedy from director Roger Michell tells the love story between a famous actress and a simple book seller from London. A look into the attempt for famous people to have a personal and private life and the ramifications that follow. Nominated for three Golden Globes in 2000.",
      "runtime": 124
    },
    {
      "name": "Top Gun",
      "size": 356830601,
      "keywords": [
        "lovesickness",
        "loss of lover",
        "fighter pilot",
        "self-discovery",
        "pilot",
        "ejection seat",
        "dying and death",
        "officer",
        "training camp",
        "air force",
        "airplane",
        "dangerous",
        "battle assignment",
        "u.s. navy",
        "hostility",
        "secret love",
        "cowardliness",
        "pilot school"
      ],
      "user_rating": 6.7,
      "votes": 1698,
      "release_year": 1986,
      "overview": "For Lieutenant Pete 'Maverick' Mitchell and his friend and Co-Pilot Nick 'Goose' Bradshaw being accepted into an elite training school for fighter pilots is a dream come true.  A tragedy, as well as personal demons, threaten Pete's dreams of becoming an Ace pilot.",
      "runtime": 110
    },
    {
      "name": "The Mask",
      "size": 351583407,
      "keywords": [
        "dual identity",
        "bank",
        "mockery",
        "green",
        "balloon",
        "jail cell",
        "norse mythology"
      ],
      "user_rating": 6.6,
      "votes": 2472,
      "release_year": 1994,
      "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
      "runtime": 101
    },
    {
      "name": "The Great Gatsby",
      "size": 351040419,
      "keywords": [
        "based on novel",
        "infidelity",
        "obsession",
        "hope",
        "3d"
      ],
      "user_rating": 7.3,
      "votes": 3769,
      "release_year": 2013,
      "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
      "runtime": 143
    },
    {
      "name": "Enchanted",
      "size": 340487652,
      "keywords": [
        "poison",
        "queen",
        "fairy tale",
        "musical",
        "princess",
        "portal",
        "animation",
        "fantasy world",
        "evil witch",
        "part animation"
      ],
      "user_rating": 6.6,
      "votes": 1449,
      "release_year": 2007,
      "overview": "The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a \"happily ever after\" basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?",
      "runtime": 107
    },
    {
      "name": "Prince of Persia: The Sands of Time",
      "size": 335154643,
      "keywords": [
        "persia",
        "sandstorm",
        "brother against brother",
        "armageddon",
        "regent",
        "based on video game"
      ],
      "user_rating": 6.2,
      "votes": 2317,
      "release_year": 2010,
      "overview": "A rogue prince reluctantly joins forces with a mysterious princess and together, they race against dark forces to safeguard an ancient dagger capable of releasing the Sands of Time – gift from the gods that can reverse time and allow its possessor to rule the world.",
      "runtime": 116
    },
    {
      "name": "The Curious Case of Benjamin Button",
      "size": 333932083,
      "keywords": [
        "diary",
        "navy",
        "funeral",
        "tea",
        "travel",
        "hospital"
      ],
      "user_rating": 7.3,
      "votes": 3292,
      "release_year": 2008,
      "overview": "Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences.",
      "runtime": 166
    },
    {
      "name": "Meet the Parents",
      "size": 330444045,
      "keywords": [
        "cia",
        "airport",
        "cat",
        "jew",
        "orderly",
        "airplane",
        "father-in-law",
        "epistaxis",
        "daughter",
        "lost baggage",
        "urn",
        "pavilion",
        "volleyball",
        "hospital",
        "wedding"
      ],
      "user_rating": 6.6,
      "votes": 1698,
      "release_year": 2000,
      "overview": "Greg Focker is ready to marry his girlfriend, Pam, but before he pops the question, he must win over her formidable father, humorless former CIA agent Jack Byrnes, at the wedding of Pam's sister. As Greg bends over backward to make a good impression, his visit to the Byrnes home turns into a hilarious series of disasters, and everything that can go wrong does, all under Jack's critical, hawklike gaze.",
      "runtime": 108
    },
    {
      "name": "The Devil Wears Prada",
      "size": 326551094,
      "keywords": [
        "paris",
        "journalist",
        "journalism",
        "world of fasion",
        "fashion journal",
        "assistant",
        "job entrant",
        "job interview",
        "editor-in-chief"
      ],
      "user_rating": 7,
      "votes": 3088,
      "release_year": 2006,
      "overview": "The Devil Wears Prada is about a young journalist who moves to New York to work in the fashion industry. Her boss however is extremely demanding and cruel and won’t let her succeed if she doesn’t fit into the high class elegant look of their magazine when all she really wants to be a good journalist.",
      "runtime": 109
    },
    {
      "name": "Fatal Attraction",
      "size": 320145693,
      "keywords": [
        "sexual obsession",
        "wife husband relationship",
        "deceived wife",
        "marriage crisis",
        "suspense",
        "lawyer",
        "extramarital affair",
        "erotic movie"
      ],
      "user_rating": 6.6,
      "votes": 291,
      "release_year": 1987,
      "overview": "A married man's one night stand comes back to haunt him when that lover begins to stalk him and his family.",
      "runtime": 119
    },
    {
      "name": "The Proposal",
      "size": 317375031,
      "keywords": [
        "fictitious marriage",
        "deportation",
        "immigration law",
        "romantic comedy",
        "alaska",
        "naked scene",
        "co-worker",
        "humiliation",
        "book editor",
        "fake boyfriend",
        "duringcreditsstinger",
        "woman director",
        "pretend relationship"
      ],
      "user_rating": 6.7,
      "votes": 1804,
      "release_year": 2009,
      "overview": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
      "runtime": 108
    },
    {
      "name": "As Good as It Gets",
      "size": 314178011,
      "keywords": [
        "single parent",
        "waitress",
        "lone wolf",
        "friendship",
        "neighbor",
        "author",
        "cowardliness",
        "writer",
        "dog",
        "rude",
        "obnoxious",
        "unlikely friendship",
        "noodle salad"
      ],
      "user_rating": 7.2,
      "votes": 915,
      "release_year": 1997,
      "overview": "New York City. Melvin Udall, a cranky, bigoted, obsessive-compulsive writer, finds his life turned upside down when neighboring gay artist Simon is hospitalized and his dog is entrusted to Melvin. In addition, Carol, the only waitress who will tolerate him, must leave work to care for her sick son, making it impossible for Melvin to eat breakfast.",
      "runtime": 139
    },
    {
      "name": "A Beautiful Mind",
      "size": 313542341,
      "keywords": [
        "individual",
        "schizophrenia",
        "massachusetts",
        "love of one's life",
        "intelligence",
        "mathematician",
        "market economy",
        "economic theory",
        "princeton university",
        "nobel prize",
        "mathematical theorem",
        "m.i.t.",
        "mathematics",
        "delusion"
      ],
      "user_rating": 7.7,
      "votes": 3009,
      "release_year": 2001,
      "overview": "At Princeton University, John Nash struggles to make a worthwhile contribution to serve as his legacy to the world of mathematics. He finally makes a revolutionary breakthrough that will eventually earn him the Nobel Prize. After graduate school he turns to teaching, becoming romantically involved with his student Alicia. Meanwhile the government asks his help with breaking Soviet codes, which soon gets him involved in a terrifying conspiracy plot. Nash grows more and more paranoid until a discovery that turns his entire world upside down. Now it is only with Alicia's help that he will be able to recover his mental strength and regain his status as the great mathematician we know him as today..",
      "runtime": 135
    },
    {
      "name": "Little Fockers",
      "size": 310650585,
      "keywords": [
        "nurse",
        "cat",
        "father-in-law",
        "vomit",
        "kids and family",
        "viagra",
        "duringcreditsstinger"
      ],
      "user_rating": 5.4,
      "votes": 1060,
      "release_year": 2010,
      "overview": "It has taken 10 years, two little Fockers with wife Pam and countless hurdles for Greg to finally get in with his tightly wound father-in-law, Jack. After the cash-strapped dad takes a job moonlighting for a drug company, Jack's suspicions about his favorite male nurse come roaring back. When Greg and Pam's entire clan descends for the twins' birthday party, Greg must prove to the skeptical Jack that he's fully capable as the man of the house.",
      "runtime": 98
    },
    {
      "name": "Runaway Bride",
      "size": 309457509,
      "keywords": [
        "small town",
        "self-discovery",
        "just married",
        "reporter",
        "wedding",
        "relationship"
      ],
      "user_rating": 5.7,
      "votes": 455,
      "release_year": 1999,
      "overview": "Ike Graham, New York columnist, writes his text always at the last minute. This time, a drunken man in his favourite bar tells Ike about Maggie Carpenter, a woman who always flees from her grooms in the last possible moment. Ike, who does not have the best opinion about females anyway, writes an offensive column without researching the subject thoroughly.",
      "runtime": 116
    },
    {
      "name": "The Fault in Our Stars",
      "size": 307166834,
      "keywords": [
        "amsterdam",
        "based on novel",
        "support group",
        "cancer",
        "teenager",
        "star crossed lovers",
        "teen drama",
        "oxygen tank",
        "based on young adult novel"
      ],
      "user_rating": 7.6,
      "votes": 3759,
      "release_year": 2014,
      "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
      "runtime": 125
    },
    {
      "name": "My Best Friend's Wedding",
      "size": 299288605,
      "keywords": [
        "karaoke",
        "marriage proposal",
        "new love",
        "love of one's life",
        "kiss",
        "man-woman relation",
        "secret love",
        "wedding"
      ],
      "user_rating": 6.3,
      "votes": 584,
      "release_year": 1997,
      "overview": "When she receives word that her longtime platonic pal Michael O'Neal is getting married to debutante Kimberly Wallace, food critic Julianne Potter realizes her true feelings for Michael -- and sets out to sabotage the wedding.",
      "runtime": 105
    },
    {
      "name": "Shakespeare in Love",
      "size": 289317794,
      "keywords": [
        "shakespeare",
        "love of one's life",
        "oscar award",
        "theatre play",
        "theatre group",
        "writer's block",
        "theatre milieu",
        "author",
        "speculative",
        "false history"
      ],
      "user_rating": 6.8,
      "votes": 796,
      "release_year": 1998,
      "overview": "Young Shakespeare is forced to stage his latest comedy, \"Romeo and Ethel, the Pirate's Daughter,\" before it's even written. When a lovely noblewoman auditions for a role, they fall into forbidden love -- and his play finds a new life (and title). As their relationship progresses, Shakespeare's comedy soon transforms into tragedy.",
      "runtime": 122
    },
    {
      "name": "Bridesmaids",
      "size": 288383523,
      "keywords": [
        "competition",
        "jealousy",
        "fight",
        "materialism",
        "bridesmaid",
        "female friendship",
        "fear of commitment",
        "wealth",
        "mother daughter relationship",
        "wedding party",
        "sexual humor",
        "best friend",
        "maid of honor",
        "drunk",
        "wedding dress",
        "group of friends",
        "casual sex",
        "vanity",
        "girl fight",
        "missing woman",
        "out of control"
      ],
      "user_rating": 6.5,
      "votes": 1661,
      "release_year": 2011,
      "overview": "Annie’s life is a mess. But when she finds out her lifetime best friend is engaged, she simply must serve as Lillian’s maid of honor. Though lovelorn and broke, Annie bluffs her way through the expensive and bizarre rituals. With one chance to get it perfect, she’ll show Lillian and her bridesmaids just how far you’ll go for someone you love.",
      "runtime": 125
    },
    {
      "name": "Sex and the City 2",
      "size": 288347692,
      "keywords": [],
      "user_rating": 5.4,
      "votes": 426,
      "release_year": 2010,
      "overview": "Carrie, Charlotte, and Miranda are all married now, but they're still up for a little fun in the sun. When Samantha gets the chance to visit one of the most extravagant vacation destinations on the planet and offers to bring them all along, they surmise that a women-only retreat may be the perfect excuse to eschew their responsibilities and remember what life was like before they decided to settle down.",
      "runtime": 146
    },
    {
      "name": "American Pie 2",
      "size": 287553595,
      "keywords": [
        "sex",
        "party",
        "summer",
        "beach house",
        "group of friends",
        "gross out comedy",
        "tantra",
        "mistaken for a special education student",
        "superglue",
        "sex comedy"
      ],
      "user_rating": 6,
      "votes": 1344,
      "release_year": 2001,
      "overview": "The whole gang are back and as close as ever. They decide to get even closer by spending the summer together at a beach house. They decide to hold the biggest party ever to be seen, even if the preparation doesn't always go to plan. Especially when Stifler, Finch and Jim become more close to each other than they ever want to be and when Jim mistakes super glue for lubricant...",
      "runtime": 108
    },
    {
      "name": "The Sound of Music",
      "size": 286214286,
      "keywords": [
        "resistance",
        "austria",
        "world war ii",
        "musical",
        "music competition",
        "salzburg",
        "based on play",
        "classic",
        "alps",
        "governess",
        "convent",
        "music contest",
        "novice",
        "puppet show",
        "nun in love",
        "nazi occupation",
        "1930s"
      ],
      "user_rating": 7.4,
      "votes": 941,
      "release_year": 1965,
      "overview": "Film adaptation of a classic Rodgers and Hammerstein musical based on a nun who becomes a governess for an Austrian family.",
      "runtime": 174
    },
    {
      "name": "Bridget Jones's Diary",
      "size": 281929795,
      "keywords": [
        "holiday",
        "london england",
        "england",
        "alcohol",
        "sex",
        "lovesickness",
        "telecaster",
        "birthday",
        "christmas party",
        "news broadcast",
        "sexual frustration",
        "diary",
        "cigarette",
        "daughter",
        "mother daughter relationship",
        "lawyer",
        "reporter",
        "extramarital affair",
        "duringcreditsstinger",
        "woman director",
        "christmas"
      ],
      "user_rating": 6.5,
      "votes": 1356,
      "release_year": 2001,
      "overview": "A chaotic Bridget Jones meets a snobbish lawyer, and he soon enters her world of imperfections.",
      "runtime": 97
    },
    {
      "name": "The Tourist",
      "size": 278731369,
      "keywords": [
        "paris",
        "hotel",
        "false identity",
        "undercover agent",
        "romance"
      ],
      "user_rating": 6,
      "votes": 1699,
      "release_year": 2010,
      "overview": "American tourist Frank (Johnny Depp) meets mysterious British woman Elsie (Angelina Jolie) on the train to Venice. Romance seems to bud, but there's more to her than meets the eye. Remake of the 2005 French film \"Anthony Zimmer\", written and directed by Jérôme Salle.",
      "runtime": 103
    },
    {
      "name": "Jerry Maguire",
      "size": 273552592,
      "keywords": [
        "stadium",
        "career",
        "sport",
        "sports agent"
      ],
      "user_rating": 6.7,
      "votes": 913,
      "release_year": 1996,
      "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
      "runtime": 139
    },
    {
      "name": "The Princess and the Frog",
      "size": 267045765,
      "keywords": [
        "based on novel",
        "voodoo",
        "kiss",
        "princess",
        "animation",
        "cajun",
        "firefly",
        "based on fairy tale",
        "duringcreditsstinger",
        "big dreams",
        "frog prince",
        "charlatan"
      ],
      "user_rating": 6.7,
      "votes": 1247,
      "release_year": 2009,
      "overview": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to do face the same problem after she kisses him.",
      "runtime": 97
    },
    {
      "name": "Something's Gotta Give",
      "size": 266728738,
      "keywords": [
        "age difference",
        "ladykiller",
        "woman director"
      ],
      "user_rating": 6.3,
      "votes": 410,
      "release_year": 2003,
      "overview": "Harry Sanborn is an aged music industry exec with a fondness for younger women like Marin, his latest trophy girlfriend. Things get a little awkward when Harry suffers a heart attack at the home of Marin's mother, Erica. Left in the care of Erica and his doctor, a love triangle starts to take shape.",
      "runtime": 128
    },
    {
      "name": "Four Weddings and a Funeral",
      "size": 254700832,
      "keywords": [
        "upper class",
        "love at first sight",
        "wedding vows",
        "marriage proposal",
        "yuppie",
        "love of one's life",
        "lone wolf",
        "snob",
        "witness",
        "bride",
        "bridegroom",
        "bridesmaid",
        "funeral",
        "clumsy fellow",
        "friendship",
        "wedding",
        "gay couple"
      ],
      "user_rating": 6.6,
      "votes": 632,
      "release_year": 1994,
      "overview": "Four Weddings And A Funeral is a British comedy about a British Man named Charles and an American Woman named Carrie who go through numerous weddings before they determine if they are right for one another.",
      "runtime": 117
    },
    {
      "name": "You've Got Mail",
      "size": 250821495,
      "keywords": [
        "romantic comedy",
        "online dating",
        "woman director"
      ],
      "user_rating": 6.3,
      "votes": 838,
      "release_year": 1998,
      "overview": "Book superstore magnate, Joe Fox and independent book shop owner, Kathleen Kelly fall in love in the anonymity of the Internet – both blissfully unaware that he's putting her out of business.",
      "runtime": 119
    },
    {
      "name": "Love Actually",
      "size": 244931766,
      "keywords": [
        "london england",
        "male nudity",
        "female nudity",
        "love at first sight",
        "usa president",
        "marseille",
        "office",
        "christmas party",
        "marriage proposal",
        "bars and restaurants",
        "press conference",
        "language barrier",
        "prime minister",
        "rock star",
        "tv show",
        "metal detector",
        "war on terror",
        "school performance",
        "multiple storylines"
      ],
      "user_rating": 7,
      "votes": 1869,
      "release_year": 2003,
      "overview": "Follows seemingly unrelated people as their lives begin to intertwine while they fall in – and out – of love. Affections languish and develop as Christmas draws near.",
      "runtime": 135
    },
    {
      "name": "Click",
      "size": 237681299,
      "keywords": [
        "regret",
        "workaholic",
        "heart attack",
        "architect",
        "dying and death",
        "time travel",
        "remote control",
        "children",
        "liposuction",
        "hospital",
        "wedding",
        "dog",
        "second chance",
        "alternate reality",
        "fatherhood",
        "obese"
      ],
      "user_rating": 6,
      "votes": 2104,
      "release_year": 2006,
      "overview": "A workaholic architect finds a universal remote that allows him to fast-forward and rewind to different parts of his life. Complications arise when the remote starts to overrule his choices.",
      "runtime": 107
    },
    {
      "name": "American Pie",
      "size": 235483004,
      "keywords": [
        "graduation",
        "innocence",
        "coming of age",
        "teenager",
        "high school student",
        "pie",
        "teen comedy",
        "teenage sexuality",
        "exchange student",
        "sitting on a toilet",
        "voyeurism",
        "virginity",
        "laxative",
        "prom night"
      ],
      "user_rating": 6.4,
      "votes": 2296,
      "release_year": 1999,
      "overview": "At a high-school party, four friends find that losing their collective virginity isn't as easy as they had thought. But they still believe that they need to do so before college. To motivate themselves, they enter a pact to all \"score.\" by their senior prom.",
      "runtime": 95
    },
    {
      "name": "The English Patient",
      "size": 231976425,
      "keywords": [
        "cairo",
        "egypt",
        "identity",
        "amnesia",
        "world war ii",
        "burn",
        "landmine",
        "expedition",
        "cave",
        "sandstorm",
        "royal geographic society",
        "cave painting",
        "prisoners of war",
        "map",
        "mine clearer",
        "hearing",
        "desert scientist",
        "intelligence",
        "traitor",
        "mural painting",
        "airplane",
        "secret love"
      ],
      "user_rating": 7,
      "votes": 542,
      "release_year": 1996,
      "overview": "Beginning in the 1930s, \"The English Patient\" tells the story of Count Almásy who is a Hungarian map maker employed by the Royal Geographical Society to chart the vast expanses of the Sahara Desert along with several other prominent explorers. As World War II unfolds, Almásy enters into a world of love, betrayal, and politics that is later revealed in a series of flashbacks while Almásy is on his death bed after being horribly burned in a plane crash.",
      "runtime": 162
    },
    {
      "name": "American Wedding",
      "size": 231449203,
      "keywords": [
        "handcuffs",
        "sister sister relationship",
        "spanner",
        "blow job",
        "stag night",
        "wedding"
      ],
      "user_rating": 6,
      "votes": 1129,
      "release_year": 2003,
      "overview": "With high school a distant memory, Jim and Michelle are getting married -- and in a hurry, since Jim's grandmother is sick and wants to see him walk down the aisle -- prompting Stifler to throw the ultimate bachelor party. And Jim's dad is reliable as ever, doling out advice no one wants to hear.",
      "runtime": 103
    },
    {
      "name": "Juno",
      "size": 231411584,
      "keywords": [
        "sexuality",
        "becoming an adult",
        "puberty",
        "first time",
        "oscar award",
        "pregnancy and birth",
        "pregnant minor",
        "precocity",
        "partnership",
        "teenager",
        "teenage pregnancy"
      ],
      "user_rating": 7,
      "votes": 2244,
      "release_year": 2007,
      "overview": "A young girl named Juno gets herself pregnant and tries to stand on her own, but soon learns a few lessons about being grown up.",
      "runtime": 96
    },
    {
      "name": "Interview with the Vampire",
      "size": 223664608,
      "keywords": [
        "paris",
        "san francisco",
        "vampire",
        "plantation",
        "pity",
        "bite",
        "fang vamp"
      ],
      "user_rating": 7.2,
      "votes": 1516,
      "release_year": 1994,
      "overview": "A vampire relates his epic life story of love, betrayal, loneliness, and dark hunger to an over-curious reporter.",
      "runtime": 123
    },
    {
      "name": "It's Complicated",
      "size": 219103655,
      "keywords": [
        "graduation",
        "ex husband",
        "woman director"
      ],
      "user_rating": 6.2,
      "votes": 360,
      "release_year": 2009,
      "overview": "Ten years after their divorce, Jane and Jake Adler unite for their son's college graduation and unexpectedly end up sleeping together. But Jake is married, and Jane is embarking on a new romance with her architect. Now, she has to sort out her life – just when she thought she had it all figured out.",
      "runtime": 121
    },
    {
      "name": "Knocked Up",
      "size": 219076518,
      "keywords": [
        "alcohol",
        "one-night stand",
        "bed",
        "pregnancy and birth",
        "condom",
        "paternity",
        "drug use",
        "beard",
        "unprotected sex",
        "duringcreditsstinger"
      ],
      "user_rating": 6.2,
      "votes": 1214,
      "release_year": 2007,
      "overview": "For fun loving party animal Ben Stone, the last thing he ever expected was for his one night stand to show up on his doorstep eight weeks later to tell him she's pregnant.",
      "runtime": 129
    },
    {
      "name": "Valentine's Day",
      "size": 216485654,
      "keywords": [
        "flower",
        "married couple",
        "florist",
        "kiss",
        "single",
        "valentine",
        "valentine's day",
        "multiple storylines",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 5.7,
      "votes": 1013,
      "release_year": 2010,
      "overview": "More than a dozen Angelenos navigate Valentine's Day from early morning until midnight. Three couples awake together, but each relationship will sputter; are any worth saving? A grade-school boy wants flowers for his first true love; two high school seniors plan first-time sex at noon; a TV sports reporter gets the assignment to find romance in LA; a star quarterback contemplates his future; two strangers meet on a plane; grandparents, together for years, face a crisis; and, an \"I Hate Valentine's Day\" dinner beckons the lonely and the lied to. Can Cupid finish his work by midnight?",
      "runtime": 125
    },
    {
      "name": "Dracula",
      "size": 215862692,
      "keywords": [
        "adultery",
        "maze",
        "vampire",
        "bite",
        "remake",
        "rough sex",
        "wake",
        "religious conflict",
        "bestiality",
        "correspondence",
        "vampire sex",
        "autonomous shadow",
        "vlad",
        "fang vamp"
      ],
      "user_rating": 7.1,
      "votes": 1056,
      "release_year": 1992,
      "overview": "When Dracula leaves the captive Jonathan Harker and Transylvania for London in search of Mina Harker -- the spitting image of Dracula's long-dead wife, Elisabeta -- obsessed vampire hunter Dr. Van Helsing sets out to end the madness.",
      "runtime": 128
    },
    {
      "name": "Just Go with It",
      "size": 214918407,
      "keywords": [
        "beach",
        "fictitious marriage",
        "blackmail",
        "plastic surgery",
        "marriage",
        "love",
        "beautiful woman",
        "kids and family"
      ],
      "user_rating": 6.3,
      "votes": 1543,
      "release_year": 2011,
      "overview": "A plastic surgeon, romancing a much younger schoolteacher, enlists his loyal assistant to pretend to be his soon to be ex-wife, in order to cover up a careless lie. When more lies backfire, the assistant's kids become involved, and everyone heads off for a weekend in Hawaii that will change all their lives.",
      "runtime": 117
    },
    {
      "name": "Disclosure",
      "size": 214015089,
      "keywords": [
        "employee",
        "workplace",
        "sexual harassment",
        "intrigue"
      ],
      "user_rating": 5.9,
      "votes": 210,
      "release_year": 1994,
      "overview": "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.",
      "runtime": 123
    },
    {
      "name": "Crouching Tiger, Hidden Dragon",
      "size": 213525736,
      "keywords": [
        "flying",
        "martial arts",
        "taskmaster",
        "comb",
        "tiger",
        "desert thief",
        "theft",
        "female martial artist"
      ],
      "user_rating": 7.2,
      "votes": 927,
      "release_year": 2000,
      "overview": "Two warriors in pursuit of a stolen sword and a notorious fugitive are led to an impetuous, physically-skilled, teenage nobleman's daughter, who is at a crossroads in her life.",
      "runtime": 120
    },
    {
      "name": "Bedtime Stories",
      "size": 212874442,
      "keywords": [
        "wishes come true",
        "escapade",
        "disorder",
        "imaginary",
        "miraculous event",
        "imaginary kingdom",
        "life turned upside down",
        "nothing goes right"
      ],
      "user_rating": 5.9,
      "votes": 901,
      "release_year": 2008,
      "overview": "Skeeter Bronson is a down-on-his-luck guy who's always telling bedtime stories to his niece and nephew. But his life is turned upside down when the fantastical stories he makes up for entertainment inexplicably turn into reality. Can a bewildered Skeeter manage his own unruly fantasies now that the outrageous characters and situations from his mind have morphed into actual people and events?",
      "runtime": 99
    },
    {
      "name": "Entrapment",
      "size": 212404396,
      "keywords": [
        "london england",
        "new year's eve",
        "skyscraper",
        "burglar",
        "distrust",
        "undercover",
        "blackmail",
        "nudity",
        "thief",
        "heist",
        "older man younger woman relationship",
        "art thief",
        "criminal",
        "art theft",
        "millennium",
        "manhattan, new york city",
        "gala",
        "kuala lumpur malaysia"
      ],
      "user_rating": 6,
      "votes": 602,
      "release_year": 1999,
      "overview": "Two thieves, who travel in elegant circles, try to outsmart each other and, in the process, end up falling in love.",
      "runtime": 112
    },
    {
      "name": "Me Before You",
      "size": 207945075,
      "keywords": [
        "england",
        "based on novel",
        "depression",
        "small town",
        "wheelchair",
        "caretaker",
        "caregiver",
        "disabled",
        "twenty something",
        "woman director",
        "romantic drama",
        "dead end job",
        "accident"
      ],
      "user_rating": 7.6,
      "votes": 2562,
      "release_year": 2016,
      "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
      "runtime": 110
    },
    {
      "name": "Silver Linings Playbook",
      "size": 205738714,
      "keywords": [
        "dancing",
        "philadelphia",
        "running",
        "based on novel",
        "depression",
        "letter",
        "friendship",
        "neighbor",
        "mental illness",
        "ex-wife",
        "institutionalization",
        "bipolar",
        "philadelphia eagles"
      ],
      "user_rating": 6.9,
      "votes": 4742,
      "release_year": 2012,
      "overview": "After spending eight months in a mental institution, a former teacher moves back in with his parents and tries to reconcile with his ex-wife.",
      "runtime": 122
    },
    {
      "name": "The Ugly Truth",
      "size": 205298907,
      "keywords": [
        "romantic comedy",
        "romance",
        "tv morning show",
        "relationship",
        "opposites attract"
      ],
      "user_rating": 6.4,
      "votes": 972,
      "release_year": 2009,
      "overview": "A romantically challenged morning show producer is reluctantly embroiled in a series of outrageous tests by her chauvinistic correspondent to prove his theories on relationships and help her find love. His clever ploys, however, lead to an unexpected result.",
      "runtime": 96
    },
    {
      "name": "The Break-Up",
      "size": 204999686,
      "keywords": [
        "bowling",
        "chicago",
        "american football",
        "flat",
        "baseball",
        "new love",
        "tour guide",
        "break-up",
        "art gallery",
        "argument",
        "pool table",
        "watching tv",
        "ex-boyfriend ex-girlfriend relationship",
        "dinner party",
        "condominium"
      ],
      "user_rating": 5.6,
      "votes": 832,
      "release_year": 2006,
      "overview": "Cohabitating couple Gary and Brooke find their once-blissful romance on the rocks when petty spats about lemons and dirty dishes mushroom into an all-out battle for custody of their upscale Chicago condo. An escalating argument ensues as Gary and Brooke continue to live under the same roof, all while cooking up schemes to drive each other off the premises.",
      "runtime": 106
    },
    {
      "name": "Vanilla Sky",
      "size": 203388341,
      "keywords": [
        "amnesia",
        "ex-girlfriend",
        "virtual reality"
      ],
      "user_rating": 6.5,
      "votes": 1078,
      "release_year": 2001,
      "overview": "David Aames (Tom Cruise) has it all: wealth, good looks and gorgeous women on his arm. But just as he begins falling for the warmhearted Sofia (Penelope Cruz), his face is horribly disfigured in a car accident. That's just the beginning of his troubles as the lines between illusion and reality, between life and death, are blurred.",
      "runtime": 136
    },
    {
      "name": "City of Angels",
      "size": 198685114,
      "keywords": [
        "suicide",
        "angel",
        "life and death",
        "desperation",
        "operation",
        "heaven",
        "faith",
        "afterlife",
        "los angeles",
        "interspecies romance"
      ],
      "user_rating": 6.4,
      "votes": 529,
      "release_year": 1998,
      "overview": "When guardian angel Seth -- who invisibly watches over the citizens of Los Angeles -- becomes captivated by Maggie, a strong-willed heart surgeon, he ponders trading in his pure, otherworldly existence for a mortal life with his beloved. The couple embarks on a tender but forbidden romance spanning heaven and Earth.",
      "runtime": 114
    },
    {
      "name": "The Other Woman",
      "size": 196781193,
      "keywords": [
        "infidelity",
        "revenge",
        "unfaithful boyfriend",
        "woman",
        "sitting on a toilet",
        "public toilet",
        "marital infidelity",
        "laxative",
        "unfaithful husband"
      ],
      "user_rating": 6.2,
      "votes": 1437,
      "release_year": 2014,
      "overview": "After discovering her boyfriend is married, Carly soon meets the wife he's been cheating on. And when yet another affair is discovered, all three women team up to plot mutual revenge on the three-timing SOB.",
      "runtime": 109
    },
    {
      "name": "50 First Dates",
      "size": 196482882,
      "keywords": [
        "deja vu",
        "amnesia",
        "hawaii",
        "ladykiller",
        "romantic comedy"
      ],
      "user_rating": 6.6,
      "votes": 2105,
      "release_year": 2004,
      "overview": "Henry is a player skilled at seducing women. But when this veterinarian meets Lucy, a girl with a quirky problem when it comes to total recall, he realizes it's possible to fall in love all over again…and again, and again. That's because the delightful Lucy has no short-term memory, so Henry must woo her day after day until he finally sweeps her off her feet.",
      "runtime": 99
    },
    {
      "name": "The Vow",
      "size": 196114570,
      "keywords": [
        "coma",
        "amnesia",
        "based on true story",
        "memory loss",
        "car accident",
        "romantic drama"
      ],
      "user_rating": 7,
      "votes": 1293,
      "release_year": 2012,
      "overview": "Happy young married couple Paige and Leo are, well, happy. Then a car accident puts Paige into a life-threatening coma. Upon awakening she has lost the previous five years of memories, including those of her beloved Leo, her wedding, a confusing relationship with her parents, or the ending of her relationship with her ex-fiance. Despite these complications, Leo endeavors to win her heart again and rebuild their marriage.",
      "runtime": 104
    },
    {
      "name": "The Holiday",
      "size": 194168700,
      "keywords": [
        "holiday",
        "london england",
        "film making",
        "christmas party",
        "country house",
        "room exchange",
        "surrey",
        "romantic comedy",
        "los angeles",
        "multiple storylines",
        "woman director",
        "christmas"
      ],
      "user_rating": 6.7,
      "votes": 1225,
      "release_year": 2006,
      "overview": "Two women, one (Cameron Diaz) from America and one (Kate Winslet) from Britain, swap homes at Christmastime after bad breakups with their boyfriends. Each woman finds romance with a local man (Jude Law, Jack Black) but realizes that the imminent return home may end the relationship.",
      "runtime": 136
    },
    {
      "name": "The Horse Whisperer",
      "size": 186883563,
      "keywords": [
        "love triangle",
        "new york",
        "montana",
        "attachment to nature",
        "confidence",
        "horseback riding",
        "horse",
        "riding accident",
        "career woman",
        "ranch",
        "horse whisperer",
        "trauma",
        "country life",
        "marriage crisis",
        "crisis",
        "travel",
        "mother daughter relationship",
        "animal",
        "nature"
      ],
      "user_rating": 6.7,
      "votes": 292,
      "release_year": 1998,
      "overview": "Based on the novel by the same name from Nicholas Evans, the talented Robert Redford presents this meditative family drama set in the country side. Redford not only directs but also stars in the roll of a cowboy with a magical talent for healing.",
      "runtime": 170
    },
    {
      "name": "Walk the Line",
      "size": 186438883,
      "keywords": [
        "germany",
        "prison",
        "music record",
        "adultery",
        "country music",
        "guitar",
        "loss of brother",
        "concert",
        "marriage",
        "single",
        "accident",
        "1960s"
      ],
      "user_rating": 7.3,
      "votes": 718,
      "release_year": 2005,
      "overview": "A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis and Carl Perkins.",
      "runtime": 136
    },
    {
      "name": "The Bridges of Madison County",
      "size": 182016617,
      "keywords": [
        "farewell",
        "adultery",
        "love at first sight",
        "photographer",
        "wife husband relationship",
        "iowa",
        "love of one's life",
        "mother role",
        "bridge",
        "housewife",
        "love letter",
        "peasant",
        "marriage crisis",
        "photography",
        "unsociability",
        "secret love",
        "nature documentary"
      ],
      "user_rating": 7.3,
      "votes": 385,
      "release_year": 1995,
      "overview": "Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson for four days in the 1960s.",
      "runtime": 135
    },
    {
      "name": "Grease",
      "size": 181813770,
      "keywords": [
        "flying car",
        "street gang",
        "running",
        "graduation",
        "musical",
        "rivalry",
        "gossip",
        "makeover",
        "based on stage musical",
        "automobile racing",
        "nostalgic",
        "greaser",
        "wolf whistle",
        "school dance",
        "animated credits",
        "pep rally",
        "wrong side of the tracks",
        "mooning",
        "school principal"
      ],
      "user_rating": 7.2,
      "votes": 1581,
      "release_year": 1978,
      "overview": "Australian good girl Sandy and greaser Danny fell in love over the summer. But when they unexpectedly discover they're now in the same high school, will they be able to rekindle their romance despite their eccentric friends?",
      "runtime": 110
    },
    {
      "name": "Sweet Home Alabama",
      "size": 180622424,
      "keywords": [
        "new york",
        "marriage proposal",
        "alabama",
        "career woman",
        "fashion designer"
      ],
      "user_rating": 6,
      "votes": 394,
      "release_year": 2002,
      "overview": "New York fashion designer Melanie Carmichael suddenly finds herself engaged to the city's most eligible bachelor. But Melanie's past holds many secrets, including Jake, the redneck husband she married in high school, who refuses to divorce her. Bound and determined to end their contentious relationship once and for all, Melanie sneaks back home to Alabama to confront her past.",
      "runtime": 108
    },
    {
      "name": "Moulin Rouge!",
      "size": 179213434,
      "keywords": [
        "duke",
        "musical",
        "writer's block",
        "music",
        "terminal illness",
        "writer",
        "no opening credits",
        "moulin rouge",
        "bohemian",
        "toulouse lautrec",
        "red curtain",
        "cancan dance",
        "la traviata",
        "orpheus and eurydice",
        "dance hall"
      ],
      "user_rating": 7.4,
      "votes": 1300,
      "release_year": 2001,
      "overview": "A celebration of love and creative inspiration takes place in the infamous, gaudy and glamorous Parisian nightclub, at the cusp of the 20th century. A young poet, who is plunged into the heady world of Moulin Rouge, begins a passionate affair with the club's most notorious and beautiful star.",
      "runtime": 127
    },
    {
      "name": "Brokeback Mountain",
      "size": 178043761,
      "keywords": [
        "gay",
        "countryside",
        "homophobia",
        "loss of lover",
        "wyoming",
        "rodeo",
        "father murder",
        "horseback riding",
        "intolerance",
        "daughter",
        "marriage crisis",
        "secret love",
        "cowboy",
        "star crossed lovers"
      ],
      "user_rating": 7.5,
      "votes": 1480,
      "release_year": 2005,
      "overview": "Brokeback Mountain is an Ang Lee film about two modern day cowboys who meet on a shepherding job in the summer of ’63. The two share a raw and powerful summer together that turns into a life long relationship conflicting with the lives they are supposed to live.",
      "runtime": 134
    },
    {
      "name": "How to Lose a Guy in 10 Days",
      "size": 177371441,
      "keywords": [
        "new york",
        "bet",
        "journalist",
        "therapist",
        "advertising expert",
        "relationship"
      ],
      "user_rating": 6.3,
      "votes": 850,
      "release_year": 2003,
      "overview": "An advice columnist, Andie Anderson (Kate Hudson), tries pushing the boundaries of what she can write about in her new piece about how to get a man to leave you in 10 days. Her editor, Lana (Bebe Neuwirth), loves it, and Andie goes off to find a man she can use for the experiment. Enter executive Ben Berry (Matthew McConaughey), who is so confident in his romantic prowess that he thinks he can make any woman fall in love with him in 10 days. When Andie and Ben meet, their plans backfire.",
      "runtime": 116
    },
    {
      "name": "He's Just Not That Into You",
      "size": 177259441,
      "keywords": [
        "relationship",
        "ensemble cast",
        "duringcreditsstinger"
      ],
      "user_rating": 6.2,
      "votes": 959,
      "release_year": 2009,
      "overview": "Remember that really cute guy who said he'd call – and didn't? Maybe he lost your number. Maybe he's in the hospital. Maybe he's awed by your beauty, brains or success. Or maybe... he's just not that into you.",
      "runtime": 129
    },
    {
      "name": "Tootsie",
      "size": 177200000,
      "keywords": [
        "infidelity",
        "love",
        "friends",
        "cross dressing",
        "reputation",
        "unemployed actor",
        "serenade",
        "hit in the crotch",
        "apology",
        "live television",
        "actress",
        "actor"
      ],
      "user_rating": 6.9,
      "votes": 421,
      "release_year": 1982,
      "overview": "Michael Dorsey is an unemployed actor with an impossible reputation. In order to find work and fund his friend's play he dresses as a woman, Dorothy Michaels, and lands the part in a daytime drama. Dorsey loses himself in this woman role and essentially becomes Dorothy Michaels, captivating women all around the city and inspiring them to break free from the control of men and become more like Dorsey's initial identity. This newfound role, however, lands Dorsey in a hot spot between a female friend/'lover,' a female co-star he falls in love with, that co-star's father who falls in love with him, and a male co-star who yearns for his affection.",
      "runtime": 116
    },
    {
      "name": "Dr. Dolittle 2",
      "size": 176104344,
      "keywords": [
        "veterinarian",
        "forest",
        "bear",
        "animal",
        "animal protection"
      ],
      "user_rating": 4.9,
      "votes": 410,
      "release_year": 2001,
      "overview": "Dr. John Dolittle the beloved doctor is back, but this time around he plays cupid to bumbling circus bear Archie as he's so smitten by a Pacific Western bear female, Ava. Dr. Dolittle must help a group of forest creatures to save their forest. But with the aid of his mangy, madcap animal friends, Dr. Dolittle must teach Archie the ways of true romance in time to save his species and his home before their habit is gone. So John held a meeting for every animal in the forest to not give up without a fight no matter what kind of animal expression they have and everyone agrees to do it and save their home.",
      "runtime": 87
    },
    {
      "name": "Amélie",
      "size": 173921954,
      "keywords": [
        "paris",
        "love triangle",
        "ghost train",
        "sex-shop",
        "shyness",
        "montmartre",
        "daughter",
        "garden gnome",
        "journey round the world",
        "photography"
      ],
      "user_rating": 7.8,
      "votes": 3310,
      "release_year": 2001,
      "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie (Audrey Tautou) accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
      "runtime": 122
    },
    {
      "name": "Along Came Polly",
      "size": 171963386,
      "keywords": [
        "beach",
        "honeymoon",
        "bride",
        "chance",
        "risk",
        "relation",
        "long island",
        "romantic comedy",
        "comedy",
        "scuba diving",
        "unfaithfulness",
        "los angeles",
        "art gallery",
        "dance class",
        "opposites attract",
        "caribbean",
        "commitment",
        "dance club",
        "neurotic",
        "bagpipes",
        "chance encounter",
        "insurance risk manager"
      ],
      "user_rating": 5.8,
      "votes": 773,
      "release_year": 2004,
      "overview": "Reuben Feffer is a guy who's spent his entire life playing it safe. Polly Prince is irresistible as a free-spirit who lives for the thrill of the moment. When these two comically mismatched souls collide, Reuben's world is turned upside down, as he makes an uproarious attempt to change his life from middle-of-the-road to totally-out-there.",
      "runtime": 90
    },
    {
      "name": "Couples Retreat",
      "size": 171844840,
      "keywords": [
        "island",
        "married couple",
        "yoga",
        "tahiti",
        "couples therapy",
        "beautiful woman",
        "tropical",
        "aftercreditsstinger",
        "duringcreditsstinger",
        "french polynesia",
        "polynésie française"
      ],
      "user_rating": 5.3,
      "votes": 588,
      "release_year": 2009,
      "overview": "Four couples, all friends, descend on a tropical island resort. Though one husband and wife are there to work on their marriage, the others just want to enjoy some fun in the sun. They soon find, however, that paradise comes at a price: Participation in couples therapy sessions is mandatory. What started out as a cut-rate vacation turns into an examination of the common problems many face.",
      "runtime": 113
    },
    {
      "name": "Mr. Deeds",
      "size": 171269535,
      "keywords": [
        "love letter",
        "new hampshire",
        "ferrari",
        "liar",
        "city country contrast",
        "inheritance",
        "billionaire",
        "new york city",
        "kindness",
        "fable",
        "apple tree",
        "corporate take over",
        "chrysler building"
      ],
      "user_rating": 5.6,
      "votes": 644,
      "release_year": 2002,
      "overview": "When Longfellow Deeds, a small-town pizzeria owner and poet, inherits $40 billion from his deceased uncle, he quickly begins rolling in a different kind of dough. Moving to the big city, Deeds finds himself besieged by opportunists all gunning for their piece of the pie. Babe, a television tabloid reporter, poses as an innocent small-town girl to do an exposé on Deeds.",
      "runtime": 96
    },
    {
      "name": "Shall We Dance?",
      "size": 170128460,
      "keywords": [
        "jealousy",
        "wife husband relationship",
        "dancing master"
      ],
      "user_rating": 5.9,
      "votes": 297,
      "release_year": 2004,
      "overview": "Upon first sight of a beautiful instructor, a bored and overworked estate lawyer signs up for ballroom dancing lessons.",
      "runtime": 107
    },
    {
      "name": "What Happens in Vegas",
      "size": 170000000,
      "keywords": [
        "casino",
        "hotel",
        "roommate",
        "fictitious marriage",
        "romantic comedy",
        "rivalry",
        "wedding",
        "las vegas"
      ],
      "user_rating": 5.8,
      "votes": 923,
      "release_year": 2008,
      "overview": "During a wild vacation in Las Vegas, career woman Joy McNally and playboy Jack Fuller come to the sober realization that they have married each other after a night of drunken abandon. They are then compelled, for legal reasons, to live life as a couple for a limited period of time. At stake is a large amount of money.",
      "runtime": 99
    },
    {
      "name": "Zookeeper",
      "size": 169852759,
      "keywords": [
        "talking animal",
        "scientist",
        "german accent",
        "ostrich",
        "monkey",
        "bullfrog",
        "car dealership",
        "duringcreditsstinger"
      ],
      "user_rating": 5.3,
      "votes": 498,
      "release_year": 2011,
      "overview": "A comedy about a zookeeper who might be great with animals, but he doesn't know anything about the birds and the bees. The man can't find love, so he decides to quit his job at the zoo, but his animal friends try to stop him and teach him that Mother Nature knows best when it comes to love.",
      "runtime": 102
    },
    {
      "name": "Alexander",
      "size": 167298192,
      "keywords": [
        "aristotle",
        "egypt",
        "greece",
        "persia",
        "elephant",
        "campaign",
        "alexander the great",
        "homosexuality",
        "gay relationship",
        "ancient world"
      ],
      "user_rating": 5.6,
      "votes": 927,
      "release_year": 2004,
      "overview": "Alexander, the King of Macedonia, leads his legions against the giant Persian Empire. After defeating the Persians, he leads his army across the then known world, venturing farther than any westerner had ever gone, all the way to India.",
      "runtime": 175
    },
    {
      "name": "The Princess Diaries",
      "size": 165335153,
      "keywords": [
        "heir to the throne",
        "grandmother granddaughter relationship",
        "high school",
        "princess",
        "royalty",
        "teenager",
        "popularity",
        "social outcast",
        "based on young adult novel"
      ],
      "user_rating": 6.5,
      "votes": 1023,
      "release_year": 2001,
      "overview": "A socially awkward but very bright 15-year-old girl being raised by a single mom discovers that she is the princess of a small European country because of the recent death of her long-absent father, who, unknown to her, was the crown prince of Genovia. She must make a choice between continuing the life of a San Francisco teen or stepping up to the throne.",
      "runtime": 115
    },
    {
      "name": "Six Days Seven Nights",
      "size": 164000000,
      "keywords": [
        "overleven",
        "family guy"
      ],
      "user_rating": 5.6,
      "votes": 332,
      "release_year": 1998,
      "overview": "When Quinn, a grouchy pilot living the good life in the South Pacific, agrees to transfer a savvy fashion editor, Robin, to Tahiti, he ends up stranded on a deserted island with her after their plane crashes. The pair avoid each other at first, until they're forced to team up to escape from the island -- and some pirates who want their heads.",
      "runtime": 98
    },
    {
      "name": "Four Christmases",
      "size": 163733697,
      "keywords": [
        "holiday",
        "romantic comedy",
        "dysfunctional family",
        "christmas"
      ],
      "user_rating": 5.3,
      "votes": 331,
      "release_year": 2008,
      "overview": "Brad and Kate have made something of an art form out of avoiding their families during the holidays, but this year their foolproof plan is about go bust -- big time. Stuck at the city airport after all departing flights are canceled, the couple is embarrassed to see their ruse exposed to the world by an overzealous television reporter. Now, Brad and Kate are left with precious little choice other than to swallow their pride and suffer the rounds.",
      "runtime": 88
    }
  ],
  "links": [
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "The Twilight Saga: New Moon",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "The Twilight Saga: Eclipse",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "Twilight",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "Interview with the Vampire",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Breaking Dawn - Part 2",
      "target": "Dracula",
      "value": 2
    },
    {
      "source": "Maleficent",
      "target": "Cinderella",
      "value": 2
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "The Twilight Saga: Eclipse",
      "value": 3
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "Twilight",
      "value": 2
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "Interview with the Vampire",
      "value": 2
    },
    {
      "source": "The Twilight Saga: New Moon",
      "target": "Dracula",
      "value": 2
    },
    {
      "source": "The Twilight Saga: Eclipse",
      "target": "Twilight",
      "value": 3
    },
    {
      "source": "The Twilight Saga: Eclipse",
      "target": "Interview with the Vampire",
      "value": 3
    },
    {
      "source": "The Twilight Saga: Eclipse",
      "target": "Dracula",
      "value": 3
    },
    {
      "source": "Forrest Gump",
      "target": "Silver Linings Playbook",
      "value": 3
    },
    {
      "source": "Mamma Mia!",
      "target": "Twilight",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Mamma Mia!",
      "target": "Bridget Jones's Diary",
      "value": 4
    },
    {
      "source": "Mamma Mia!",
      "target": "Valentine's Day",
      "value": 2
    },
    {
      "source": "Fifty Shades of Grey",
      "target": "Me Before You",
      "value": 2
    },
    {
      "source": "Meet the Fockers",
      "target": "My Big Fat Greek Wedding",
      "value": 4
    },
    {
      "source": "Meet the Fockers",
      "target": "Meet the Parents",
      "value": 3
    },
    {
      "source": "Aladdin",
      "target": "Enchanted",
      "value": 3
    },
    {
      "source": "Aladdin",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Pearl Harbor",
      "target": "Top Gun",
      "value": 2
    },
    {
      "source": "Pearl Harbor",
      "target": "The English Patient",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "The Proposal",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "Interview with the Vampire",
      "value": 2
    },
    {
      "source": "Twilight",
      "target": "Dracula",
      "value": 2
    },
    {
      "source": "My Big Fat Greek Wedding",
      "target": "Meet the Parents",
      "value": 2
    },
    {
      "source": "Notting Hill",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Notting Hill",
      "target": "Love Actually",
      "value": 2
    },
    {
      "source": "Top Gun",
      "target": "The English Patient",
      "value": 2
    },
    {
      "source": "Top Gun",
      "target": "Brokeback Mountain",
      "value": 2
    },
    {
      "source": "Enchanted",
      "target": "The Princess and the Frog",
      "value": 2
    },
    {
      "source": "Meet the Parents",
      "target": "Little Fockers",
      "value": 2
    },
    {
      "source": "Meet the Parents",
      "target": "Click",
      "value": 2
    },
    {
      "source": "Fatal Attraction",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "Fatal Attraction",
      "target": "The Bridges of Madison County",
      "value": 2
    },
    {
      "source": "The Proposal",
      "target": "Bridget Jones's Diary",
      "value": 2
    },
    {
      "source": "The Proposal",
      "target": "You've Got Mail",
      "value": 2
    },
    {
      "source": "The Proposal",
      "target": "The Holiday",
      "value": 2
    },
    {
      "source": "The Proposal",
      "target": "What Happens in Vegas",
      "value": 2
    },
    {
      "source": "As Good as It Gets",
      "target": "Four Weddings and a Funeral",
      "value": 2
    },
    {
      "source": "As Good as It Gets",
      "target": "Silver Linings Playbook",
      "value": 2
    },
    {
      "source": "The Fault in Our Stars",
      "target": "The Princess Diaries",
      "value": 2
    },
    {
      "source": "My Best Friend's Wedding",
      "target": "Four Weddings and a Funeral",
      "value": 3
    },
    {
      "source": "My Best Friend's Wedding",
      "target": "The Bridges of Madison County",
      "value": 2
    },
    {
      "source": "Bridget Jones's Diary",
      "target": "Love Actually",
      "value": 2
    },
    {
      "source": "Bridget Jones's Diary",
      "target": "Knocked Up",
      "value": 2
    },
    {
      "source": "Bridget Jones's Diary",
      "target": "Me Before You",
      "value": 2
    },
    {
      "source": "Bridget Jones's Diary",
      "target": "The Holiday",
      "value": 5
    },
    {
      "source": "Bridget Jones's Diary",
      "target": "Four Christmases",
      "value": 2
    },
    {
      "source": "The Princess and the Frog",
      "target": "Valentine's Day",
      "value": 2
    },
    {
      "source": "Four Weddings and a Funeral",
      "target": "Love Actually",
      "value": 2
    },
    {
      "source": "Four Weddings and a Funeral",
      "target": "The Bridges of Madison County",
      "value": 2
    },
    {
      "source": "You've Got Mail",
      "target": "The Holiday",
      "value": 2
    },
    {
      "source": "Love Actually",
      "target": "The Holiday",
      "value": 3
    },
    {
      "source": "American Pie",
      "target": "The Other Woman",
      "value": 2
    },
    {
      "source": "Interview with the Vampire",
      "target": "Dracula",
      "value": 3
    },
    {
      "source": "Valentine's Day",
      "target": "Couples Retreat",
      "value": 3
    },
    {
      "source": "Me Before You",
      "target": "Silver Linings Playbook",
      "value": 2
    },
    {
      "source": "The Ugly Truth",
      "target": "Along Came Polly",
      "value": 2
    },
    {
      "source": "The Holiday",
      "target": "Along Came Polly",
      "value": 2
    },
    {
      "source": "The Holiday",
      "target": "Four Christmases",
      "value": 3
    },
    {
      "source": "The Horse Whisperer",
      "target": "Sweet Home Alabama",
      "value": 2
    },
    {
      "source": "The Horse Whisperer",
      "target": "Brokeback Mountain",
      "value": 2
    },
    {
      "source": "The Bridges of Madison County",
      "target": "Brokeback Mountain",
      "value": 2
    }
  ]
}