{
  "nodes": [
    {
      "name": "Titanic",
      "size": 1845034188,
      "keywords": [
        "shipwreck",
        "iceberg",
        "ship",
        "panic",
        "titanic",
        "ocean liner",
        "epic",
        "rich woman - poor man",
        "love",
        "disaster",
        "tragic love",
        "class differences",
        "imax",
        "star crossed lovers",
        "steerage",
        "salvage",
        "rich snob",
        "3d",
        "1910s"
      ],
      "user_rating": 7.5,
      "votes": 7562,
      "release_year": 1997,
      "overview": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "runtime": 194
    },
    {
      "name": "Jurassic World",
      "size": 1513528810,
      "keywords": [
        "monster",
        "dna",
        "tyrannosaurus rex",
        "velociraptor",
        "island",
        "sequel",
        "suspense",
        "disaster",
        "escape",
        "dinosaur",
        "amusement park",
        "animal attack",
        "theme park",
        "jurassic park",
        "3d",
        "animal horror"
      ],
      "user_rating": 6.5,
      "votes": 8662,
      "release_year": 2015,
      "overview": "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
      "runtime": 124
    },
    {
      "name": "Skyfall",
      "size": 1108561013,
      "keywords": [
        "spy",
        "secret agent",
        "sociopath",
        "killer",
        "art gallery",
        "british secret service",
        "istanbul turkey",
        "imax",
        "uzi",
        "booby trap",
        "impersonating a police officer",
        "macao"
      ],
      "user_rating": 6.9,
      "votes": 7604,
      "release_year": 2012,
      "overview": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory, the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve - following a trail to the mysterious Silva, whose lethal and hidden motives have yet to reveal themselves.",
      "runtime": 143
    },
    {
      "name": "The Dark Knight Rises",
      "size": 1084939099,
      "keywords": [
        "dc comics",
        "crime fighter",
        "terrorist",
        "secret identity",
        "burglar",
        "hostage drama",
        "time bomb",
        "gotham city",
        "vigilante",
        "cover-up",
        "superhero",
        "villainess",
        "tragic hero",
        "terrorism",
        "destruction",
        "catwoman",
        "cat burglar",
        "imax",
        "flood",
        "criminal underworld",
        "batman"
      ],
      "user_rating": 7.6,
      "votes": 9106,
      "release_year": 2012,
      "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
      "runtime": 165
    },
    {
      "name": "The Dark Knight",
      "size": 1004558444,
      "keywords": [
        "dc comics",
        "crime fighter",
        "secret identity",
        "scarecrow",
        "sadism",
        "chaos",
        "gotham city",
        "vigilante",
        "joker",
        "superhero",
        "based on comic book",
        "tragic hero",
        "organized crime",
        "criminal mastermind",
        "district attorney",
        "imax",
        "super villain",
        "super powers",
        "batman"
      ],
      "user_rating": 8.2,
      "votes": 12002,
      "release_year": 2008,
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "runtime": 152
    },
    {
      "name": "Inception",
      "size": 825532764,
      "keywords": [
        "loss of lover",
        "dream",
        "kidnapping",
        "sleep",
        "subconsciousness",
        "heist",
        "redemption",
        "female hero"
      ],
      "user_rating": 8.1,
      "votes": 13752,
      "release_year": 2010,
      "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
      "runtime": 148
    },
    {
      "name": "The Da Vinci Code",
      "size": 767820459,
      "keywords": [
        "paris",
        "holy grail",
        "christianity",
        "monk",
        "based on novel",
        "zurich",
        "secret society",
        "louvre",
        "curator",
        "symbologist",
        "opus dei",
        "heresy",
        "mona lisa",
        "freemason",
        "conspiracy",
        "pentagram",
        "tomb",
        "catholicism",
        "cryptologist",
        "iconography",
        "albino",
        "sect"
      ],
      "user_rating": 6.5,
      "votes": 2704,
      "release_year": 2006,
      "overview": "When the curator of the Louvre is found murdered in the famed museum's hallowed halls, Harvard professor, Robert Langdon and cryptographer, Sophie Neve must untangle a deadly web of deceit involving the works of Leonardo da Vinci.",
      "runtime": 149
    },
    {
      "name": "The Hunger Games: Mockingjay - Part 1",
      "size": 752100229,
      "keywords": [
        "resistance",
        "post-apocalyptic",
        "dystopia",
        "war",
        "sequel",
        "female protagonist",
        "bow and arrow",
        "game",
        "future war",
        "revolt",
        "class prejudice",
        "human subjugation",
        "based on young adult novel"
      ],
      "user_rating": 6.6,
      "votes": 5584,
      "release_year": 2014,
      "overview": "Katniss Everdeen reluctantly becomes the symbol of a mass rebellion against the autocratic Capitol.",
      "runtime": 123
    },
    {
      "name": "The Matrix Reloaded",
      "size": 738599701,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "man vs machine",
        "martial arts",
        "kung fu",
        "underground world",
        "dream",
        "hero",
        "fight",
        "computer virus",
        "key",
        "future",
        "plato",
        "precognition",
        "rave",
        "dying and death",
        "virtual reality",
        "dystopia",
        "computer",
        "faith",
        "world religion",
        "truth",
        "mission",
        "cyberpunk",
        "woman director",
        "gnosticism"
      ],
      "user_rating": 6.7,
      "votes": 3443,
      "release_year": 2003,
      "overview": "Six months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance.  Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix and a certain degree of pre-cognition. But a nasty piece of news hits the human resistance: 250,000 machine sentinels are digging to Zion and would reach them in 72 hours. As Zion prepares for the ultimate war, Neo, Morpheus and Trinity are advised by the Oracle to find the Keymaker who would help them reach the Source.  Meanwhile Neo's recurrent dreams depicting Trinity's death have got him worried and as if it was not enough, Agent Smith has somehow escaped deletion, has become more powerful than before and has fixed Neo as his next target.",
      "runtime": 138
    },
    {
      "name": "Gravity",
      "size": 716392705,
      "keywords": [
        "space mission",
        "loss",
        "space",
        "astronaut",
        "trapped in space"
      ],
      "user_rating": 7.3,
      "votes": 5751,
      "release_year": 2013,
      "overview": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
      "runtime": 91
    },
    {
      "name": "Dawn of the Planet of the Apes",
      "size": 710644566,
      "keywords": [
        "leader",
        "colony",
        "post-apocalyptic",
        "dystopia",
        "forest",
        "sequel",
        "woods",
        "ape",
        "scientist",
        "monkey",
        "medical research",
        "animal attack",
        "plague",
        "3d"
      ],
      "user_rating": 7.3,
      "votes": 4410,
      "release_year": 2014,
      "overview": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
      "runtime": 130
    },
    {
      "name": "Mission: Impossible - Ghost Protocol",
      "size": 694713380,
      "keywords": [
        "fight",
        "sequel",
        "mission",
        "explosion",
        "broken arm",
        "imax",
        "nuclear threat"
      ],
      "user_rating": 6.8,
      "votes": 3972,
      "release_year": 2011,
      "overview": "In the 4th installment of the Mission Impossible series, Ethan Hunt (Cruise) and his team are racing against time to track down a dangerous terrorist named Hendricks (Nyqvist), who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.",
      "runtime": 133
    },
    {
      "name": "Mission: Impossible - Rogue Nation",
      "size": 682330139,
      "keywords": [
        "london england",
        "spy",
        "austria",
        "villain",
        "sequel",
        "mission",
        "conspiracy",
        "vienna opera",
        "vienna"
      ],
      "user_rating": 7.1,
      "votes": 3224,
      "release_year": 2015,
      "overview": "Ethan and team take on their most impossible mission yet, eradicating the Syndicate - an International rogue organization as highly skilled as they are, committed to destroying the IMF.",
      "runtime": 131
    },
    {
      "name": "The Sixth Sense",
      "size": 672806292,
      "keywords": [
        "child abuse",
        "sense of guilt",
        "loss of child",
        "confidence",
        "psychology",
        "dying and death",
        "marriage crisis",
        "afterlife",
        "single",
        "paranormal phenomena",
        "cowardliness",
        "child",
        "spiritism"
      ],
      "user_rating": 7.7,
      "votes": 3147,
      "release_year": 1999,
      "overview": "A psychological thriller about an eight year old boy named Cole Sear who believes he can see into the world of the dead. A child psychologist named Malcolm Crowe comes to Cole to help him deal with his problem, learning that he really can see ghosts of dead people.",
      "runtime": 107
    },
    {
      "name": "Fast Five",
      "size": 626137675,
      "keywords": [
        "brazil",
        "fbi",
        "freedom",
        "escape from prison",
        "car crash",
        "heist",
        "organized crime",
        "on the run",
        "money",
        "fugitive",
        "police chase",
        "escaped convict",
        "car",
        "imax",
        "automobile racing",
        "duringcreditsstinger"
      ],
      "user_rating": 7.1,
      "votes": 2438,
      "release_year": 2011,
      "overview": "Former cop Brian O'Conner partners with ex-con Dom Toretto on the opposite side of the law. Since Brian and Mia Toretto broke Dom out of custody, they've blown across many borders to elude authorities. Now backed into a corner in Rio de Janeiro, they must pull one last job in order to gain their freedom.",
      "runtime": 130
    },
    {
      "name": "Casino Royale",
      "size": 599045960,
      "keywords": [
        "italy",
        "poker",
        "casino",
        "terrorist",
        "banker",
        "money",
        "free running",
        "torture",
        "british secret service",
        "montenegro"
      ],
      "user_rating": 7.3,
      "votes": 3855,
      "release_year": 2006,
      "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond – on his maiden mission as a 00 Agent – to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
      "runtime": 144
    },
    {
      "name": "War of the Worlds",
      "size": 591739379,
      "keywords": [
        "post traumatic stress  disorder",
        "new jersey",
        "airplane",
        "dystopia",
        "daughter",
        "apocalypse",
        "alien invasion",
        "human subjugation"
      ],
      "user_rating": 6.2,
      "votes": 2322,
      "release_year": 2005,
      "overview": "Ray Ferrier is a divorced dockworker and less-than-perfect father. Soon after his ex-wife and her new husband drop of his teenage son and young daughter for a rare weekend visit, a strange and powerful lightning storm touches down.",
      "runtime": 116
    },
    {
      "name": "Quantum of Solace",
      "size": 586090727,
      "keywords": [
        "killing",
        "undercover",
        "secret agent",
        "british secret service"
      ],
      "user_rating": 6.1,
      "votes": 2965,
      "release_year": 2008,
      "overview": "Quantum of Solace continues the adventures of James Bond after Casino Royale. Betrayed by Vesper, the woman he loved, 007 fights the urge to make his latest mission personal. Pursuing his determination to uncover the truth, Bond and M interrogate Mr. White, who reveals that the organization that blackmailed Vesper is far more complex and dangerous than anyone had imagined.",
      "runtime": 106
    },
    {
      "name": "I Am Legend",
      "size": 585349010,
      "keywords": [
        "saving the world",
        "lost civilisation",
        "post-apocalyptic",
        "dystopia",
        "matter of life and death",
        "alone",
        "helplessness",
        "virus",
        "pandemic"
      ],
      "user_rating": 6.9,
      "votes": 4853,
      "release_year": 2007,
      "overview": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
      "runtime": 101
    },
    {
      "name": "Fifty Shades of Grey",
      "size": 571006128,
      "keywords": [
        "based on novel",
        "perversion",
        "spanking",
        "billionaire",
        "bdsm",
        "woman director"
      ],
      "user_rating": 5.2,
      "votes": 3254,
      "release_year": 2015,
      "overview": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
      "runtime": 125
    },
    {
      "name": "Armageddon",
      "size": 553799566,
      "keywords": [
        "saving the world",
        "paris",
        "moon",
        "cataclysm",
        "asteroid",
        "self sacrifice",
        "nasa",
        "space marine",
        "loss of father",
        "daughter",
        "space",
        "wedding",
        "astronaut",
        "eiffel tower paris",
        "duringcreditsstinger",
        "disaster movie",
        "space centre"
      ],
      "user_rating": 6.4,
      "votes": 2482,
      "release_year": 1998,
      "overview": "When an asteroid threatens to collide with Earth, NASA honcho Dan Truman determines the only way to stop it is to drill into its surface and detonate a nuclear bomb. This leads him to renowned driller Harry Stamper, who agrees to helm the dangerous space mission provided he can bring along his own hotshot crew. Among them is the cocksure A.J. who Harry thinks isn't good enough for his daughter, until the mission proves otherwise.",
      "runtime": 151
    },
    {
      "name": "Mission: Impossible II",
      "size": 546388105,
      "keywords": [
        "terror",
        "spain",
        "cia",
        "helicopter",
        "secret identity",
        "skyscraper",
        "undercover",
        "island",
        "ex-lover",
        "secret mission",
        "dying and death",
        "secret agent",
        "computer",
        "duel",
        "lethal virus",
        "violence",
        "rescue team",
        "agent",
        "car",
        "research laboratory"
      ],
      "user_rating": 5.9,
      "votes": 1928,
      "release_year": 2000,
      "overview": "With computer genius Luther Stickell at his side and a beautiful thief on his mind, agent Ethan Hunt races across Australia and Spain to stop a former IMF agent from unleashing a genetically engineered biological weapon called Chimera. This mission, should Hunt choose to accept it, plunges him into the center of an international crisis of terrifying magnitude.",
      "runtime": 123
    },
    {
      "name": "The Day After Tomorrow",
      "size": 544272402,
      "keywords": [
        "saving the world",
        "library",
        "cataclysm",
        "climate change",
        "greenhouse effect",
        "tornado",
        "twister",
        "hurricane",
        "hail",
        "temperature drop",
        "ice age",
        "polar zone",
        "meteorology",
        "gulfstream",
        "barrier ice",
        "ice melting",
        "third world",
        "exodus",
        "evacuation",
        "climate",
        "government",
        "snow",
        "los angeles",
        "scientist",
        "doomsday",
        "antarctic",
        "disaster movie"
      ],
      "user_rating": 6.2,
      "votes": 2392,
      "release_year": 2004,
      "overview": "After years of increases in the greenhouse effect,  havoc is wreaked globally in the form of catastrophic hurricanes, tornadoes, tidal waves, floods and the beginning of a new Ice Age. Paleoclimatologist, Jack Hall tries to warn the world while also shepherding to safety his son, trapped in New York after the city is overwhelmed by the start of the new big freeze.",
      "runtime": 124
    },
    {
      "name": "The Revenant",
      "size": 532950503,
      "keywords": [
        "father son relationship",
        "rape",
        "based on novel",
        "mountains",
        "winter",
        "grizzly bear",
        "wilderness",
        "frontier",
        "revenge",
        "murder",
        "native american",
        "survival",
        "bear",
        "snow",
        "violence",
        "animal death",
        "bear attack",
        "death of son",
        "based on true events",
        "fur trapper"
      ],
      "user_rating": 7.3,
      "votes": 6396,
      "release_year": 2015,
      "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
      "runtime": 156
    },
    {
      "name": "World War Z",
      "size": 531865000,
      "keywords": [
        "dystopia",
        "apocalypse",
        "zombie",
        "nuclear weapons",
        "multiple perspectives",
        "zombie apocalypse"
      ],
      "user_rating": 6.7,
      "votes": 5560,
      "release_year": 2013,
      "overview": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.",
      "runtime": 116
    },
    {
      "name": "Terminator 2: Judgment Day",
      "size": 520000000,
      "keywords": [
        "cyborg",
        "shotgun",
        "post-apocalyptic",
        "dystopia",
        "moral ambiguity",
        "mental institution",
        "violence",
        "fictional war",
        "morphing",
        "nuclear weapons",
        "shape shifter",
        "savior",
        "catch phrase"
      ],
      "user_rating": 7.7,
      "votes": 4185,
      "release_year": 1991,
      "overview": "Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the resistance, is the target for a newer, more deadly terminator. Once again, the resistance has managed to send a protector back to attempt to save John and his mother Sarah.",
      "runtime": 137
    },
    {
      "name": "Ghost",
      "size": 505000000,
      "keywords": [
        "corruption",
        "fortune teller",
        "money transfer",
        "money laundering",
        "pottery",
        "afterlife",
        "spiritism"
      ],
      "user_rating": 6.9,
      "votes": 1339,
      "release_year": 1990,
      "overview": "Sam Wheat is a banker, Molly Jensen is an artist, and the two are madly in love. However, when Sam is murdered by his friend and corrupt business partner Carl Bruner over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown to set things right and protect Molly from Carl and his goons.",
      "runtime": 127
    },
    {
      "name": "Rise of the Planet of the Apes",
      "size": 482860185,
      "keywords": [
        "intelligence",
        "zoo",
        "cage",
        "dystopia",
        "golden gate bridge",
        "ape",
        "monkey",
        "medical research",
        "alzheimer's disease"
      ],
      "user_rating": 7,
      "votes": 4347,
      "release_year": 2011,
      "overview": "Scientist Will Rodman is determined to find a cure for Alzheimer's, the disease which has slowly consumed his father. Will feels certain he is close to a breakthrough and tests his latest serum on apes, noticing dramatic increases in intelligence and brain activity in the primate subjects – especially Caesar, his pet chimpanzee.",
      "runtime": 105
    },
    {
      "name": "Mr. & Mrs. Smith",
      "size": 478207520,
      "keywords": [
        "bomb",
        "assassin",
        "secret identity",
        "secret",
        "assault rifle",
        "gun",
        "married couple",
        "hitman",
        "decoy",
        "marriage crisis",
        "marriage",
        "job",
        "dysfunctional marriage",
        "gunfight",
        "bullet wound"
      ],
      "user_rating": 6.5,
      "votes": 2965,
      "release_year": 2005,
      "overview": "After five (or six) years of vanilla-wedded bliss, ordinary suburbanites John and Jane Smith are stuck in a huge rut. Unbeknownst to each other, they are both coolly lethal, highly-paid assassins working for rival organisations. When they discover they're each other's next target, their secret lives collide in a spicy, explosive mix of wicked comedy, pent-up passion, nonstop action and high-tech weaponry.",
      "runtime": 120
    },
    {
      "name": "Jaws",
      "size": 470654000,
      "keywords": [
        "fishing",
        "atlantic ocean",
        "bathing",
        "shipwreck",
        "police chief",
        "ferry boat",
        "dying and death",
        "dolly zoom",
        "shark",
        "great white shark",
        "animal horror"
      ],
      "user_rating": 7.5,
      "votes": 2542,
      "release_year": 1975,
      "overview": "An insatiable great white shark terrorizes the townspeople of Amity Island, The police chief, an oceanographer and a grizzled shark hunter seek to destroy the bloodthirsty beast.",
      "runtime": 124
    },
    {
      "name": "San Andreas",
      "size": 470490832,
      "keywords": [
        "california",
        "earthquake",
        "catastrophe",
        "disaster film",
        "3d",
        "san andreas",
        "san andreas california",
        "rescue operation"
      ],
      "user_rating": 6,
      "votes": 2968,
      "release_year": 2015,
      "overview": "In the aftermath of a massive earthquake in California, a rescue-chopper pilot makes a dangerous journey across the state in order to rescue his estranged daughter.",
      "runtime": 114
    },
    {
      "name": "X-Men: The Last Stand",
      "size": 459359555,
      "keywords": [
        "mutant",
        "marvel comic",
        "based on comic book",
        "superhuman",
        "beast",
        "cyclops",
        "aftercreditsstinger"
      ],
      "user_rating": 6.3,
      "votes": 3525,
      "release_year": 2006,
      "overview": "When a cure is found to treat mutations, lines are drawn amongst the X-Men and The Brotherhood, a band of powerful mutants organized under Xavier's former ally, Magneto.",
      "runtime": 104
    },
    {
      "name": "Mission: Impossible",
      "size": 457696359,
      "keywords": [
        "paris",
        "london england",
        "spy",
        "cia",
        "terrorist",
        "secret identity",
        "undercover",
        "arms deal",
        "headquarter",
        "secret base",
        "secret mission",
        "prague",
        "embassy",
        "secret agent",
        "tgv",
        "computer",
        "mission",
        "based on tv series",
        "espionage",
        "agent"
      ],
      "user_rating": 6.7,
      "votes": 2631,
      "release_year": 1996,
      "overview": "When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the No. 1 suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.",
      "runtime": 110
    },
    {
      "name": "Ocean's Eleven",
      "size": 450717150,
      "keywords": [
        "prison",
        "pickpocket",
        "strip club",
        "con artist",
        "atlantic city",
        "cockney accent",
        "las vegas",
        "card dealer",
        "explosives expert",
        "black and white scene",
        "male",
        "salt lake city utah"
      ],
      "user_rating": 7.2,
      "votes": 3783,
      "release_year": 2001,
      "overview": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
      "runtime": 116
    },
    {
      "name": "The Bourne Ultimatum",
      "size": 442824138,
      "keywords": [
        "paris",
        "corruption",
        "madrid",
        "assassin",
        "based on novel",
        "europe",
        "prosecution",
        "dangerous",
        "false identity",
        "revelation",
        "government",
        "weapon",
        "interpol",
        "sequel",
        "conspiracy",
        "shootout",
        "espionage",
        "motorcycle",
        "violence",
        "foot chase",
        "moskow",
        "dark past",
        "langley virginia",
        "flashback",
        "chase on the roof",
        "security leak"
      ],
      "user_rating": 7.3,
      "votes": 2888,
      "release_year": 2007,
      "overview": "Bourne is brought out of hiding once again by reporter Simon Ross who is trying to unveil Operation Blackbriar, an upgrade to Project Treadstone, in a series of newspaper columns. Information from the reporter stirs a new set of memories, and Bourne must finally uncover his dark past while dodging The Company's best efforts to eradicate him.",
      "runtime": 115
    },
    {
      "name": "The Exorcist",
      "size": 441306145,
      "keywords": [
        "exorcism",
        "holy water",
        "religion and supernatural",
        "vomit",
        "christian",
        "possession",
        "profanity",
        "priest",
        "ouija board",
        "satan",
        "paranormal phenomena",
        "girl",
        "demon",
        "strong language",
        "disturbed child",
        "crisis of faith",
        "sfx"
      ],
      "user_rating": 7.5,
      "votes": 2005,
      "release_year": 1973,
      "overview": "12-year-old Regan MacNeil begins to adapt an explicit new personality as strange events befall the local area of Georgetown. Her mother becomes torn between science and superstition in a desperate bid to save her daughter, and ultimately turns to her last hope: Father Damien Karras, a troubled priest who is struggling with his own faith.",
      "runtime": 122
    },
    {
      "name": "Terminator Genisys",
      "size": 440603537,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "cyborg",
        "killer robot",
        "future",
        "time travel",
        "dystopia",
        "sequel",
        "fiction",
        "duringcreditsstinger",
        "3d"
      ],
      "user_rating": 5.8,
      "votes": 3631,
      "release_year": 2015,
      "overview": "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever.",
      "runtime": 126
    },
    {
      "name": "Terminator 3: Rise of the Machines",
      "size": 435000000,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "man vs machine",
        "cyborg",
        "killer robot",
        "sun glasses",
        "leather jacket",
        "nanotechnology",
        "rocket launcher",
        "firemen",
        "veterinarian",
        "fire engine",
        "dystopia",
        "psychiatrist"
      ],
      "user_rating": 5.9,
      "votes": 2143,
      "release_year": 2003,
      "overview": "It's been 10 years since John Connor saved Earth from Judgment Day, and he's now living under the radar, steering clear of using anything Skynet can trace. That is, until he encounters T-X, a robotic assassin ordered to finish what T-1000 started. Good thing Connor's former nemesis, the Terminator, is back to aid the now-adult Connor … just like he promised.",
      "runtime": 109
    },
    {
      "name": "Die Another Day",
      "size": 431971116,
      "keywords": [
        "laser",
        "british secret service",
        "secret service agent",
        "space based weapon"
      ],
      "user_rating": 5.8,
      "votes": 1092,
      "release_year": 2002,
      "overview": "Bond takes on a North Korean leader who undergoes DNA replacement procedures that allow him to assume different identities. American agent, Jinx Johnson assists Bond in his attempt to thwart the villain's plans to exploit a satellite that is powered by solar energy.",
      "runtime": 133
    },
    {
      "name": "The Matrix Revolutions",
      "size": 424988211,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "man vs machine",
        "flying",
        "philosophy",
        "fortune teller",
        "kung fu",
        "underground world",
        "killer robot",
        "temple",
        "subway",
        "dream",
        "sun",
        "hero",
        "fight",
        "sunlight",
        "computer virus",
        "key",
        "future",
        "precognition",
        "super computer",
        "machine town",
        "ying yang",
        "dying and death",
        "virtual reality",
        "dystopia",
        "computer",
        "faith",
        "world religion",
        "truth",
        "rescue",
        "mission",
        "cyberpunk",
        "woman director",
        "yin yang",
        "gnosticism"
      ],
      "user_rating": 6.4,
      "votes": 3096,
      "release_year": 2003,
      "overview": "The human city of Zion defends itself against the massive invasion of the machines as Neo fights to end the war at another front while also opposing the rogue Agent Smith.",
      "runtime": 129
    },
    {
      "name": "Jason Bourne",
      "size": 415484914,
      "keywords": [
        "assassin",
        "amnesia",
        "flashback"
      ],
      "user_rating": 5.9,
      "votes": 2341,
      "release_year": 2016,
      "overview": "The most dangerous former operative of the CIA is drawn out of hiding to uncover hidden truths about his past.",
      "runtime": 123
    },
    {
      "name": "The Bodyguard",
      "size": 411006740,
      "keywords": [
        "sister sister relationship",
        "anonymous letter",
        "diva",
        "bodyguard",
        "oscar award",
        "los angeles"
      ],
      "user_rating": 6.1,
      "votes": 661,
      "release_year": 1992,
      "overview": "A former Secret Service agent grudgingly takes an assignment to protect a pop idol who's threatened by a crazed fan. At first, the safety-obsessed bodyguard and the self-indulgent diva totally clash. But before long, all that tension sparks fireworks of another sort, and the love-averse tough guy is torn between duty and romance.",
      "runtime": 129
    },
    {
      "name": "Signs",
      "size": 408247917,
      "keywords": [
        "symbolism",
        "water",
        "farm",
        "faith",
        "alien",
        "family relationships",
        "rural setting",
        "alien invasion",
        "rural",
        "crop circle",
        "alien attack",
        "rural pennsylvania",
        "rural america",
        "rural farm",
        "loss of faith",
        "alien encounter"
      ],
      "user_rating": 6.4,
      "votes": 1599,
      "release_year": 2002,
      "overview": "A family living on a farm finds mysterious crop circles in their fields which suggests something more frightening to come.",
      "runtime": 106
    },
    {
      "name": "X2",
      "size": 407711549,
      "keywords": [
        "mutant",
        "marvel comic",
        "superhero",
        "based on comic book",
        "superhuman"
      ],
      "user_rating": 6.8,
      "votes": 3506,
      "release_year": 2003,
      "overview": "Professor Charles Xavier and his team of genetically gifted superheroes face a rising tide of anti-mutant sentiment led by Col. William Stryker. Storm, Wolverine and Jean Grey must join their usual nemeses –  Magneto and Mystique – to unhinge Stryker's scheme to exterminate all mutants.",
      "runtime": 133
    },
    {
      "name": "Mission: Impossible III",
      "size": 397850012,
      "keywords": [
        "berlin",
        "cia",
        "vatican",
        "white house",
        "secret identity",
        "secret",
        "explosive",
        "mobile phone",
        "map",
        "traitor",
        "mask",
        "honeymoon",
        "shanghai",
        "pretended murder",
        "secret mission",
        "letter",
        "funeral",
        "covered investigation",
        "to shoot dead",
        "secret agent",
        "video",
        "stamp",
        "hard drive",
        "e-mail",
        "decipherment",
        "suitcase",
        "computer",
        "revenge",
        "murder",
        "mission",
        "hospital",
        "duel",
        "disguise",
        "celebration",
        "good and bad",
        "research laboratory",
        "blast"
      ],
      "user_rating": 6.5,
      "votes": 2028,
      "release_year": 2006,
      "overview": "Retired from active duty to train new IMF agents, Ethan Hunt is called back into action to confront sadistic arms dealer, Owen Davian. Hunt must try to protect his girlfriend while working with his new team to complete the mission.",
      "runtime": 126
    },
    {
      "name": "Live Free or Die Hard",
      "size": 383531464,
      "keywords": [
        "usa",
        "washington d.c.",
        "helicopter",
        "hostage",
        "fbi",
        "kidnapping",
        "hacker",
        "satellite",
        "transport of prisoners",
        "traffic jam",
        "fistfight",
        "ex-cop",
        "sequel",
        "suspense",
        "shootout",
        "explosion",
        "violence",
        "cell phone",
        "car chase",
        "police car",
        "walkie talkie",
        "based on article",
        "cyber terrorism",
        "action hero",
        "power plant"
      ],
      "user_rating": 6.4,
      "votes": 2089,
      "release_year": 2007,
      "overview": "John McClane is back and badder than ever, and this time he's working for Homeland Security. He calls on the services of a young hacker in his bid to stop a ring of Internet terrorists intent on taking control of America's computer infrastructure.",
      "runtime": 128
    },
    {
      "name": "True Lies",
      "size": 378882411,
      "keywords": [
        "spy",
        "terrorist",
        "florida",
        "gun",
        "kidnapping",
        "horseback riding",
        "florida keys",
        "secret agent",
        "terrorist plot",
        "top secret",
        "woman with glasses",
        "hit with a telephone",
        "truth serum",
        "mushroom cloud",
        "jackhammer",
        "key west"
      ],
      "user_rating": 6.8,
      "votes": 1116,
      "release_year": 1994,
      "overview": "Harry Tasker is a secret agent for the United States Government. For years, he has kept his job from his wife, but is forced to reveal his identity and try to stop nuclear terrorists when he and his wife are kidnapped by them.",
      "runtime": 141
    },
    {
      "name": "Mad Max: Fury Road",
      "size": 378858340,
      "keywords": [
        "future",
        "chase",
        "post-apocalyptic",
        "dystopia",
        "australia",
        "rescue",
        "survival",
        "on the run",
        "convoy",
        "peak oil",
        "dark future"
      ],
      "user_rating": 7.2,
      "votes": 9427,
      "release_year": 2015,
      "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.",
      "runtime": 120
    },
    {
      "name": "Taken 2",
      "size": 376141306,
      "keywords": [
        "kidnapping",
        "turkey",
        "police chase",
        "bag over head",
        "violence",
        "fbi agent",
        "teenage daughter",
        "stealing a car",
        "ex-husband ex-wife relationship",
        "albanian",
        "u.s. embassy",
        "killed in an elevator",
        "security guard killed"
      ],
      "user_rating": 6.1,
      "votes": 2757,
      "release_year": 2012,
      "overview": "In Istanbul, retired CIA operative Bryan Mills and his wife are taken hostage by the father of a kidnapper Mills killed while rescuing his daughter.",
      "runtime": 91
    },
    {
      "name": "X-Men Origins: Wolverine",
      "size": 373062864,
      "keywords": [
        "corruption",
        "mutant",
        "boxer",
        "army",
        "marvel comic",
        "superhero",
        "aftercreditsstinger",
        "duringcreditsstinger"
      ],
      "user_rating": 6.2,
      "votes": 4021,
      "release_year": 2009,
      "overview": "After seeking to live a normal life, Logan sets out to avenge the death of his girlfriend by undergoing the mutant Weapon X program and becoming Wolverine.",
      "runtime": 107
    },
    {
      "name": "G.I. Joe: Retaliation",
      "size": 371876278,
      "keywords": [
        "terror",
        "assassin",
        "secret",
        "technology",
        "missile",
        "warhead",
        "president",
        "rescue",
        "conspiracy",
        "explosion",
        "battle",
        "surveillance",
        "cobra"
      ],
      "user_rating": 5.4,
      "votes": 3025,
      "release_year": 2013,
      "overview": "Framed for crimes against the country, the G.I. Joe team is terminated by Presidential order. This forces the G.I. Joes into not only fighting their mortal enemy Cobra; they are forced to contend with threats from within the government that jeopardize their very existence.",
      "runtime": 110
    },
    {
      "name": "Terminator Salvation",
      "size": 371353001,
      "keywords": [
        "saving the world",
        "artificial intelligence",
        "prophecy",
        "san francisco",
        "cyborg",
        "killer robot",
        "gas station",
        "post-apocalyptic",
        "dystopia",
        "army",
        "firearm",
        "wartime",
        "los angeles"
      ],
      "user_rating": 5.9,
      "votes": 2463,
      "release_year": 2009,
      "overview": "All grown up in post-apocalyptic 2018, John Connor must lead the resistance of humans against the increasingly dominating militaristic robots. But when Marcus Wright appears, his existence confuses the mission as Connor tries to determine whether Wright has come from the future or the past -- and whether he's friend or foe.",
      "runtime": 115
    },
    {
      "name": "Gone Girl",
      "size": 369330363,
      "keywords": [
        "based on novel",
        "marriage crisis",
        "disappearance",
        "cheating husband",
        "missing person",
        "search party",
        "criminal lawyer",
        "wife murder",
        "murder suspect",
        "missing wife"
      ],
      "user_rating": 7.9,
      "votes": 5862,
      "release_year": 2014,
      "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
      "runtime": 145
    },
    {
      "name": "The Fugitive",
      "size": 368875760,
      "keywords": [
        "chicago",
        "showdown",
        "undercover",
        "surgeon",
        "death sentence",
        "doomed man",
        "lethal injection",
        "chase",
        "remake",
        "betrayal",
        "on the run",
        "train crash",
        "escape",
        "fugitive",
        "based on tv series",
        "u.s. marshal",
        "doctor",
        "explosion",
        "home invasion",
        "disguise",
        "one armed man",
        "framed for murder",
        "flashback",
        "corrupt cop",
        "manhunt",
        "bus accident",
        "storm drain"
      ],
      "user_rating": 7.2,
      "votes": 1220,
      "release_year": 1993,
      "overview": "Wrongfully accused of murdering his wife, Richard Kimble escapes from the law in an attempt to find her killer and clear his name. Pursuing him is a team of U.S. marshals led by Deputy Samuel Gerard, a determined detective who will not rest until Richard is captured. As Richard leads the team through a series of intricate chases, he discovers the secrets behind his wife's death and struggles to expose the killer before it is too late.",
      "runtime": 130
    },
    {
      "name": "Jurassic Park III",
      "size": 368780809,
      "keywords": [
        "exotic island",
        "dna",
        "paleontology",
        "tyrannosaurus rex",
        "velociraptor",
        "spinosaurus",
        "airplane",
        "rescue",
        "mission",
        "dinosaur",
        "jurassic park"
      ],
      "user_rating": 5.7,
      "votes": 2077,
      "release_year": 2001,
      "overview": "In need of funds for research, Dr. Alan Grant accepts a large sum of money to accompany Paul and Amanda Kirby on an aerial tour of the infamous Isla Sorna. It isn't long before all hell breaks loose and the stranded wayfarers must fight for survival as a host of new -- and even more deadly -- dinosaurs try to make snacks of them.",
      "runtime": 92
    },
    {
      "name": "Die Hard: With a Vengeance",
      "size": 366101666,
      "keywords": [
        "bomb",
        "taxi",
        "riddle",
        "robbery",
        "detective",
        "helicopter",
        "gold",
        "subway",
        "ship",
        "fistfight",
        "police",
        "sequel",
        "deception",
        "shootout",
        "new york city",
        "explosion",
        "violence",
        "car chase",
        "fbi agent",
        "simon says",
        "flashback",
        "dump truck",
        "aqueduct",
        "action hero",
        "federal reserve bank"
      ],
      "user_rating": 6.9,
      "votes": 2066,
      "release_year": 1995,
      "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
      "runtime": 128
    },
    {
      "name": "Ocean's Twelve",
      "size": 362744280,
      "keywords": [
        "sequel",
        "fabergé egg",
        "dutch eastindian company",
        "second",
        "part",
        "golden egg",
        "goon"
      ],
      "user_rating": 6.4,
      "votes": 2124,
      "release_year": 2004,
      "overview": "Danny Ocean reunites with his old flame and the rest of his merry band of thieves in carrying out three huge heists in Rome, Paris and Amsterdam – but a Europol agent is hot on their heels.",
      "runtime": 125
    },
    {
      "name": "Planet of the Apes",
      "size": 362211740,
      "keywords": [
        "gorilla",
        "space marine",
        "space suit",
        "revolution",
        "chimp",
        "slavery",
        "space travel",
        "time travel",
        "dystopia",
        "alien planet",
        "ape",
        "human subjugation"
      ],
      "user_rating": 5.6,
      "votes": 1243,
      "release_year": 2001,
      "overview": "After a spectacular crash-landing on an uncharted planet, brash astronaut Leo Davidson finds himself trapped in a savage world where talking apes dominate the human race. Desperate to find a way home, Leo must evade the invincible gorilla army led by Ruthless General Thade.",
      "runtime": 119
    },
    {
      "name": "The World Is Not Enough",
      "size": 361832400,
      "keywords": [
        "british",
        "mission",
        "oil",
        "heiress",
        "bilbao spain",
        "british secret service"
      ],
      "user_rating": 6,
      "votes": 862,
      "release_year": 1999,
      "overview": "Greed, revenge, world dominance and high-tech terrorism – it's all in a day's work for Bond, who's on a mission to a protect beautiful oil heiress from a notorious terrorist. In a race against time that culminates in a dramatic submarine showdown, Bond works to defuse the international power struggle that has the world's oil supply hanging in the balance.",
      "runtime": 128
    },
    {
      "name": "Minority Report",
      "size": 358372926,
      "keywords": [
        "self-fulfilling prophecy",
        "washington d.c.",
        "evidence",
        "future",
        "hologram",
        "dystopia",
        "murder",
        "neo-noir",
        "future noir"
      ],
      "user_rating": 7.1,
      "votes": 2608,
      "release_year": 2002,
      "overview": "John Anderton is a top 'Precrime' cop in the late-21st century, when technology can predict crimes before they're committed. But Anderton becomes the quarry when another investigator targets him for a murder charge.",
      "runtime": 145
    },
    {
      "name": "Angels & Demons",
      "size": 356613439,
      "keywords": [
        "rome",
        "vatican",
        "based on novel",
        "symbolism",
        "christian",
        "illuminati",
        "quantum mechanics",
        "prequel",
        "anti matter",
        "conspiracy",
        "investigator",
        "catholicism",
        "cern"
      ],
      "user_rating": 6.5,
      "votes": 2129,
      "release_year": 2009,
      "overview": "Harvard symbologist Robert Langdon investigates a mysterious symbol seared into the chest of a murdered physicist. He discovers evidence of the unimaginable, the rebirth of an ancient secret brotherhood known as the Illuminati, the most powerful underground organization ever to walk the earth.",
      "runtime": 138
    },
    {
      "name": "GoldenEye",
      "size": 352194034,
      "keywords": [
        "cuba",
        "falsely accused",
        "secret identity",
        "computer virus",
        "secret base",
        "secret intelligence service",
        "kgb",
        "satellite",
        "special car",
        "cossack",
        "electromagnetic pulse",
        "time bomb",
        "st. petersburg russia",
        "ejection seat",
        "red army"
      ],
      "user_rating": 6.6,
      "votes": 1174,
      "release_year": 1995,
      "overview": "James Bond must unmask the mysterious head of the Janus Syndicate and prevent the leader from utilizing the GoldenEye weapons system to inflict devastating revenge on Britain.",
      "runtime": 130
    },
    {
      "name": "The Maze Runner",
      "size": 348319861,
      "keywords": [
        "based on novel",
        "maze",
        "post-apocalyptic",
        "dystopia",
        "escape",
        "memory loss",
        "erased memory",
        "trapped",
        "dystopic future",
        "runner",
        "based on young adult novel"
      ],
      "user_rating": 7,
      "votes": 5371,
      "release_year": 2014,
      "overview": "Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow \"runners\" for a shot at escape.",
      "runtime": 113
    },
    {
      "name": "National Treasure",
      "size": 347451894,
      "keywords": [
        "riddle",
        "treasure",
        "treasure hunt",
        "archaeologist",
        "archeology "
      ],
      "user_rating": 6.4,
      "votes": 1926,
      "release_year": 2004,
      "overview": "Modern treasure hunters, led by archaeologist Ben Gates, search for a chest of riches rumored to have been stashed away by George Washington, Thomas Jefferson and Benjamin Franklin during the Revolutionary War. The chest's whereabouts may lie in secret clues embedded in the Constitution and the Declaration of Independence, and Gates is in a race to find the gold before his enemies do.",
      "runtime": 131
    },
    {
      "name": "Rush Hour 2",
      "size": 347325802,
      "keywords": [
        "duringcreditsstinger"
      ],
      "user_rating": 6.4,
      "votes": 1054,
      "release_year": 2001,
      "overview": "It's vacation time for Carter as he finds himself alongside Lee in Hong Kong wishing for more excitement. While Carter wants to party and meet the ladies, Lee is out to track down a Triad gang lord who may be responsible for killing two men at the American Embassy. Things get complicated as the pair stumble onto a counterfeiting plot. The boys are soon up to their necks in fist fights and life-threatening situations. A trip back to the U.S. may provide the answers about the bombing, the counterfeiting, and the true allegiance of sexy customs agent Isabella.",
      "runtime": 90
    },
    {
      "name": "The Rock",
      "size": 335062621,
      "keywords": [
        "san francisco",
        "fbi",
        "gas attack",
        "alcatraz",
        "hostage situation",
        "fbi agent"
      ],
      "user_rating": 6.9,
      "votes": 1456,
      "release_year": 1996,
      "overview": "A group of renegade marine commandos seizes a stockpile of chemical weapons and takes over Alcatraz, with 81 tourists as hostages. Their leader demands $100 million to be paid, as restitution to families of Marines who died in covert ops – or he will launch 15 rockets carrying deadly VX gas into the San Francisco Bay area.",
      "runtime": 136
    },
    {
      "name": "Now You See Me 2",
      "size": 334901337,
      "keywords": [
        "london england",
        "china",
        "magic",
        "secret society",
        "vigilante",
        "sequel",
        "revenge",
        "heist",
        "on the run",
        "macau china",
        "magician"
      ],
      "user_rating": 6.7,
      "votes": 3235,
      "release_year": 2016,
      "overview": "One year after outwitting the FBI and winning the public’s adulation with their mind-bending spectacles, the Four Horsemen resurface only to find themselves face to face with a new enemy who enlists them to pull off their most dangerous heist yet.",
      "runtime": 129
    },
    {
      "name": "The Curious Case of Benjamin Button",
      "size": 333932083,
      "keywords": [
        "diary",
        "navy",
        "funeral",
        "tea",
        "travel",
        "hospital"
      ],
      "user_rating": 7.3,
      "votes": 3292,
      "release_year": 2008,
      "overview": "Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences.",
      "runtime": 166
    },
    {
      "name": "Tomorrow Never Dies",
      "size": 333011068,
      "keywords": [
        "london england",
        "england",
        "spy",
        "china",
        "news broadcast",
        "intelligence",
        "television",
        "missile",
        "manipulation of the media",
        "secret intelligence service",
        "special car",
        "tv station",
        "media tycoon",
        "navy",
        "motorcycle",
        "secret service",
        "hamburg germany"
      ],
      "user_rating": 6,
      "votes": 925,
      "release_year": 1997,
      "overview": "A deranged media mogul is staging international incidents to pit the world's superpowers against each other. Now 007 must take on this evil mastermind in an adrenaline-charged battle to end his reign of terror and prevent global pandemonium.",
      "runtime": 119
    },
    {
      "name": "Black Swan",
      "size": 327803731,
      "keywords": [
        "dancing",
        "competition",
        "sex",
        "dancer",
        "obsession",
        "paranoia",
        "insanity",
        "suspense",
        "ballet",
        "new york city",
        "heartbreak",
        "mental illness",
        "madness",
        "swan lake",
        "ballerina",
        "body horror"
      ],
      "user_rating": 7.3,
      "votes": 4430,
      "release_year": 2010,
      "overview": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.",
      "runtime": 108
    },
    {
      "name": "Se7en",
      "size": 327311859,
      "keywords": [
        "self-fulfilling prophecy",
        "detective",
        "s.w.a.t.",
        "drug dealer",
        "evisceration",
        "lust and impulsiveness",
        "rage and hate",
        "pride and vanity",
        "immoderateness",
        "insomnia",
        "investigation",
        "pension",
        "police",
        "serial killer"
      ],
      "user_rating": 8.1,
      "votes": 5765,
      "release_year": 1995,
      "overview": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
      "runtime": 127
    },
    {
      "name": "Taken 3",
      "size": 325771424,
      "keywords": [
        "revenge",
        "murder",
        "on the run",
        "fugitive",
        "framed",
        "father daughter relationship",
        "framed for murder"
      ],
      "user_rating": 6.1,
      "votes": 2200,
      "release_year": 2014,
      "overview": "Ex-government operative Bryan Mills finds his life is shattered when he's falsely accused of a murder that hits close to home. As he's pursued by a savvy police inspector, Mills employs his particular set of skills to track the real killer and exact his unique brand of justice.",
      "runtime": 109
    },
    {
      "name": "Lethal Weapon 3",
      "size": 321731527,
      "keywords": [
        "rookie cop",
        "dog biscuit",
        "shooting practice",
        "sitting on a toilet",
        "judo throw",
        "police psychologist",
        "buddy cop",
        "firing range",
        "aftercreditsstinger"
      ],
      "user_rating": 6.4,
      "votes": 811,
      "release_year": 1992,
      "overview": "Archetypal buddy cops Riggs and Murtaugh are back for another round of high-stakes action, this time setting their collective sights on bringing down a former Los Angeles police lieutenant turned black market weapons dealer. Lorna Cole joins as the beautiful yet hardnosed internal affairs sergeant who catches Riggs's eye.",
      "runtime": 118
    },
    {
      "name": "Fatal Attraction",
      "size": 320145693,
      "keywords": [
        "sexual obsession",
        "wife husband relationship",
        "deceived wife",
        "marriage crisis",
        "suspense",
        "lawyer",
        "extramarital affair",
        "erotic movie"
      ],
      "user_rating": 6.6,
      "votes": 291,
      "release_year": 1987,
      "overview": "A married man's one night stand comes back to haunt him when that lover begins to stalk him and his family.",
      "runtime": 119
    },
    {
      "name": "Inglourious Basterds",
      "size": 319131050,
      "keywords": [
        "paris",
        "guerrilla",
        "cinema",
        "self sacrifice",
        "dynamite",
        "mexican standoff",
        "world war ii",
        "jew persecution",
        "jew",
        "nazis",
        "masochism",
        "sadism",
        "scalp",
        "winston churchill",
        "knife in hand",
        "anti semitism",
        "gore",
        "swastika",
        "blood bath",
        "german occupation of france",
        "violence",
        "gun violence"
      ],
      "user_rating": 7.9,
      "votes": 6430,
      "release_year": 2009,
      "overview": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
      "runtime": 153
    },
    {
      "name": "The Conjuring",
      "size": 318000141,
      "keywords": [
        "sister sister relationship",
        "exorcism",
        "rhode island",
        "based on true story",
        "farmhouse",
        "paranormal investigation",
        "ghost",
        "supernatural power",
        "paranormal investigator",
        "annabelle"
      ],
      "user_rating": 7.4,
      "votes": 3092,
      "release_year": 2013,
      "overview": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.",
      "runtime": 112
    },
    {
      "name": "Air Force One",
      "size": 315156409,
      "keywords": [
        "prison",
        "corruption",
        "journalist",
        "white house",
        "hostage",
        "ultimatum",
        "hostage-taking",
        "air force one",
        "aerial combat",
        "conspiracy",
        "gunfight",
        "fighter plane",
        "secret service",
        "american president",
        "hand to hand combat",
        "negotiation",
        "political prisoner",
        "airplane hijack"
      ],
      "user_rating": 6.2,
      "votes": 840,
      "release_year": 1997,
      "overview": "Russian terrorists conspire to hijack the aircraft with the president and his family on board. The commander in chief finds himself facing an impossible predicament: give in to the terrorists and sacrifice his family, or risk everything to uphold his principles - and the integrity of the nation.",
      "runtime": 124
    },
    {
      "name": "The Expendables 2",
      "size": 312573423,
      "keywords": [
        "airplane",
        "number in title",
        "airplane crash",
        "violence",
        "beard",
        "ensemble cast",
        "loss of friend",
        "wisecrack humor",
        "airport lounge",
        "asian woman"
      ],
      "user_rating": 6.1,
      "votes": 2896,
      "release_year": 2012,
      "overview": "Mr. Church reunites the Expendables for what should be an easy paycheck, but when one of their men is murdered on the job, their quest for revenge puts them deep in enemy territory and up against an unexpected threat.",
      "runtime": 103
    },
    {
      "name": "Ocean's Thirteen",
      "size": 311312624,
      "keywords": [
        "casino",
        "thief",
        "revenge",
        "heist",
        "las vegas",
        "pretending to be rich",
        "labor strike"
      ],
      "user_rating": 6.5,
      "votes": 1999,
      "release_year": 2007,
      "overview": "Danny Ocean's team of criminals are back and composing a plan more personal than ever. When ruthless casino owner Willy Bank doublecrosses Reuben Tishkoff, causing a heart attack, Danny Ocean vows that he and his team will do anything to bring down Willy Bank along with everything he's got. Even if it means asking for help from an enemy.",
      "runtime": 122
    },
    {
      "name": "Ransom",
      "size": 309492681,
      "keywords": [
        "bounty",
        "loss of child",
        "yellow press",
        "fbi",
        "baby-snatching",
        "suspense",
        "fbi agent",
        "millionaire"
      ],
      "user_rating": 6.4,
      "votes": 470,
      "release_year": 1996,
      "overview": "When a rich man's son is kidnapped, he cooperates with the police at first but then tries a unique tactic against the criminals.",
      "runtime": 117
    },
    {
      "name": "A Good Day to Die Hard",
      "size": 304654182,
      "keywords": [
        "bomb",
        "cia",
        "russia",
        "escape",
        "courthouse",
        "rogue",
        "moscow"
      ],
      "user_rating": 5.2,
      "votes": 3493,
      "release_year": 2013,
      "overview": "Iconoclastic, take-no-prisoners cop John McClane, finds himself for the first time on foreign soil after traveling to Moscow to help his wayward son Jack - unaware that Jack is really a highly-trained CIA operative out to stop a nuclear weapons heist. With the Russian underworld in pursuit, and battling a countdown to war, the two McClanes discover that their opposing methods make them unstoppable heroes.",
      "runtime": 98
    },
    {
      "name": "Battleship",
      "size": 303025485,
      "keywords": [
        "fight",
        "u.s. navy",
        "mind reading",
        "hong kong",
        "soccer",
        "scientist",
        "fictional war",
        "naval",
        "armada",
        "battleship",
        "naval combat",
        "jds myoko",
        "lost communication",
        "taser",
        "buoy",
        "communications expert",
        "joint chiefs of staff",
        "crash landing",
        "jet fighter pilot",
        "navy lieutenant",
        "permission to marry",
        "uss john paul jones",
        "based on board game",
        "aftercreditsstinger",
        "mighty mo",
        "uss missouri"
      ],
      "user_rating": 5.5,
      "votes": 2114,
      "release_year": 2012,
      "overview": "When mankind beams a radio signal into space, a reply comes from ‘Planet G’, in the form of several alien crafts that splash down in the waters off Hawaii. Lieutenant Alex Hopper is a weapons officer assigned to the USS John Paul Jones, part of an international naval coalition which becomes the world's last hope for survival as they engage the hostile alien force of unimaginable strength. While taking on the invaders, Hopper must also try to live up to the potential his brother, and his fiancée's father, Admiral Shane, expect of him.",
      "runtime": 131
    },
    {
      "name": "G.I. Joe: The Rise of Cobra",
      "size": 302469017,
      "keywords": [
        "terrorist",
        "secret",
        "hostage",
        "technology",
        "warhead",
        "government",
        "president",
        "revenge",
        "murder",
        "attack",
        "explosion",
        "scientist",
        "lasers",
        "evil",
        "cobra"
      ],
      "user_rating": 5.6,
      "votes": 1962,
      "release_year": 2009,
      "overview": "From the Egyptian desert to deep below the polar ice caps, the elite G.I. JOE team uses the latest in next-generation spy and military equipment to fight the corrupt arms dealer Destro and the growing threat of the mysterious Cobra organization to prevent them from plunging the world into chaos.",
      "runtime": 118
    },
    {
      "name": "Rambo: First Blood Part II",
      "size": 300400432,
      "keywords": [
        "usa",
        "vietnam veteran",
        "submachine gun",
        "prisoner",
        "prisoners of war",
        "liberation of prisoners",
        "liberation",
        "vietnam",
        "vietnam war",
        "chase",
        "machinegun",
        "u.s. army",
        "forest",
        "photography",
        "government",
        "war",
        "revenge",
        "soldier",
        "agent",
        "denunciation"
      ],
      "user_rating": 6.3,
      "votes": 864,
      "release_year": 1985,
      "overview": "John Rambo is released from prison by the government for a top-secret covert mission to the last place on Earth he'd want to return - the jungles of Vietnam.",
      "runtime": 96
    },
    {
      "name": "Insurgent",
      "size": 295238201,
      "keywords": [
        "based on novel",
        "revolution",
        "dystopia",
        "sequel",
        "dystopic future",
        "young adult",
        "3d",
        "divergent"
      ],
      "user_rating": 6.2,
      "votes": 3829,
      "release_year": 2015,
      "overview": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart.",
      "runtime": 119
    },
    {
      "name": "Shutter Island",
      "size": 294804195,
      "keywords": [
        "based on novel",
        "island",
        "hurricane",
        "investigation",
        "psychiatric hospital",
        "u.s. marshal",
        "conspiracy theory",
        "1950s"
      ],
      "user_rating": 7.8,
      "votes": 6336,
      "release_year": 2010,
      "overview": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by his troubling visions and also by a mysterious doctor.",
      "runtime": 138
    },
    {
      "name": "Salt",
      "size": 293329073,
      "keywords": [
        "assassination",
        "spy",
        "cia",
        "kidnapping",
        "cold war",
        "soviet union",
        "double agent",
        "race against time",
        "revenge",
        "on the run",
        "shootout",
        "espionage",
        "female protagonist",
        "hitwoman",
        "terrorism",
        "violence",
        "russian spy",
        "intelligence officer",
        "action heroine"
      ],
      "user_rating": 6.2,
      "votes": 2093,
      "release_year": 2010,
      "overview": "As a CIA officer, Evelyn Salt swore an oath to duty, honor and country. Her loyalty will be tested when a defector accuses her of being a Russian spy. Salt goes on the run, using all her skills and years of experience as a covert operative to elude capture. Salt's efforts to prove her innocence only serve to cast doubt on her motives, as the hunt to uncover the truth behind her identity continues and the question remains: \"Who is Salt?\"",
      "runtime": 100
    },
    {
      "name": "The Departed",
      "size": 289847354,
      "keywords": [
        "undercover",
        "boston",
        "police",
        "friends",
        "mafia",
        "undercover cop",
        "mobster",
        "mole",
        "state police",
        "police training",
        "realtor"
      ],
      "user_rating": 7.9,
      "votes": 4339,
      "release_year": 2006,
      "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
      "runtime": 151
    },
    {
      "name": "Fantastic 4: Rise of the Silver Surfer",
      "size": 289047763,
      "keywords": [
        "fire",
        "helicopter",
        "surfboard",
        "mask",
        "satellite",
        "airplane",
        "transformation",
        "forest",
        "resurrection",
        "marvel comic",
        "sequel",
        "superhero",
        "based on comic book",
        "outer space",
        "wedding",
        "explosion",
        "scientist",
        "interrogation",
        "double cross",
        "fantastic four",
        "military",
        "earth in peril",
        "superhuman strength",
        "duringcreditsstinger",
        "invisibility",
        "silver surfer",
        "forcefield",
        "elasticity",
        "absorbing power"
      ],
      "user_rating": 5.4,
      "votes": 2589,
      "release_year": 2007,
      "overview": "The Fantastic Four return to the big screen as a new and all powerful enemy threatens the Earth. The seemingly unstoppable 'Silver Surfer', but all is not what it seems and there are old and new enemies that pose a greater threat than the intrepid superheroes realize.",
      "runtime": 92
    },
    {
      "name": "The Bourne Supremacy",
      "size": 288500217,
      "keywords": [
        "berlin",
        "assassin",
        "based on novel",
        "amnesia",
        "sniper",
        "lie",
        "sequel",
        "suspense",
        "on the run",
        "shootout",
        "espionage",
        "violence",
        "foot chase",
        "car chase",
        "exploding house",
        "though guy",
        "one against many",
        "rail car",
        "dark past",
        "moscow",
        "hand to hand combat"
      ],
      "user_rating": 7.2,
      "votes": 2825,
      "release_year": 2004,
      "overview": "When a CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive.",
      "runtime": 108
    },
    {
      "name": "Elysium",
      "size": 286140700,
      "keywords": [
        "dystopia",
        "space station",
        "class conflict"
      ],
      "user_rating": 6.4,
      "votes": 3439,
      "release_year": 2013,
      "overview": "In the year 2159, two classes of people exist: the very wealthy who live on a pristine man-made space station called Elysium, and the rest, who live on an overpopulated, ruined Earth. Secretary Rhodes (Jodie Foster), a hard line government ofﬁcial, will stop at nothing to enforce anti-immigration laws and preserve the luxurious lifestyle of the citizens of Elysium. That doesn’t stop the people of Earth from trying to get in, by any means they can. When unlucky Max (Matt Damon) is backed into a corner, he agrees to take on a daunting mission that, if successful, will not only save his life, but could bring equality to these polarized worlds.",
      "runtime": 109
    },
    {
      "name": "Lethal Weapon 4",
      "size": 285444603,
      "keywords": [
        "lapd",
        "house on fire",
        "revolver"
      ],
      "user_rating": 6.3,
      "votes": 767,
      "release_year": 1998,
      "overview": "In the combustible action franchise's final installment, maverick detectives Martin Riggs and Roger Murtaugh square off against Asian mobster Wah Sing Ku, who's up to his neck in slave trading and counterfeit currency. With help from gumshoe Leo Getz and smart-aleck rookie cop Lee Butters, Riggs and Murtaugh aim to take down Ku and his gang.",
      "runtime": 127
    },
    {
      "name": "The Tourist",
      "size": 278731369,
      "keywords": [
        "paris",
        "hotel",
        "false identity",
        "undercover agent",
        "romance"
      ],
      "user_rating": 6,
      "votes": 1699,
      "release_year": 2010,
      "overview": "American tourist Frank (Johnny Depp) meets mysterious British woman Elsie (Angelina Jolie) on the train to Venice. Romance seems to bud, but there's more to her than meets the eye. Remake of the 2005 French film \"Anthony Zimmer\", written and directed by Jérôme Salle.",
      "runtime": 103
    },
    {
      "name": "xXx",
      "size": 277448382,
      "keywords": [
        "sports car",
        "biological weapon",
        "cold war",
        "russian",
        "prague",
        "mission",
        "athlete",
        "nsa agent",
        "adrenaline junkie",
        "thrill seeker"
      ],
      "user_rating": 5.8,
      "votes": 1424,
      "release_year": 2002,
      "overview": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
      "runtime": 124
    },
    {
      "name": "The Bourne Legacy",
      "size": 276572938,
      "keywords": [
        "assassin",
        "wolf",
        "maryland",
        "suicide by gunshot",
        "rooftop",
        "exploding house",
        "laptop",
        "tracking device",
        "fake id",
        "seoul south korea",
        "pharmaceutical lab",
        "government conspiracy",
        "roof chase",
        "manila philippines",
        "hunted",
        "false passport",
        "alberta canada",
        "lieutenant general"
      ],
      "user_rating": 6,
      "votes": 2651,
      "release_year": 2012,
      "overview": "New CIA operative, Aaron Cross experiences life-or-death stakes that have been triggered by the previous actions of Jason Bourne.",
      "runtime": 120
    },
    {
      "name": "Lara Croft: Tomb Raider",
      "size": 274703340,
      "keywords": [
        "treasure",
        "buddhist monk",
        "planetary configuration",
        "angkor wat",
        "illuminati",
        "william blake",
        "treasure hunt",
        "archaeologist",
        "based on video game",
        "archeology "
      ],
      "user_rating": 5.7,
      "votes": 2192,
      "release_year": 2001,
      "overview": "English aristocrat Lara Croft is skilled in hand-to-hand combat and in the middle of a battle with a secret society. The shapely archaeologist moonlights as a tomb raider to recover lost antiquities and meets her match in the evil Powell, who's in search of a powerful relic.",
      "runtime": 100
    },
    {
      "name": "The Expendables",
      "size": 274470394,
      "keywords": [
        "tattoo",
        "martial arts",
        "sniper",
        "island",
        "mercenary",
        "bridge",
        "rescue",
        "escape",
        "church",
        "drug",
        "blade",
        "ensemble cast",
        "duringcreditsstinger"
      ],
      "user_rating": 6,
      "votes": 2926,
      "release_year": 2010,
      "overview": "Barney Ross leads a band of highly skilled mercenaries including knife enthusiast Lee Christmas, a martial arts expert, heavy weapons specialist, demolitionist, and a loose-cannon sniper. When the group is commissioned by the mysterious Mr. Church to assassinate the dictator of a small South American island, Barney and Lee visit the remote locale to scout out their opposition and discover the true nature of the conflict engulfing the city.",
      "runtime": 103
    },
    {
      "name": "Bad Boys II",
      "size": 273339556,
      "keywords": [
        "miami",
        "ku klux klan",
        "cuba",
        "undercover",
        "mexican standoff",
        "ecstasy",
        "guantánamo",
        "slaughter",
        "shootout",
        "gunfight",
        "bromance",
        "gangster",
        "violence",
        "foot chase",
        "interrogation",
        "car chase",
        "drug lord",
        "exploding house",
        "narcotics cop",
        "illegal drugs",
        "dea agent",
        "buddy cop",
        "criminal underworld",
        "action hero",
        "haitian gang",
        "minefield"
      ],
      "user_rating": 6.3,
      "votes": 1564,
      "release_year": 2003,
      "overview": "Out-of-control, trash-talking buddy cops Marcus Burnett and Mike Lowrey of the Miami Narcotics Task Force reunite, and bullets fly, cars crash and laughs explode as they pursue a whacked-out drug lord from the streets of Miami to the barrios of Cuba. But the real fireworks result when Marcus discovers that playboy Mike is secretly romancing Marcus’ sexy sister.",
      "runtime": 147
    },
    {
      "name": "The Silence of the Lambs",
      "size": 272742922,
      "keywords": [
        "based on novel",
        "psychopath",
        "horror",
        "suspense",
        "serial killer",
        "psychological thriller",
        "cannibal",
        "fbi agent",
        "animal in cast credits",
        "cannibalism"
      ],
      "user_rating": 8.1,
      "votes": 4443,
      "release_year": 1991,
      "overview": "FBI trainee, Clarice Starling ventures into a maximum-security asylum to pick the diseased brain of Hannibal Lecter, a psychiatrist turned homicidal cannibal. Starling needs clues to help her capture a serial killer. but her Faustian relationship with Lecter soon leads to his escape, and now two deranged killers are on the loose.",
      "runtime": 119
    },
    {
      "name": "The Firm",
      "size": 270248367,
      "keywords": [
        "fbi",
        "law",
        "tennessee",
        "lawyer",
        "law firm",
        "bar exam"
      ],
      "user_rating": 6.6,
      "votes": 501,
      "release_year": 1993,
      "overview": "Mitch McDeere is a young man with a promising future in Law. About to sit his Bar exam, he is approached by 'The Firm' and made an offer he doesn't refuse. Seduced by the money and gifts showered on him, he is totally oblivious to the more sinister side of his company. Then, two Associates are murdered. The FBI contact him, asking him for information and suddenly his life is ruined. He has a choice - work with the FBI, or stay with the Firm. Either way he will lose his life as he knows it. Mitch figures the only way out is to follow his own plan...",
      "runtime": 154
    }
  ],
  "links": [
    {
      "source": "Titanic",
      "target": "Jurassic World",
      "value": 2
    },
    {
      "source": "Jurassic World",
      "target": "Dawn of the Planet of the Apes",
      "value": 3
    },
    {
      "source": "Jurassic World",
      "target": "Terminator Genisys",
      "value": 2
    },
    {
      "source": "Jurassic World",
      "target": "Live Free or Die Hard",
      "value": 2
    },
    {
      "source": "Jurassic World",
      "target": "Jurassic Park III",
      "value": 5
    },
    {
      "source": "Jurassic World",
      "target": "Insurgent",
      "value": 2
    },
    {
      "source": "Jurassic World",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "Jurassic World",
      "target": "The Expendables",
      "value": 2
    },
    {
      "source": "Skyfall",
      "target": "Quantum of Solace",
      "value": 2
    },
    {
      "source": "Skyfall",
      "target": "Mission: Impossible",
      "value": 2
    },
    {
      "source": "Skyfall",
      "target": "True Lies",
      "value": 2
    },
    {
      "source": "The Dark Knight Rises",
      "target": "The Dark Knight",
      "value": 9
    },
    {
      "source": "The Dark Knight Rises",
      "target": "Mission: Impossible",
      "value": 2
    },
    {
      "source": "The Dark Knight Rises",
      "target": "GoldenEye",
      "value": 2
    },
    {
      "source": "The Dark Knight",
      "target": "Fast Five",
      "value": 2
    },
    {
      "source": "The Dark Knight",
      "target": "X2",
      "value": 2
    },
    {
      "source": "The Dark Knight",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "The Da Vinci Code",
      "target": "The Bourne Ultimatum",
      "value": 3
    },
    {
      "source": "The Da Vinci Code",
      "target": "Angels & Demons",
      "value": 3
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Dawn of the Planet of the Apes",
      "value": 3
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "War of the Worlds",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "I Am Legend",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Terminator 2: Judgment Day",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Terminator Genisys",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Terminator Salvation",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Planet of the Apes",
      "value": 2
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "The Maze Runner",
      "value": 3
    },
    {
      "source": "The Hunger Games: Mockingjay - Part 1",
      "target": "Insurgent",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Mission: Impossible - Ghost Protocol",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "I Am Legend",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Mission: Impossible II",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Mission: Impossible",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Terminator Genisys",
      "value": 4
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Terminator 3: Rise of the Machines",
      "value": 4
    },
    {
      "source": "The Matrix Reloaded",
      "target": "The Matrix Revolutions",
      "value": 23
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Mission: Impossible III",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Terminator Salvation",
      "value": 3
    },
    {
      "source": "The Matrix Reloaded",
      "target": "Minority Report",
      "value": 2
    },
    {
      "source": "Gravity",
      "target": "Armageddon",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "I Am Legend",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Terminator 2: Judgment Day",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Rise of the Planet of the Apes",
      "value": 4
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Terminator Genisys",
      "value": 3
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Terminator Salvation",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Planet of the Apes",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "The Maze Runner",
      "value": 2
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Insurgent",
      "value": 3
    },
    {
      "source": "Dawn of the Planet of the Apes",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 3
    },
    {
      "source": "Mission: Impossible - Ghost Protocol",
      "target": "Mission: Impossible - Rogue Nation",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Ghost Protocol",
      "target": "The Matrix Revolutions",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Ghost Protocol",
      "target": "Live Free or Die Hard",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Ghost Protocol",
      "target": "Die Hard: With a Vengeance",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Ghost Protocol",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Rogue Nation",
      "target": "Mission: Impossible",
      "value": 3
    },
    {
      "source": "Mission: Impossible - Rogue Nation",
      "target": "The Bourne Ultimatum",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Rogue Nation",
      "target": "Now You See Me 2",
      "value": 2
    },
    {
      "source": "Mission: Impossible - Rogue Nation",
      "target": "Tomorrow Never Dies",
      "value": 2
    },
    {
      "source": "The Sixth Sense",
      "target": "Ghost",
      "value": 2
    },
    {
      "source": "Fast Five",
      "target": "The Fugitive",
      "value": 2
    },
    {
      "source": "Fast Five",
      "target": "Now You See Me 2",
      "value": 2
    },
    {
      "source": "Fast Five",
      "target": "Taken 3",
      "value": 2
    },
    {
      "source": "War of the Worlds",
      "target": "World War Z",
      "value": 2
    },
    {
      "source": "War of the Worlds",
      "target": "Planet of the Apes",
      "value": 2
    },
    {
      "source": "Quantum of Solace",
      "target": "Mission: Impossible II",
      "value": 2
    },
    {
      "source": "Quantum of Solace",
      "target": "Mission: Impossible",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "Terminator 2: Judgment Day",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "Terminator Genisys",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "Terminator 3: Rise of the Machines",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "The Matrix Revolutions",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "I Am Legend",
      "target": "Terminator Salvation",
      "value": 3
    },
    {
      "source": "I Am Legend",
      "target": "The Maze Runner",
      "value": 2
    },
    {
      "source": "Armageddon",
      "target": "The Day After Tomorrow",
      "value": 3
    },
    {
      "source": "Armageddon",
      "target": "Terminator Genisys",
      "value": 2
    },
    {
      "source": "Armageddon",
      "target": "Inglourious Basterds",
      "value": 2
    },
    {
      "source": "Armageddon",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "Mission: Impossible II",
      "target": "Mission: Impossible",
      "value": 7
    },
    {
      "source": "Mission: Impossible II",
      "target": "The Matrix Revolutions",
      "value": 2
    },
    {
      "source": "Mission: Impossible II",
      "target": "Mission: Impossible III",
      "value": 7
    },
    {
      "source": "Mission: Impossible II",
      "target": "Live Free or Die Hard",
      "value": 2
    },
    {
      "source": "Mission: Impossible II",
      "target": "Die Hard: With a Vengeance",
      "value": 2
    },
    {
      "source": "Mission: Impossible II",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Mission: Impossible II",
      "target": "Bad Boys II",
      "value": 2
    },
    {
      "source": "The Day After Tomorrow",
      "target": "Terminator Salvation",
      "value": 2
    },
    {
      "source": "The Day After Tomorrow",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "The Bourne Ultimatum",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "Mission: Impossible III",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "Taken 3",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "The Revenant",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "World War Z",
      "target": "Terminator 2: Judgment Day",
      "value": 2
    },
    {
      "source": "Terminator 2: Judgment Day",
      "target": "Terminator Genisys",
      "value": 2
    },
    {
      "source": "Terminator 2: Judgment Day",
      "target": "Terminator 3: Rise of the Machines",
      "value": 2
    },
    {
      "source": "Terminator 2: Judgment Day",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "Terminator 2: Judgment Day",
      "target": "Terminator Salvation",
      "value": 3
    },
    {
      "source": "Terminator 2: Judgment Day",
      "target": "The Maze Runner",
      "value": 2
    },
    {
      "source": "Rise of the Planet of the Apes",
      "target": "Planet of the Apes",
      "value": 2
    },
    {
      "source": "Mr. & Mrs. Smith",
      "target": "Mission: Impossible III",
      "value": 2
    },
    {
      "source": "Mr. & Mrs. Smith",
      "target": "G.I. Joe: Retaliation",
      "value": 2
    },
    {
      "source": "X-Men: The Last Stand",
      "target": "X2",
      "value": 4
    },
    {
      "source": "X-Men: The Last Stand",
      "target": "X-Men Origins: Wolverine",
      "value": 3
    },
    {
      "source": "X-Men: The Last Stand",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "The Bourne Ultimatum",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "The Matrix Revolutions",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "Mission: Impossible III",
      "value": 6
    },
    {
      "source": "Mission: Impossible",
      "target": "True Lies",
      "value": 3
    },
    {
      "source": "Mission: Impossible",
      "target": "The Fugitive",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "GoldenEye",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "Tomorrow Never Dies",
      "value": 2
    },
    {
      "source": "Mission: Impossible",
      "target": "Salt",
      "value": 3
    },
    {
      "source": "Mission: Impossible",
      "target": "xXx",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Jason Bourne",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Live Free or Die Hard",
      "value": 3
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "G.I. Joe: Retaliation",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Die Hard: With a Vengeance",
      "value": 4
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Angels & Demons",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Inglourious Basterds",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Air Force One",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Insurgent",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Salt",
      "value": 3
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "The Bourne Supremacy",
      "value": 8
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "The Tourist",
      "value": 2
    },
    {
      "source": "The Bourne Ultimatum",
      "target": "Bad Boys II",
      "value": 3
    },
    {
      "source": "Terminator Genisys",
      "target": "Terminator 3: Rise of the Machines",
      "value": 5
    },
    {
      "source": "Terminator Genisys",
      "target": "The Matrix Revolutions",
      "value": 5
    },
    {
      "source": "Terminator Genisys",
      "target": "Mad Max: Fury Road",
      "value": 2
    },
    {
      "source": "Terminator Genisys",
      "target": "Terminator Salvation",
      "value": 5
    },
    {
      "source": "Terminator Genisys",
      "target": "Planet of the Apes",
      "value": 2
    },
    {
      "source": "Terminator Genisys",
      "target": "Minority Report",
      "value": 2
    },
    {
      "source": "Terminator Genisys",
      "target": "Insurgent",
      "value": 3
    },
    {
      "source": "Terminator Genisys",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "Terminator 3: Rise of the Machines",
      "target": "The Matrix Revolutions",
      "value": 5
    },
    {
      "source": "Terminator 3: Rise of the Machines",
      "target": "Terminator Salvation",
      "value": 5
    },
    {
      "source": "The Matrix Revolutions",
      "target": "Mission: Impossible III",
      "value": 2
    },
    {
      "source": "The Matrix Revolutions",
      "target": "Mad Max: Fury Road",
      "value": 3
    },
    {
      "source": "The Matrix Revolutions",
      "target": "Terminator Salvation",
      "value": 4
    },
    {
      "source": "The Matrix Revolutions",
      "target": "Jurassic Park III",
      "value": 2
    },
    {
      "source": "The Matrix Revolutions",
      "target": "Minority Report",
      "value": 2
    },
    {
      "source": "Jason Bourne",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "X2",
      "target": "X-Men Origins: Wolverine",
      "value": 3
    },
    {
      "source": "X2",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 3
    },
    {
      "source": "Mission: Impossible III",
      "target": "The Curious Case of Benjamin Button",
      "value": 2
    },
    {
      "source": "Mission: Impossible III",
      "target": "Taken 3",
      "value": 2
    },
    {
      "source": "Mission: Impossible III",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 3
    },
    {
      "source": "Mission: Impossible III",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Taken 2",
      "value": 2
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Die Hard: With a Vengeance",
      "value": 8
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Ransom",
      "value": 2
    },
    {
      "source": "Live Free or Die Hard",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 2
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Salt",
      "value": 3
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 4
    },
    {
      "source": "Live Free or Die Hard",
      "target": "The Bourne Supremacy",
      "value": 5
    },
    {
      "source": "Live Free or Die Hard",
      "target": "Bad Boys II",
      "value": 4
    },
    {
      "source": "True Lies",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Mad Max: Fury Road",
      "target": "Terminator Salvation",
      "value": 2
    },
    {
      "source": "Mad Max: Fury Road",
      "target": "The Fugitive",
      "value": 2
    },
    {
      "source": "Mad Max: Fury Road",
      "target": "Minority Report",
      "value": 2
    },
    {
      "source": "Mad Max: Fury Road",
      "target": "The Maze Runner",
      "value": 2
    },
    {
      "source": "Taken 2",
      "target": "Die Hard: With a Vengeance",
      "value": 2
    },
    {
      "source": "Taken 2",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "X-Men Origins: Wolverine",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 3
    },
    {
      "source": "G.I. Joe: Retaliation",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 6
    },
    {
      "source": "Terminator Salvation",
      "target": "The Maze Runner",
      "value": 2
    },
    {
      "source": "The Fugitive",
      "target": "Die Hard: With a Vengeance",
      "value": 2
    },
    {
      "source": "The Fugitive",
      "target": "Taken 3",
      "value": 3
    },
    {
      "source": "Die Hard: With a Vengeance",
      "target": "Se7en",
      "value": 2
    },
    {
      "source": "Die Hard: With a Vengeance",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Die Hard: With a Vengeance",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 3
    },
    {
      "source": "Die Hard: With a Vengeance",
      "target": "The Bourne Supremacy",
      "value": 4
    },
    {
      "source": "Die Hard: With a Vengeance",
      "target": "Bad Boys II",
      "value": 4
    },
    {
      "source": "Planet of the Apes",
      "target": "Insurgent",
      "value": 2
    },
    {
      "source": "GoldenEye",
      "target": "Tomorrow Never Dies",
      "value": 2
    },
    {
      "source": "The Maze Runner",
      "target": "Insurgent",
      "value": 3
    },
    {
      "source": "National Treasure",
      "target": "Lara Croft: Tomb Raider",
      "value": 4
    },
    {
      "source": "The Rock",
      "target": "Ransom",
      "value": 2
    },
    {
      "source": "Now You See Me 2",
      "target": "Tomorrow Never Dies",
      "value": 2
    },
    {
      "source": "Now You See Me 2",
      "target": "Taken 3",
      "value": 2
    },
    {
      "source": "Now You See Me 2",
      "target": "Ocean's Thirteen",
      "value": 2
    },
    {
      "source": "Now You See Me 2",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Now You See Me 2",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "Taken 3",
      "target": "G.I. Joe: The Rise of Cobra",
      "value": 2
    },
    {
      "source": "Taken 3",
      "target": "Salt",
      "value": 2
    },
    {
      "source": "Inglourious Basterds",
      "target": "Bad Boys II",
      "value": 2
    },
    {
      "source": "Ransom",
      "target": "The Silence of the Lambs",
      "value": 2
    },
    {
      "source": "G.I. Joe: The Rise of Cobra",
      "target": "Rambo: First Blood Part II",
      "value": 2
    },
    {
      "source": "G.I. Joe: The Rise of Cobra",
      "target": "Fantastic 4: Rise of the Silver Surfer",
      "value": 2
    },
    {
      "source": "Insurgent",
      "target": "The Bourne Supremacy",
      "value": 2
    },
    {
      "source": "Salt",
      "target": "The Bourne Supremacy",
      "value": 4
    },
    {
      "source": "Salt",
      "target": "Bad Boys II",
      "value": 2
    },
    {
      "source": "The Bourne Supremacy",
      "target": "The Bourne Legacy",
      "value": 2
    },
    {
      "source": "The Bourne Supremacy",
      "target": "Bad Boys II",
      "value": 5
    },
    {
      "source": "The Bourne Supremacy",
      "target": "The Silence of the Lambs",
      "value": 2
    }
  ]
}